--function oldevent_303()
    instruct_1(1040,28,0);   --  1(1):[平一指]说: 你还在这做什麽？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_55(1,-1,14,0) ==false then    --  55(37):事件d*编号1是否为-1是则跳转到:Label0
        instruct_3(-2,1,-2,-2,887,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    end    --:Label0


    if instruct_55(2,-1,14,0) ==false then    --  55(37):事件d*编号2是否为-1是则跳转到:Label1
        instruct_3(-2,2,-2,-2,888,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    end    --:Label1


    if instruct_55(3,-1,14,0) ==false then    --  55(37):事件d*编号3是否为-1是则跳转到:Label2
        instruct_3(-2,3,-2,-2,889,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    end    --:Label2


    if instruct_55(4,-1,14,0) ==false then    --  55(37):事件d*编号4是否为-1是则跳转到:Label3
        instruct_3(-2,2,-2,-2,890,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    end    --:Label3


    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label4
        instruct_1(1041,0,1);   --  1(1):[WWW]说: 没事逛逛．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label4

    instruct_1(1042,0,1);   --  1(1):[WWW]说: 我已将田伯光杀了，*你可以加入我了吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label5
        instruct_1(175,28,0);   --  1(1):[平一指]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label5

    instruct_1(1043,28,0);   --  1(1):[平一指]说: 我平一指说话算话．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_10(28);   --  10(A):加入人物[平一指]
    instruct_37(-1);   --  37(25):增加道德-1
--end

