--function oldevent_132()
    instruct_1(515,0,1);   --  1(1):[WWW]说: 这位大哥，*请问此处是崑仑山吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(516,78,0);   --  1(1):[???]说: 没错，这里就是崑仑山．*你是从中原来的吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(517,0,1);   --  1(1):[WWW]说: 真想不到在此荒寒之处，*竟有这般好地方！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(518,78,0);   --  1(1):[???]说: 没错，*此处原本也是个不毛之地．**但自从开山祖师爷何掌门以*来，历代掌门人於七八十年*中花了极大力气整顿山坳．*派遣弟子东至江南，西至天*竺搬移各种奇花异树到此种*植，才有了目前此番美景．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(519,0,1);   --  1(1):[WWW]说: 何掌门？*莫非就是江湖中人传言的*”崑仑三圣”何足道先生．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(520,78,0);   --  1(1):[???]说: 是的，我师祖琴剑棋三绝，*号称琴圣，剑圣，棋圣之*”崑仑三圣”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(521,0,1);   --  1(1):[WWW]说: 我想拜会贵派现任掌门，*不知可以吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(522,78,0);   --  1(1):[???]说: 掌门师叔可就在里面，*你可以直接进去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,3,-2,-2,133,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,133,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,19,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,163,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
--end

