--function oldevent_929()
    instruct_1(2834,0,1);   --  1(1):[WWW]说: 这位大哥，*道上近来可有啥新鲜事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2835,79,0);   --  1(1):[???]说: 说来好笑．．．．．．．．*前些时候在侯监集，金刀寨*与雪山派的人马，为了抢夺*”玄铁令”而大动干戈，想*不到後来这玄铁令竟落在一*个小娃儿手上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2836,79,4);   --  1(1):[???]说: 这玄铁令的主人，当年赠与*三枚玄铁令给三位对他有恩*之人，答应日後将为持有此*令之人办一件事．***如今最後一枚玄铁令落在这*小丐之手，谢烟客本想可轻*易解决此事，但想不到这小*丐怎麽也不肯求他一事．***不知谢烟客如何处理此事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2837,0,1);   --  1(1):[WWW]说: 不知这谢先生家住何处？*或许小弟可去为他们排解排*解．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2838,79,0);   --  1(1):[???]说: 你以为你是谁，武林盟主？*我看你连摩天崖都上不去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2839,79,4);   --  1(1):[???]说: 是啊！要上这摩天崖，*轻功不到一定程度是上不去*的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2840,0,1);   --  1(1):[WWW]说: 打扰两位兄台了．
    instruct_0();   --  0(0)::空语句(清屏)
--end

