--function oldevent_180()
    instruct_1(642,0,1);   --  1(1):[WWW]说: 这里这麽热闹，*请问在做什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(643,82,0);   --  1(1):[???]说: 本派刘正风刘师叔近日将要*”金盆洗手”，归隐江湖．**江湖上的好朋友这几天都会*陆续来到衡山观礼．**不知阁下是否是刘师叔的朋*友，还请出示请帖．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(644,0,1);   --  1(1):[WWW]说: 哦，是这样子的啊！***想不到武林中的习俗还真不*少，退休了还要办个活动让*大家知道．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(645,82,0);   --  1(1):[???]说: 阁下若无请帖，还请离开．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,-2,-2,182,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,20,-2,-2,182,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
--end

