--function oldevent_306()
    instruct_1(1056,29,0);   --  1(1):[田伯光]说: 怎麽？兄台回心转意了吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,47) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_1(1050,0,1);   --  1(1):[WWW]说: 原来兄台有此雅好，与在下*不谋而合．**不妨咱俩一起结伴，在这江*湖中好好的爽他一爽．
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
            instruct_1(175,29,0);   --  1(1):[田伯光]说: 你的队伍已满，*我无法加入．
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_1(1072,29,0);   --  1(1):[田伯光]说: 好！*你这兄弟一点也不做作．**不像其他假正经的家伙，*只会以名门正派自居．**要知”做那档事”是人心本*能的慾望，何必刻意去掩饰*呢？*我喜欢你，我们就一起去游*戏人间．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_17(-2,1,17,15,2674);   --  17(11):修改场景贴图:当前场景层1坐标11-F
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(29);   --  10(A):加入人物[田伯光]
        instruct_37(-6);   --  37(25):增加道德-6
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(25,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label2
        instruct_1(1053,0,1);   --  1(1):[WWW]说: 兄台自己玩好了，*小弟没这份兴致．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1054,29,0);   --  1(1):[田伯光]说: 少装了，*难不成你有”断袖之癖”．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,-2,-2,306,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
    end    --:Label2

    instruct_1(1051,0,1);   --  1(1):[WWW]说: 什麽！***你这采花淫贼，尽做这些伤*天害理的勾当，今天让我撞*见，算你倒霉．*小侠我要为江湖除害．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(53,3,0,0) ==false then    --  6(6):战斗[53]是则跳转到:Label3
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1052,0,1);   --  1(1):[WWW]说: 今天先饶你不死，希望你改*过向善．**否则日後再叫我撞见，*就”去你的势”，让你去做*太监．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,305,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_56(1);   --  56(38):提高声望值1
--end

