--function oldevent_156()
    instruct_1(597,5,0);   --  1(1):[张三丰]说: 小兄弟想要与老朽切磋武学*的奥妙吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(1,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(598,0,1);   --  1(1):[WWW]说: 还望前辈指导．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(22,0,24,1) ==true then    --  6(6):战斗[22]否则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(599,5,0);   --  1(1):[张三丰]说: 少侠武功已到如此境界，*老朽也没什麽好教你的了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,-2,-2,158,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_56(20);   --  56(38):提高声望值20
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景

    if instruct_28(0,65,100,6,0) ==false then    --  28(1C):判断WWW品德65-100是则跳转到:Label2
        instruct_1(602,5,0);   --  1(1):[张三丰]说: 小兄弟，看来你还需再下一*番努力才是．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2


    if instruct_29(0,40,100,6,0) ==false then    --  29(1D):判断WWW武力40-100是则跳转到:Label3
        instruct_1(602,5,0);   --  1(1):[张三丰]说: 小兄弟，看来你还需再下一*番努力才是．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label3

    instruct_1(603,5,0);   --  1(1):[张三丰]说: 小兄弟资质不错，这是我最*近研究出的一套拳法，名为*太极拳．你拿去好好参详吧*我这套太极拳，和自来武学*之道全然不同，讲究以静制*动，後发制人．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(604,0,1);   --  1(1):[WWW]说: ．．．这．．这．．．．．***是了！这是以慢打快，以静*制动的上乘武学，想不到世*间竟会有如此高明的功夫．*谢谢前辈．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(58,1);   --  2(2):得到物品[太极拳经][1]
    instruct_3(-2,-2,-2,-2,157,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

