--function oldevent_611()
    instruct_1(2270,71,0);   --  1(1):[洪教主]说: 小兄弟，得手了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2271,0,1);   --  1(1):[WWW]说: 哼！我差点就被你利用了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2272,71,0);   --  1(1):[洪教主]说: 你都知道了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2273,0,1);   --  1(1):[WWW]说: ”鹿鼎记”是不是还在你这*边，老头！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2274,71,0);   --  1(1):[洪教主]说: 是在我这没错，你想怎样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2275,0,1);   --  1(1):[WWW]说: 我想怎样！*我想好好搥你一顿．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(95,3,0,0) ==false then    --  6(6):战斗[95]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,-2,-2,-2,612,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(150,1);   --  2(2):得到物品[鹿鼎记][1]
    instruct_56(8);   --  56(38):提高声望值8
--end

