--function oldevent_290()
    instruct_1(988,0,1);   --  1(1):[WWW]说: 林兄剑法不知练的怎样了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(989,36,0);   --  1(1):[林平之]说: 我迫不及待想上四川青城，*诛灭他全派为我双亲报仇．**可是以我现在的功力，恐怕*无法办到．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(992,0,1);   --  1(1):[WWW]说: 林兄别急，凡事慢慢来．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(990,0,1);   --  1(1):[WWW]说: 不然这样好了，我和林兄一*起去，杀光他青城派．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,36,0);   --  1(1):[林平之]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(991,36,0);   --  1(1):[林平之]说: 真的，我们走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(36,3,-2,-2,315,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[青城派]:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(36);   --  10(A):加入人物[林平之]
    instruct_37(-4);   --  37(25):增加道德-4
--end

