--function oldevent_622()

    if instruct_4(159,1,0) ==false then    --  4(4):是否使用物品[可兰经]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_37(2);   --  37(25):增加道德2
    instruct_32(159,-1);   --  32(20):物品[可兰经]+[-1]
    instruct_1(2334,112,0);   --  1(1):[???]说: 这．．这是可兰经．*各位，可兰经拿回来了．．**奉至仁慈的阿拉之名，一切*赞颂，全归阿拉，全世界的*主，至仁至慈的主，报应日*的君主．我们只崇拜祂，只*求祂佑助，求祂引导我们上*正路，祂所祜佑的路，不是*受遣责者的路，也不是迷误*者的路．**少侠，你将敝族圣物从奸人*手中夺回，我和全族人向你*说声谢谢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2335,0,1);   --  1(1):[WWW]说: ＜装酷一点＞*这没什麽，找书本来就是我*拿手的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2336,112,0);   --  1(1):[???]说: 少侠也在找书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2337,0,1);   --  1(1):[WWW]说: 是啊！有些书掉了，我就到*处找找，终究会找到的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2338,112,0);   --  1(1):[???]说: 我这有一本书，不知少侠有*没有在找这一本？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2339,0,1);   --  1(1):[WWW]说: 那一本书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2340,112,0);   --  1(1):[???]说: 书名叫什麽来着．？*对了，叫”书剑恩仇录”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2341,0,1);   --  1(1):[WWW]说: 什麽？*”书剑恩仇录”在你这里，*这正是我要找的其中一本．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2342,112,0);   --  1(1):[???]说: 是吗？*这本书是陈公子送我的，他*说没什麽好看，就摆在我这*边．*你要，就拿去好了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2343,0,1);   --  1(1):[WWW]说: 什麽？*太酷了吧，这本书居然随意*乱丢．*＜哼！那个姓陈的看得懂才*有鬼，耍帅！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2344,112,0);   --  1(1):[???]说: 提起这个，我就想起了陈公*子，他说事情办完要来看我*的，怎麽这麽久还没来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2345,0,1);   --  1(1):[WWW]说: ＜哇！我没望了．难道我比*不上他的酷吗？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2346,112,0);   --  1(1):[???]说: 少侠旅游各地，若有遇到一*名叫陈家洛的人，麻烦告诉*他，就说翠羽黄衫在等他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2347,0,1);   --  1(1):[WWW]说: 好．好．我会记得．*＜会讲才怪＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2348,112,0);   --  1(1):[???]说: 那少侠多保重．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(152,1);   --  2(2):得到物品[书剑恩仇录][1]
    instruct_3(-2,-2,-2,-2,623,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,-2,-2,626,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,626,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
--end

