--function oldevent_1()
    instruct_1(0,1,0);   --  1(1):[胡斐]说: 小兄弟，到此寒天雪地，*不知有何指教？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1,0,1);   --  1(1):[WWW]说: 请问你是胡斐胡大哥吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2,1,0);   --  1(1):[胡斐]说: 正是在下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3,0,1);   --  1(1):[WWW]说: 听说大哥外号"雪山飞狐"*刀法变幻莫测，轻'功也'有如*飞天狐狸般的敏捷．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(4,1,0);   --  1(1):[胡斐]说: 敢情你是来考较我功夫的，*那就动手吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(5,0,1);   --  1(1):[WWW]说: 不是的，我来是想问你有关*一本书的下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(6,1,0);   --  1(1):[胡斐]说: 哼！又是来找”雪山飞狐”*的狂妄小子．*废话休说，动手吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,2,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

