--function oldevent_416()

    if instruct_16(63,1,0) ==false then    --  16(10):队伍是否有[程英]是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(1630,63,1);   --  1(1):[程英]说: 这黑水潭似乎是有人特别布*局过，但却也难不倒我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_38(-2,0,994,990);   --  38(26):修改图层贴图
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,-2,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,5,-2,-2,-1,-1,434,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
--end

