--function oldevent_417()
    instruct_1(1307,66,0);   --  1(1):[瑛姑]说: 臭小子，你是何人，居然进*得了我黑龙潭中．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(63,0,5) ==true then    --  16(10):队伍是否有[程英]否则跳转到:Label0
        instruct_1(1308,63,1);   --  1(1):[程英]说: 五行奇门之术，天下又不是*只有你一人通晓．
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_16(63,5,0) ==false then    --  16(10):队伍是否有[程英]是则跳转到:Label1
        instruct_1(1309,0,1);   --  1(1):[WWW]说: 这也没什麽，辛苦一点，*画个地图就好了．
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_1(1310,66,0);   --  1(1):[瑛姑]说: 到我黑沼中有何贵事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1311,0,1);   --  1(1):[WWW]说: 晚辈见此地布局奇特，心想*必是高人隐居之地，特别前*来寻求指点迷津．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1312,66,0);   --  1(1):[瑛姑]说: 你想知道些什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1313,0,1);   --  1(1):[WWW]说: 晚辈跑遍江湖各地，到处找*寻”十四天书”．不知前辈*是否知道这些书的下落？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1314,66,0);   --  1(1):[瑛姑]说: ＜老天送此人到这，原来是*  是叫我得以报仇雪恨，一*  偿宿愿．＞*四张机，鸳鸯织就欲双飞．*可怜未老头先白，春波碧草*晓寒深处，相对浴红衣．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1315,0,1);   --  1(1):[WWW]说: ＜这阿婆是不是秀逗了，无*  缘无故念些什麽．．．＞**＜啊！该不会是寻找天书的*  口诀，该死，我都忘了记*  下来＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1316,66,0);   --  1(1):[瑛姑]说: 小子，算你运气好，我神算*子瑛姑正好知道”射鵰英雄*传”一书的下落．*只要你帮我办妥一件事，我*就告诉你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1317,0,1);   --  1(1):[WWW]说: 没问题，什麽事，你说吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1318,66,0);   --  1(1):[瑛姑]说: 我要你去杀了段皇爷．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1319,0,1);   --  1(1):[WWW]说: 段皇爷？你是说江湖上人称*”南帝”的段皇爷？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1320,66,0);   --  1(1):[瑛姑]说: 没错，出了这里後，往南走*有个竹屋，此人就住在那．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1321,0,1);   --  1(1):[WWW]说: 听说他武功很高，我怎麽打*得过他？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1322,66,0);   --  1(1):[瑛姑]说: 我给你一条手帕，你先拿给*他看，他在心虚後，你或许*有机会杀了他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1323,0,1);   --  1(1):[WWW]说: 但我听说段皇爷为人仁慈，*是个受人敬爱的仁君，前辈*为什麽要杀他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1324,66,0);   --  1(1):[瑛姑]说: 他为人仁慈？*他眼睁睁的看我孩儿死去，*却不肯伸出援手．．．*要杀不杀随你．***四张机，鸳鸯织就欲双飞．*可怜未老头先白，春波碧草*晓寒深处，相对浴红衣．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(184,1);   --  2(2):得到物品[手帕][1]
    instruct_3(-2,-2,-2,-2,418,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(47,0,1,1,425,426,-1,6150,6150,6150,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [0]
    instruct_8(3);   --  8(8):切换大地图音乐
--end

