--function oldevent_241()

    if instruct_4(126,1,0) ==false then    --  4(4):是否使用物品[梨花酒]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(126,-1);   --  32(20):物品[梨花酒]+[-1]
    instruct_27(3,5722,5748);   --  27(1B):显示动画
    instruct_3(-2,-2,-2,-2,237,242,-1,5722,5748,5722,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(776,35,0);   --  1(1):[令狐冲]说: 嗯！好一坛梨花酒！***曾闻白乐天杭州喜望诗云：*”红袖织绫夸柿叶，*  青旗沽酒趁梨花”．*这坛梨花酒酒味是极好，*只可惜少了股芳冽之气，*若能以翡翠杯盛之而饮，*那更是醇美无比．
    instruct_0();   --  0(0)::空语句(清屏)
--end

