--function oldevent_333()
    instruct_1(36,0,1);   --  1(1):[WWW]说: 这位小哥，你怎麽了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(37,38,0);   --  1(1):[石破天]说: 我．．我．．只记得自己坐*在岩石上练功，突然间全身*半边冰冷，半边火热．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(38,0,1);   --  1(1):[WWW]说: 莫非兄弟被蚊子叮到了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(39,38,0);   --  1(1):[石破天]说: 老伯伯呢？他说要教我练捉*麻雀的本事，却没跟我说练*完会忽冷忽热，难过死了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(40,0,1);   --  1(1):[WWW]说: 捉麻雀的本事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(41,38,0);   --  1(1):[石破天]说: 是啊！*老伯伯先是教我练泥人上的*功夫，*练到後来，常会全身发冷，*可是老伯伯说这是练功应有*之象．*後来老伯伯又教我其它的练*法，可是又更难过了，有时*全身发冷，有时奇热难忍，*练这捉麻雀的本事真辛苦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(42,0,1);   --  1(1):[WWW]说: 原来兄台练功时走火入魔！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(43,38,0);   --  1(1):[石破天]说: 啊！又来了．．*我．．我不．不跟你说了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,334,335,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

