--function oldevent_673()
    instruct_1(2457,0,1);   --  1(1):[WWW]说: 哇，真香．*流浪在外这麽久，闻到这味*道，不禁怀念起妈妈来了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2458,75,0);   --  1(1):[???]说: 小兄弟，别客气．*想吃什麽就跟我林厨子说一*声．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2459,0,1);   --  1(1):[WWW]说: 老伯伯，你煮的菜好像都很*好吃耶，闻起来都很香．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2460,75,0);   --  1(1):[???]说: 其实啊，做菜没什麽秘诀，*只要有着一颗为食用者着想*的心即可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2461,0,1);   --  1(1):[WWW]说: ”为食用者着想的心”？*＜听起来好像料理漫画中的*名言＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2462,75,0);   --  1(1):[???]说: 是的．*一个厨师不能只想到要将自*己的菜做得多色香味俱全，*而应该想着是什麽人要吃你*这道菜，怎样的口味是最适*合他，而去调理．*因为这道菜终究是要给人吃*的，而不是拿来观赏或评论*的．*总之，就是在做菜的时候，*就要尽可能的为食用者去着*想．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2463,0,1);   --  1(1):[WWW]说: 那林师父最擅长的拿手菜是*什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2464,75,0);   --  1(1):[???]说: 一时也说不尽．*比如说是炒白菜啦，蒸豆腐*啦，炖鸡蛋啦，白切肉．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2465,0,1);   --  1(1):[WWW]说: 可是听起来好像都是一些很*平常的菜肴．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2466,75,0);   --  1(1):[???]说: 年轻人，要知真正的烹调高*手，愈是在平凡的菜肴中，*愈能显出真实的本领．*你也是学武的吧，其实这道*理跟武学一般，能在平淡之*中现神奇，才说得上是大宗*匠的手段．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2467,0,1);   --  1(1):[WWW]说: ．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2468,75,0);   --  1(1):[???]说: 你好好想一想吧．*想通了对你武学也是大有助*益．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,674,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_34(0,3);   --  34(22):WWW增加资质3
    instruct_0();   --  0(0)::空语句(清屏)
--end

