--function oldevent_419()
    instruct_1(1330,66,0);   --  1(1):[瑛姑]说: 小子，事情办好了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1331,0,1);   --  1(1):[WWW]说: 晚辈已见过了段皇爷．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1332,66,0);   --  1(1):[瑛姑]说: 你杀了他了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1333,0,1);   --  1(1):[WWW]说: 没有．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1334,66,0);   --  1(1):[瑛姑]说: 哼！连这事都办不好，我原*本还指望你上桃花岛帮我救*周伯通呢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1335,0,1);   --  1(1):[WWW]说: 救周伯通？他早己不在桃花*岛了，听说他逃了出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1336,66,0);   --  1(1):[瑛姑]说: 真的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1337,0,1);   --  1(1):[WWW]说: 晚辈觉得前辈还是不要报这*个仇，何况你儿子也不是段*皇爷所杀的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1338,66,0);   --  1(1):[瑛姑]说: 虽非他所杀，*但也是被他害死的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1339,0,1);   --  1(1):[WWW]说: 段皇爷不肯救你儿子，*也是因为爱你啊．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1340,66,0);   --  1(1):[瑛姑]说: 哼，爱我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1341,0,1);   --  1(1):[WWW]说: 他是喝周前辈的醋．*若是不爱你，他为什麽要喝*醋？*他见到你那块”四张机”的*鸳鸯锦帕，实是伤心至极．*依我看这件事还是算了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1342,66,0);   --  1(1):[瑛姑]说: ．．．．．***那好，只要你把周伯通找来*见我，我就告诉你”射鵰英*雄传”一书的下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1343,0,1);   --  1(1):[WWW]说: 这个简单，只要不叫我去杀*好人都可以．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,421,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(20,4,-2,-2,411,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[百花谷]:场景事件编号 [4]
    instruct_3(47,0,-2,-2,428,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [0]
    instruct_8(3);   --  8(8):切换大地图音乐
--end

