--function oldevent_581()
    instruct_1(2036,0,1);   --  1(1):[WWW]说: 贤弟，我们走了吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label0
        instruct_1(175,49,0);   --  1(1):[虚竹]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_46(49,300);   --  46(2E):虚竹增加内力300
    instruct_48(49,200);   --  48(30):虚竹增加生命200
    instruct_47(49,30);   --  47(2F):虚竹增加攻击力30
    instruct_45(49,20);   --  45(2D):虚竹增加轻功20
    instruct_33(49,15,0);   --  33(21):虚竹学会武功天山六阳掌
    instruct_49(49,2);   --  49(31):虚竹内力属性2
    instruct_10(49);   --  10(A):加入人物[虚竹]
--end

