--function oldevent_491()

    if instruct_16(53,1,0) ==false then    --  16(10):队伍是否有[段誉]是则跳转到:Label0
        do return; end
    end    --:Label0


    if instruct_60(-2,2,6298,1,0) ==false then    --  60(3C):判断场景-2事件位置2是否有贴图6298是则跳转到:Label1
        do return; end
    end    --:Label1

    instruct_1(1742,53,1);   --  1(1):[段誉]说: 兄弟，我决定要留下来陪神*仙姊姊，服侍她．*你自己走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1743,0,1);   --  1(1):[WWW]说: 段兄，这王姑娘不是你的神*仙姊姊，更何况人家喜欢的*是她表哥，别自作多情了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1744,53,1);   --  1(1):[段誉]说: 兄弟，我心意已决，你自己*保重吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,3,1,1,492,-1,-1,6310,6310,6310,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_21(53);   --  21(15):[段誉]离队
--end

