--function oldevent_147()
    instruct_3(-2,6,-2,-2,146,-1,-1,5398,5398,5398,-2,14,40);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,10,-2,-2,146,-1,-1,5398,5398,5398,-2,47,40);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,4,-2,-2,146,-1,-1,5398,5398,5398,-2,28,34);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,8,-2,-2,146,-1,-1,5398,5398,5398,-2,35,34);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,11,0,0,-1,-1,-1,-1,-1,-1,0,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,18,0,0,-1,-1,-1,-1,-1,-1,0,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,0,0,-1,-1,-1,-1,-1,-1,0,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
--end

