--function oldevent_127()
    instruct_1(502,8,0);   --  1(1):[唐文亮]说: 小兄弟别在崆峒派逗留了，*我六大派即将围攻魔教总坛*光明顶了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(1,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(503,0,1);   --  1(1):[WWW]说: 在下愿领教领教崆峒派的七*伤拳绝技．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(504,8,0);   --  1(1):[唐文亮]说: 小子，你自寻死路．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(16,3,0,0) ==false then    --  6(6):战斗[16]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(505,0,1);   --  1(1):[WWW]说: 七伤拳也不过如此．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(490,8,0);   --  1(1):[唐文亮]说: 哼！小兄弟留下个字号，*他日我唐文亮再向你请教．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(491,0,1);   --  1(1):[WWW]说: 字号？好吧，记着，*”软世派河洛分舵”*金庸堂堂主是也．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(492,8,0);   --  1(1):[唐文亮]说: ”软世派河洛分舵”？*没听过．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,128,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_56(3);   --  56(38):提高声望值3
--end

