--function oldevent_297()
    instruct_1(1016,86,0);   --  1(1):[???]说: 大侠别杀我，我是”青城四*秀”中的侯人雄．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1017,0,1);   --  1(1):[WWW]说: 你这头狗熊，想干什麽，*凭什麽要我不杀你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1018,86,0);   --  1(1):[???]说: 我知道个秘密．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1019,0,1);   --  1(1):[WWW]说: 你说．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1020,86,0);   --  1(1):[???]说: 林震南死前曾要我转告他儿*子．．．**”福州向阳巷老宅地窖中的*物事，是林家祖传之物，须*得好好保管．．．．*但他曾祖远图公留有遗训，*林家子孙，不得翻看，否则*後患无穷．”*这事我连师父也没说，说出*来给少侠参考．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1021,0,1);   --  1(1):[WWW]说: 好，不错，这讯息似乎有点*用处，我就放过你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1022,86,0);   --  1(1):[???]说: 谢谢少侠，少侠这麽好心，*将来一定娶个美娇娘．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1023,0,1);   --  1(1):[WWW]说: 这话听来还蛮舒服的．*你本质还不坏，别跟着这坏*人了，快回家种田去吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1024,86,0);   --  1(1):[???]说: 是．．是 ．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(56,1,-2,-2,289,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [1]
    instruct_14();   --  14(E):场景变黑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

