--function oldevent_322()
    instruct_1(1124,19,0);   --  1(1):[岳不群]说: 少侠，老夫听说你独自攻上*这黑木崖来，特别率我五岳*派门徒赶上来帮你．*东方不败那魔头呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1125,0,1);   --  1(1):[WWW]说: 唉！*你们怎麽跟电影剧情一样，*事情都结束後才出现．*东方不败那个变态家伙，*已经被我”干掉”了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1126,19,0);   --  1(1):[岳不群]说: 真是如此！*少侠又替我武林正派立了一*项大功．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1127,0,1);   --  1(1):[WWW]说: 那里，那里．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1128,19,0);   --  1(1):[岳不群]说: 那不知少侠是否有看到一本*书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1129,0,1);   --  1(1):[WWW]说: 什麽书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1130,19,0);   --  1(1):[岳不群]说: ”笑傲江湖”！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1131,0,1);   --  1(1):[WWW]说: 当然有啊！*我辛苦了半天，还不都是为*了它．*任老头将它送给我了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1132,19,0);   --  1(1):[岳不群]说: 这又是另一项功劳了．*少侠真当为我武林同道所敬*仰．*此书乃是我五岳剑派许多前*辈当年拼命所得到的，後来*不幸被魔教夺去．*我五岳派这几年发奋图强，*与魔教周旋到底，为的就是*将此书夺回．*想不到今日少侠大显神威，*从魔教手中将此书夺回，我*五岳派全体上下无限感激．*现在就请少侠将此书还与我*五岳派．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1133,0,1);   --  1(1):[WWW]说: ＜说了半天，原来也是想要*  ”笑傲江湖”这本书＞**不过据我所知，这本书的原*主人也不是五岳剑派的人．*你们前辈只是暂时得到过．*今天，我的任务就是要将这*些书送回原处，你们以後也*不用再为此烦心．*更何况这书也不是你们想像*中的什麽高深武功秘笈，*它只不过是本故事书罢了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1134,19,0);   --  1(1):[岳不群]说: 莫非，少侠是想将此书占为*己有．*还是你已与魔教勾结了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1135,0,1);   --  1(1):[WWW]说: 岳先生，你别给我乱安罪名*了．**这书真的不是你们想像中的*什麽高深武功秘笈，*它只不过是本故事书罢了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1136,19,0);   --  1(1):[岳不群]说: 看来少侠入魔已深，非得要*逼我们动手不可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1137,0,1);   --  1(1):[WWW]说: 我看是你岳不群入魔已深．*那日嵩山大会上我就有点被*”耍”的感觉．*今天，你为了抢这本”笑傲*江湖”又想不择手段．**今日你怎会突然出现，分明*就是早已算计好的，想等我*跟东方不败鹤蚌相争，*你好来个渔翁得利．***我看你不是”君子剑”，*分明是个”伪君子”！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1138,19,0);   --  1(1):[岳不群]说: 你．．．你说什麽！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(35,0,5) ==true then    --  16(10):队伍是否有[令狐冲]否则跳转到:Label0
        instruct_1(1139,35,1);   --  1(1):[令狐冲]说: 师父，别再执迷下去了．*这书的确不是武功秘笈，*只是一本普通的书．
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(1140,0,1);   --  1(1):[WWW]说: 岳先生，回头是岸．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1141,19,0);   --  1(1):[岳不群]说: 别说这麽多的废话，五岳派*的人听着，给我杀，今日不*留一个活口．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(56,3,0,0) ==false then    --  6(6):战斗[56]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,61,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,62,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,63,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
    instruct_3(-2,64,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
    instruct_3(-2,65,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
    instruct_3(-2,66,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
    instruct_3(-2,67,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
    instruct_3(-2,68,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
    instruct_3(-2,69,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
    instruct_3(-2,70,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
    instruct_3(-2,71,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
    instruct_3(-2,72,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [72]
    instruct_3(-2,73,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [73]
    instruct_3(-2,74,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [74]
    instruct_3(-2,75,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [75]
    instruct_3(-2,76,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [76]
    instruct_3(-2,77,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [77]
    instruct_3(-2,78,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [78]
    instruct_3(-2,79,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
    instruct_3(-2,80,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
    instruct_3(-2,81,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
    instruct_3(-2,83,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,84,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
    instruct_3(-2,85,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [85]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1142,0,1);   --  1(1):[WWW]说: 五岳派的各位，今日多有冒*犯之处，请多包涵．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1143,19,0);   --  1(1):[岳不群]说: 哼！我们走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,56,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,57,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
    instruct_3(-2,58,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,59,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,60,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1144,0,1);   --  1(1):[WWW]说: 想不到在找寻这本书的过程*中，让我看到人性中为了争*权夺利所展现的丑陋面．*不管是正派中的左冷禅与岳*不群，还是邪派中的任我行*与东方不败，都是一样的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,87,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [87]
    instruct_3(-2,88,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [88]
    instruct_3(-2,89,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [89]
    instruct_3(-2,90,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [90]
    instruct_3(-2,91,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [91]
    instruct_3(-2,92,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [92]
    instruct_3(-2,93,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [93]
    instruct_3(31,0,-2,-2,329,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[恒山派]:场景事件编号 [0]
    instruct_3(31,1,-2,-2,329,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[恒山派]:场景事件编号 [1]
    instruct_3(29,0,-2,-2,330,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[泰山派]:场景事件编号 [0]
    instruct_3(29,1,-2,-2,330,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[泰山派]:场景事件编号 [1]
    instruct_3(58,10,-2,-2,331,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[衡山派]:场景事件编号 [10]
    instruct_3(58,11,-2,-2,331,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[衡山派]:场景事件编号 [11]
    instruct_3(57,0,-2,-2,332,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [0]
    instruct_3(57,1,-2,-2,332,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
    instruct_56(12);   --  56(38):提高声望值12
--end

