--function oldevent_426()

    if instruct_4(184,1,0) ==false then    --  4(4):是否使用物品[手帕]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(184,-1);   --  32(20):物品[手帕]+[-1]
    instruct_1(1354,65,0);   --  1(1):[一灯]说: ．．．这是瑛姑给你的吗？*她要你来这做什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1355,0,1);   --  1(1):[WWW]说: 晚辈想先见到段皇爷．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1356,65,0);   --  1(1):[一灯]说: 段皇爷早不在尘世啦，*我现下叫作一灯和尚．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1357,0,1);   --  1(1):[WWW]说: 原来大师就是段皇爷．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1358,65,0);   --  1(1):[一灯]说: 瑛姑叫你拿这手帕来，*是要你杀了我吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1359,0,1);   --  1(1):[WWW]说: ＜好厉害，竟已知道我的来*  意＞**晚辈实有要事相求於她，但*她却以弑杀大师为胁，不知*大师跟她有什麽恩怨？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1360,65,0);   --  1(1):[一灯]说: 唉！这中间的情由说来话长*．．．．．．．．．**这事原由说起来，还是与华*山论剑争夺真经一事有关．**那一年全真教主王重扬真人*得了真经，与他师弟周伯通*前来大理．．．*一日，周师兄撞见我众妃中*的刘贵妃正在练武，周兄生*性天真烂漫，两人因而讨论*起武学来．．．***後来一个教一个学，周师兄*血气方刚，贵妃正当妙龄，*两人肌肤相接，日久生情，*终於闹到了难以收拾的田地*．．．．．．．**後来我知道这件事後，就命*他们结为夫妇．那知周兄大*叫大嚷，说他决计不干，然*後就离宫而去．．，後来不*知如何的受困於桃花岛．．*但不久之後逃出来．．*那知过了一年半後某一晚，*刘贵妃抱着一个小孩哭着来*找我，我起身一瞧，只见这*孩子伤势很重．．．．*待我仔细看後，才知道原来*是我对头以为孩子是我的，*就打伤他，想逼我大耗元气*来医疗他．．．**我踌躇良久，见刘贵妃哭的*可怜，好几次想开口说要给*他医治，但每次想到只要这*一出手，日後华山二次论剑*，便无望独霸群雄，那九阴*真经也就难得手．．．*为了此经，我仁爱之心竟然*全丧，一直沉吟了大半个时*辰，方始决定为他医治．*唉！在这大半个时辰之中，*我实在是个禽兽不如的卑鄙*小人．．．*那知我在准备给那孩子医治*之时，看见孩子身上裹着一*条手帕，正是当初她和周师*兄的定情信物，我一怒之下*就对她说，这是你们俩生的*孩子，我为什麽要耗损精力*来救活他．．．*後来，这孩子就死了．．．**这事过後，我不饮不食，苦*思了三日三夜，终於大彻大*悟，将皇位传给我大儿子，*就此出家为僧．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1361,0,1);   --  1(1):[WWW]说: 那刘贵妃就是瑛姑吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1362,65,0);   --  1(1):[一灯]说: 正是．多年来，她一直想为*她的孩子报仇．**唉！她何必找人来杀我呢，*其实我罪孽深重，我天天等*她来将匕首刺入我的心中，*了结这场罪恶．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(21,1,-2,-2,419,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [1]
    instruct_3(-2,-2,-2,-2,427,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号

    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label1
        instruct_1(1364,0,1);   --  1(1):[WWW]说: 想不到这中间的恩怨是如此*复杂．*唉！又是”情”字．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_37(-1);   --  37(25):增加道德-1

    if instruct_6(68,0,35,1) ==true then    --  6(6):战斗[68]否则跳转到:Label2
        instruct_3(21,1,-2,-2,420,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [1]
        instruct_3(-2,-2,-2,-2,-1,-1,-1,6226,6226,6226,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_37(-10);   --  37(25):增加道德-10
        instruct_56(10);   --  56(38):提高声望值10
        do return; end
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1363,65,0);   --  1(1):[一灯]说: 阁下还是回去请瑛姑亲自来*动手吧，我会在这等她的．
    instruct_0();   --  0(0)::空语句(清屏)
--end

