--function oldevent_38()

    if instruct_18(173,0,20) ==true then    --  18(12):是否有物品[一朵蓝花]否则跳转到:Label0
        instruct_3(-2,-2,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_1(143,0,1);   --  1(1):[WWW]说: 咦！头比较不晕了，反而有*股淡淡的微香，这朵蓝花真*是神奇．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(141,0,1);   --  1(1):[WWW]说: 啊！又闻到这香味了，*看来我又得昏倒了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,5974,5992);   --  27(1B):显示动画
    instruct_14();   --  14(E):场景变黑
    instruct_19(30,49);   --  19(13):主角移动至1E-31
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(-1,6014,6024);   --  27(1B):显示动画
    instruct_1(142,0,1);   --  1(1):[WWW]说: 又昏倒了，看来我得想想办*法才是．
    instruct_0();   --  0(0)::空语句(清屏)
--end

