--function oldevent_959()
    instruct_1(2728,17,0);   --  1(1):[王难姑]说: 少侠别来无恙？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(2729,0,1);   --  1(1):[WWW]说: 一切还好．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2730,0,1);   --  1(1):[WWW]说: 少了王前辈的神奇解毒术，*中毒时都不知该怎麽办，不*知王前辈能再帮我忙吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,17,0);   --  1(1):[王难姑]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(2731,17,0);   --  1(1):[王难姑]说: 少侠的救命之恩，王难姑一*辈子都报答不完．*所以这个忙是一定要帮的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(17);   --  10(A):加入人物[王难姑]
--end

