--function oldevent_511()
    instruct_1(1880,0,1);   --  1(1):[WWW]说: 晚辈参见方丈．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(51,204,0) ==false then    --  16(10):队伍是否有[慕容复]是则跳转到:Label0
        instruct_1(1881,70,0);   --  1(1):[玄慈]说: 阿弥陀佛．*近来江湖上已甚少听到明教*为非作歹之事，这真多亏了*少侠．***光明顶之役，少侠能在不杀*一人下化解了武林的这场大*浩劫，减少了生灵的涂炭，*功劳不小，真可谓是英雄出*少年．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1882,0,1);   --  1(1):[WWW]说: 大师过奖了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1883,70,0);   --  1(1):[玄慈]说: 不知此次少侠上我少林有何*贵事？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1884,0,1);   --  1(1):[WWW]说: 大师应该有听说吧．*我正在找一些书籍，线索并　*不是很多，心想少林寺乃武　*林重地，於是就到这儿来找　*找看，就算找不到书，如能　*学到一点功夫保身也不错，　*因为少林寺乃正派武学的最　*高殿堂，七十二项绝技随便　*精通一样就不得了了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1885,70,0);   --  1(1):[玄慈]说: 关於少侠要找书的事，老衲*是略有所闻．不过这十四本*书少林寺中并没有，且少林*寺也不会要这些书．*因为我少林一派自达摩祖师*爷创立以来，对於武学的研*究一直不余遗力，到今日也*小有成就．*少林寺的七十二项绝技，本*寺中人一生能通晓十项以上*的已是寥寥无几，所以更不*用说会对本派以外的武功存*有什麽兴趣．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1886,0,1);   --  1(1):[WWW]说: 对於少林寺七十二项绝技，*晚辈心仪已久，不知方丈愿*不愿意传授一些．
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_28(0,70,100,20,0) ==false then    --  28(1C):判断WWW品德70-100是则跳转到:Label1
            instruct_1(1894,70,0);   --  1(1):[玄慈]说: 少侠眼中泛有戾气，似乎已*将武学用於邪道．老衲说什*麽也不能让少林武学用於邪*道之上，望少侠早日回头．
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,-2,-2,-2,513,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            do return; end
        end    --:Label1

        instruct_1(1887,70,0);   --  1(1):[玄慈]说: 我看你行事正直，老衲颇为*欣赏．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1888,0,1);   --  1(1):[WWW]说: 谢谢大师抬爱．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1889,70,0);   --  1(1):[玄慈]说: 但这七十二项绝技是少林寺*镇寺之宝，不能传给外人．*除非少侠愿入佛门．．．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1890,0,1);   --  1(1):[WWW]说: 是这样子的啊．．．*＜要我剃个大光头当和尚*不知有多少少女会心碎＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1891,70,0);   --  1(1):[玄慈]说: 不过除了七十二项绝技外，*本寺还有许多功夫是给俗家*子弟练的功夫，譬如说．．*”达摩剑法”就是其中一项*．．．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1892,0,1);   --  1(1):[WWW]说: 方丈是说，不用剃光头也可*以学的武功，那我要．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1893,70,0);   --  1(1):[玄慈]说: 好，我就送你一本达摩剑谱*让你参详，望你学会这剑法*後能多做善事，济弱扶倾．*另外，在本寺中，如果有你*需要的东西，尽管拿，别客*气．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(76,1);   --  2(2):得到物品[达摩剑谱][1]
        instruct_3(-2,-2,-2,-2,515,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号

        if instruct_55(17,-1,14,0) ==false then    --  55(37):事件d*编号17是否为-1是则跳转到:Label2
            instruct_3(-2,17,-2,-2,874,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
        end    --:Label2


        if instruct_55(18,-1,14,0) ==false then    --  55(37):事件d*编号18是否为-1是则跳转到:Label3
            instruct_3(-2,18,-2,-2,875,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
        end    --:Label3


        if instruct_55(19,-1,14,0) ==false then    --  55(37):事件d*编号19是否为-1是则跳转到:Label4
            instruct_3(-2,19,-2,-2,876,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
        end    --:Label4


        if instruct_55(20,-1,14,0) ==false then    --  55(37):事件d*编号20是否为-1是则跳转到:Label5
            instruct_3(-2,20,-2,-2,877,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
        end    --:Label5


        if instruct_55(21,-1,14,0) ==false then    --  55(37):事件d*编号21是否为-1是则跳转到:Label6
            instruct_3(-2,21,-2,-2,878,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
        end    --:Label6

        do return; end
    end    --:Label0

    instruct_1(1831,51,1);   --  1(1):[慕容复]说: 大师，我们是来向你借一样*东西的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1832,70,0);   --  1(1):[玄慈]说: 不知施主要跟老衲借什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1833,51,1);   --  1(1):[慕容复]说: 一份信件．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1834,70,0);   --  1(1):[玄慈]说: 一份信件？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1835,51,1);   --  1(1):[慕容复]说: 没错，一份信件．*一份当年武林夙宿们共同草*拟的信件．．．*一份证明现在丐帮帮主乔峰*并不是汉人，而是契丹人的*信件．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1836,70,0);   --  1(1):[玄慈]说: 你是谁！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1837,51,1);   --  1(1):[慕容复]说: 在下姑苏慕容复．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1838,70,0);   --  1(1):[玄慈]说: 你是慕容复，你如何知道此*事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1839,51,1);   --  1(1):[慕容复]说: 我自然知道．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1840,70,0);   --  1(1):[玄慈]说: 是了，一定是那个人告诉你*的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1841,0,1);   --  1(1):[WWW]说: 慕容公子，这是怎麽回事？*什麽汉人，契丹人的？   　　　　　　　　　　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1842,51,1);   --  1(1):[慕容复]说: 你不知道吧，我看恐怕江湖*上也没几个人会知道，原来*我们丐帮现任的帮主乔峰乔*大侠，并不是汉人，而是血*腥屠杀汉人的契丹狗．**当年这位玄慈方丈率领中原*群侠，误杀了一名契丹人．*而那名契丹人留有一子，中*原群侠因为愧疚想好好照顾*他，就决定由少林寺私下扶*养他长大，．．．*後来那个孩子当上了丐帮帮*主，他就是乔峰．**可是呢，当年那些中原群侠*又怕乔峰体内所流露的契丹*性格，将来会爆发出来，危*害到中原武林，於是就写了*一份信件，说明了乔峰的身*份，一旦他野性暴露，就将*他的身份揭发出来，让中原*群侠一起对付他，就像对付*他爹一样．*所以呢，今天我们只要弄到*这信件，就可让乔峰羞愧的*无地自容，*兄弟你自然也能轻易地得到*”天龙八部”了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1843,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，阿弥陀佛！*当年我们的确误杀了乔峰他*父亲．如今他的儿子有这番*成就，大仁大义，就是连汉*人也比不上的，老衲是不会*将那封信件交给你们的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1844,51,1);   --  1(1):[慕容复]说: 方丈话别说的这麽快．*兄弟，接下来我会让你知道*带我来的好处．*方丈，你还记得”叶二娘”*吧？**还记得”紫云洞相会”之事*还记得”乔婆婆接生”之事*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1845,70,0);   --  1(1):[玄慈]说: 你．．你．．*你怎麽知．．知道的．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1846,51,1);   --  1(1):[慕容复]说: 我知道的还很多，要不要我*再讲下去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1847,70,0);   --  1(1):[玄慈]说: 不要再讲了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1848,51,1);   --  1(1):[慕容复]说: 那信件呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1849,70,0);   --  1(1):[玄慈]说: 这．．．．．．***唉！．．．*你们拿去吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1850,51,1);   --  1(1):[慕容复]说: 兄弟，得手了，我们去丐帮*揭发乔峰吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1851,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，阿弥陀佛！*施主得饶人处且饶人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,512,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_2(183,1);   --  2(2):得到物品[带头大哥书信][1]
    instruct_37(-3);   --  37(25):增加道德-3
    instruct_3(-2,0,-2,-2,-1,-1,514,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,-1,-1,514,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,-1,-1,514,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
--end

