--function oldevent_206()
    instruct_25(41,29,33,29);   --  25(19):场景移动41-29--33-29
    instruct_1(703,22,0);   --  1(1):[左冷禅]说: 我五岳剑派同气连枝，百余*年来携手结盟，早便如同一*家．*兄弟忝为五派盟主，亦已多*历年所．只是近来武林中出*了不少大事，兄弟与五岳剑*派的前辈师兄们商量，均觉*若非连成一派，统一号令，*来日大难，只怕不易抵挡．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(704,20,0);   --  1(1):[莫大]说: 不知左盟主和那一派的前辈*师兄们商量过了？怎地我莫*某人不知其事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(705,22,0);   --  1(1):[左冷禅]说: 兄弟适才说到，武林中出了*不少大事，五派非合而为一*不可．*其中一件大事，便是咱们五*派中人，自相残杀，不顾同*盟义气．*莫大先生，我嵩山派弟子费*师弟，在衡山城外丧命．**有人亲眼目睹，说是你莫大*先生下的毒手，不知此事可*真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(706,20,0);   --  1(1):[莫大]说: 并无其事！谅莫某这一点微*末道行，怎杀得了那大嵩阳*手？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(707,22,0);   --  1(1):[左冷禅]说: 莫兄，这件事你也不用太过*担心，等我五派合并之後，*莫兄和我也是师兄弟了．*死者已矣，活着的人又何必*再逞凶杀，多造杀孽？*莫兄，你说是不是呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(708,20,0);   --  1(1):[莫大]说: 哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(709,22,0);   --  1(1):[左冷禅]说: 南岳衡山派於并派之议，是*无意见了．东岳泰山派天门*道兄，贵派意思如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(710,23,0);   --  1(1):[天门]说: 泰山派自祖师爷东灵道长创*派以来，已三百余年．贫道*无德无能，不能发扬光大泰*山一派，可是这三百多年的*基业，说什麽也不能自贫道*手中断绝．*并派之议，万万不能从命．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(711,22,0);   --  1(1):[左冷禅]说: 道兄此言差矣．五派合并後*我五岳派声势壮大，其下各*个弟子，那一个不沾到光？*道兄何必为这区区泰山派掌*门一职的私心，而阻扰了全*派的大业．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(712,23,0);   --  1(1):[天门]说: 我这掌门人，做不做有什麽*干系？只是泰山一派，恁说*也不能在我手中给人并吞．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(713,22,0);   --  1(1):[左冷禅]说: 道兄说了这麽多，*心中却就是为了放不下掌门*人的名位．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(714,23,0);   --  1(1):[天门]说: 你真道我是如此私心？*好，从此刻起，我这掌门人*不做了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(715,22,0);   --  1(1):[左冷禅]说: 道兄是赞成此事了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(716,23,0);   --  1(1):[天门]说: 你．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(717,0,1);   --  1(1):[WWW]说: ＜这老道性子太急了，一被*激就着了人家的道＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(718,21,0);   --  1(1):[定闲]说: 左盟主已然身为五岳剑派盟*主，位望何等尊崇，何必定*要并五派，由一人任掌门．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(719,22,0);   --  1(1):[左冷禅]说: 师太此言差矣．左某只是提*议五派合并．**这掌门之位，当然还是要由*我五派之人推举出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(33,29,41,29);   --  25(19):场景移动33-29--41-29
    instruct_30(41,29,35,29);   --  30(1E):主角走动41-29--35-29
    instruct_1(720,0,1);   --  1(1):[WWW]说: 我看别讨论了，学武之人，*就在武功下见真章．*来来来，有谁要跟我打？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(721,22,0);   --  1(1):[左冷禅]说: 不知阁下是谁？竟擅闯我嵩*山派，你不知道我五岳派在*此聚会吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(722,19,0);   --  1(1):[岳不群]说: 这位少侠前些时日来到我华*山，*我已让他入我华山派了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(723,22,0);   --  1(1):[左冷禅]说: 原来是华山派的弟子，照如*此说，岳先生也是赞成这*”比剑夺帅”的方法了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(724,19,0);   --  1(1):[岳不群]说: 比剑夺帅，原也是一法，*但只可点到为止，*以免伤了和气．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(725,23,0);   --  1(1):[天门]说: 原来华山派是赞成并派的，*我天门就先来领教你华山派*的高招．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(727,0,1);   --  1(1):[WWW]说: 这让我来就可以了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(30,3,0,0) ==false then    --  6(6):战斗[30]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(728,0,1);   --  1(1):[WWW]说: 承让了，道长．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(729,21,0);   --  1(1):[定闲]说: 让我定闲来领教领教华山派*的高招．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(31,3,0,0) ==false then    --  6(6):战斗[31]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(730,0,1);   --  1(1):[WWW]说: 承让了，师太．*接下来不知是那位．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(731,20,0);   --  1(1):[莫大]说: 你连战两场，*先下去休息吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(732,0,1);   --  1(1):[WWW]说: 没关系，少年人体力充沛，*莫掌门请出手吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(32,3,0,0) ==false then    --  6(6):战斗[32]是则跳转到:Label2
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(733,22,0);   --  1(1):[左冷禅]说: 真所谓”长江後浪推前浪”*华山派岳先生为了今天，*想必已筹划很久了吧．*若左某也败了，我嵩山派自*当奉岳先生为掌门．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(33,3,0,0) ==false then    --  6(6):战斗[33]是则跳转到:Label3
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(734,0,1);   --  1(1):[WWW]说: 终於都解决了，好累．*左冷禅，看来你的阴谋是无*法达成了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(735,22,0);   --  1(1):[左冷禅]说: 我不该低估你的．*岳不群．想不到你的心计比*我还深，左某是输你一筹．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(736,0,1);   --  1(1):[WWW]说: 胡说八道，人家岳先生才不*想做什麽掌门呢．**今天我来，其最主要的就是*要阻止你并派的阴谋．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(737,22,0);   --  1(1):[左冷禅]说: 岳兄当真不做这五岳派的掌*门？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(738,19,0);   --  1(1):[岳不群]说: 没错，我是跟这位少侠提到*过，急於合并各派，实是难*如登天，且会引起武林纠纷
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(739,0,1);   --  1(1):[WWW]说: 你看，我说的没错吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(740,19,0);   --  1(1):[岳不群]说: 但是各家门派如能择地域相*近，武功相似，又或相互交*好，先行进行合并．*则十年八年之内，门户宗派*便可减少一大半．慢慢来的*话问题较小．*咱们五岳剑派今日合成五岳*派，就可为各家各派树一典*范，他日必能成为武林中千*古艳称的盛举．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(741,0,1);   --  1(1):[WWW]说: ＜事情怎会变成这样？好像*跟我想的不太一样！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(742,19,0);   --  1(1):[岳不群]说: 嗯，五岳派今日新创，百废*待举，在下只能总领其事，*各派的事务，还是由各派原*任掌门主持．***咱们五岳派今日合并，若不*能和衷同济，那麽五派合并*云云，也只是虚名而已．*在下无德无能，暂且执掌本*门门户，种种兴革，还须和*众位兄弟从长计议，在下不*敢自专．***现下天色已晚，各位都辛苦*了，今天就到此为止，他日*再到华山来共商大事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,24,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,25,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,35,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,36,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,37,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,38,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,39,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,40,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,41,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,42,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,43,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,44,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,45,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,46,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,47,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,48,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,49,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,50,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,2,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,14,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,21,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,22,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,29,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,31,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,32,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,33,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,34,-2,-2,216,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,28,-2,-2,207,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,58,0,0,-1,-1,218,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,59,0,0,-1,-1,218,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,56,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,57,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
    instruct_3(-2,0,0,0,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(15);   --  56(38):提高声望值15
--end

