--function oldevent_345()
    instruct_1(1168,43,0);   --  1(1):[白万剑]说: 小子，你怎麽还活着？*你没去侠客岛吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1169,0,1);   --  1(1):[WWW]说: 去过了！*侠客岛上其实并不像外界所*传言的那麽可怕．*岛上其实藏有极大的武功秘*密，许多掌门都是沉迷於武*功的钻研上，才一直没有回*到中土，并不是遭到杀害．*事情的经过是这样的．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1249,43,0);   --  1(1):[白万剑]说: 什麽！有这等事！*那这麽说来，你学到侠客神*功罗．*快将武功秘笈交出来，否则*要你好看．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1250,0,1);   --  1(1):[WWW]说: 呦，翻脸不认人啦！*当初还很高兴我替上侠客岛*送死，如今却．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1251,43,0);   --  1(1):[白万剑]说: 废话少说．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(60,3,0,0) ==false then    --  6(6):战斗[60]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,5,-2,-2,347,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,347,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,347,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,347,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,346,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_56(3);   --  56(38):提高声望值3
--end

