--function oldevent_413()
    instruct_1(1388,64,0);   --  1(1):[周伯通]说: 来来来，来跟老顽童来玩两*招．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(1387,0,1);   --  1(1):[WWW]说: 前辈别开玩笑了，*晚辈怎是你的对手．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1381,0,1);   --  1(1):[WWW]说: 那晚辈就献丑了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(135,0,23,1) ==true then    --  6(6):战斗[135]否则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1383,64,0);   --  1(1):[周伯通]说: 小兄弟，你这是什麽功夫，*教教我好不好．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1384,0,1);   --  1(1):[WWW]说: 那里，前辈承让了．*晚辈功夫还差得远．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1385,64,0);   --  1(1):[周伯通]说: 这样好了，我跟你磕八个响*头，拜你为师，你总肯教我*了吧．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1386,0,1);   --  1(1):[WWW]说: 前辈别开玩笑了，*晚辈担当不起．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1382,64,0);   --  1(1):[周伯通]说: 唉，你功夫还差的远了，*再去练练．
    instruct_0();   --  0(0)::空语句(清屏)
--end

