--function oldevent_601()
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(1,7,1,1,940,-1,-1,5090,5090,5090,-2,-2,-2);   --  3(3):修改事件定义:场景[河洛客栈]:场景事件编号 [7]
    instruct_3(1,8,1,1,940,-1,-1,5094,5094,5094,-2,-2,-2);   --  3(3):修改事件定义:场景[河洛客栈]:场景事件编号 [8]
    instruct_3(1,10,1,1,940,-1,-1,5092,5092,5092,-2,-2,-2);   --  3(3):修改事件定义:场景[河洛客栈]:场景事件编号 [10]
--end

