--function oldevent_494()
    instruct_1(1791,51,0);   --  1(1):[慕容复]说: 阁下考虑的怎麽样，要不要*我加入你，让你能轻易获得*”天龙八部”？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(11,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(1789,0,1);   --  1(1):[WWW]说: 慕容公子的”好”意，在下*心领了．在下对自己的武功*还有一点自信，我宁愿光明*正大的与乔大侠打斗，也不*愿用卑鄙的方法去得到那本*”天龙八部”．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1790,51,0);   --  1(1):[慕容复]说: 你再考虑清楚．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1788,0,1);   --  1(1):[WWW]说: 好，我就和你上少林，揭发*乔峰的秘密．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,51,0);   --  1(1):[慕容复]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(51);   --  10(A):加入人物[慕容复]
    instruct_37(-4);   --  37(25):增加道德-4
    instruct_8(3);   --  8(8):切换大地图音乐
--end

