--function oldevent_203()
    instruct_1(692,84,0);   --  1(1):[???]说: 对不起，*本派近日诸事繁忙，*暂不对外开放．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(693,0,1);   --  1(1):[WWW]说: 请问是不是有什麽大事呀？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(694,84,0);   --  1(1):[???]说: 家师定於下月十五，将邀请*其他四派掌门齐聚嵩山，*商讨我五岳剑派并派之事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(695,0,1);   --  1(1):[WWW]说: 是这样子的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(696,84,0);   --  1(1):[???]说: 阁下若无要事，还请离去．
    instruct_0();   --  0(0)::空语句(清屏)
--end

