--function oldevent_450()
    instruct_1(1610,0,1);   --  1(1):[WWW]说: 前辈就是铁掌帮的帮主吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1611,67,0);   --  1(1):[裘千仞]说: 小子！你是谁！　　　　　　　　　　　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1612,0,1);   --  1(1):[WWW]说: 晚辈经过这铁掌山下，看到*此山形状奇特，特地上山来*看一看，那知你的手下就动*手打人．难道此山是你们的*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1613,67,0);   --  1(1):[裘千仞]说: 不知天高地厚的小子．*你知道江湖上武功最高的是*谁吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1614,0,1);   --  1(1):[WWW]说: 我曾听人说，东邪，西毒，*南帝，北丐，是江湖上武功*最高强的四人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1615,67,0);   --  1(1):[裘千仞]说: 当年华山论剑之时，要不是*我的铁掌神功还没练成，来*不及参加．*否则，”武功天下第一”的*名号岂会被王重阳夺去．如*今我神功既成，下一回的华*山论剑，我会让世人知道谁*才是当今江湖中武功最高的*人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1616,0,1);   --  1(1):[WWW]说: 是吗？可是我也会参加此次*的大会，这武功天下第一的*封号我也想要耶．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1617,67,0);   --  1(1):[裘千仞]说: 现在的年轻人都像你一样狂*妄吗？*今天，我就让你嚐嚐苦头．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(71,3,0,0) ==false then    --  6(6):战斗[71]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,-2,-2,-2,451,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,16,-2,-2,474,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,-2,-2,474,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,-2,-2,474,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1618,0,1);   --  1(1):[WWW]说: 老伯，我看下一次的华山论*剑，你还是别参加了，继续*再苦练吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(5);   --  56(38):提高声望值5
--end

