--function oldevent_609()
    instruct_1(2254,0,1);   --  1(1):[WWW]说: 你就是这里的老大吧，听说*你这里有我要找的书．．．*我看你也不会轻易给我．．*怎样？是要打一架吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2255,71,0);   --  1(1):[洪教主]说: 最近听闻中土出了位英雄少*年，大概就是你吧！**能闯进本派的，想必有两下*子．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2256,0,1);   --  1(1):[WWW]说: 知道我的厉害了吧，那你是*要我动手，还是乖乖将书交*出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2257,71,0);   --  1(1):[洪教主]说: 你是要”鹿鼎记”一书吧！*可惜晚了一步．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2258,0,1);   --  1(1):[WWW]说: 此话怎讲？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2259,71,0);   --  1(1):[洪教主]说: 半个月之前，一名叫韦小宝*的人潜入本岛，趁机将此书*偷了出去．*此人生性奸诈狡滑，本教出*动大批人马，多次围剿，但*都被他逃脱．*少侠若能将他杀了，自然可*获得该书．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2260,0,1);   --  1(1):[WWW]说: 到时，你会不会又跑来跟我*抢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2261,71,0);   --  1(1):[洪教主]说: 是少侠夺到的，自然归少侠*所有．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2262,0,1);   --  1(1):[WWW]说: 此话当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2263,71,0);   --  1(1):[洪教主]说: 老夫岂是言而无信之人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2264,0,1);   --  1(1):[WWW]说: 那你可有他的下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2265,71,0);   --  1(1):[洪教主]说: 此人向来好色，听说最近在*云南出没．*想不到那毒婆娘他也敢惹．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2266,0,1);   --  1(1):[WWW]说: 教主是指．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2267,71,0);   --  1(1):[洪教主]说: 云南五毒教．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2268,0,1);   --  1(1):[WWW]说: 好．*我倒要会会这头大色狼．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,610,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(37,5,1,1,616,-1,-1,6804,6804,6804,-2,-2,-2);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [5]
    instruct_3(37,0,-2,-2,613,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [0]
    instruct_3(37,1,-2,-2,613,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [1]
    instruct_3(37,2,-2,-2,613,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [2]
    instruct_3(37,3,-2,-2,613,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [3]
    instruct_3(37,4,-2,-2,613,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[五毒教]:场景事件编号 [4]
--end

