--function oldevent_92()
    instruct_1(343,16,0);   --  1(1):[胡青牛]说: 你是谁，*到我蝴蝶谷中做什麽？**若是要求医就快滚吧，*我不会医治你的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(344,0,1);   --  1(1):[WWW]说: 你这麽生气干什麽，*我好好的干麽需要医疗，*神经病！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(345,16,0);   --  1(1):[胡青牛]说: 那就快滚吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(346,0,1);   --  1(1):[WWW]说: ．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,93,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(73,1,-2,-2,103,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[灵蛇岛]:场景事件编号 [1]
--end

