--function oldevent_109()
    instruct_1(430,0,1);   --  1(1):[WWW]说: 谢前辈，你终於回来了．*明教事务一切都还好吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(431,13,0);   --  1(1):[谢逊]说: 托你的福．一切安好．***本教与六大派之事告一段落*後，教众们都能约束自己，*没再和六大派有什麽冲突．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(432,0,1);   --  1(1):[WWW]说: 是嘛，这样子比较好，*以和为贵，对不对．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(433,13,0);   --  1(1):[谢逊]说: 我听范右使说，你在找*”倚天屠龙记”一书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(434,0,1);   --  1(1):[WWW]说: 怎麽，有下落了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(435,13,0);   --  1(1):[谢逊]说: 这本书阳教主从前曾跟我提*过，这次回来後，我也将它*找出来了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(436,0,1);   --  1(1):[WWW]说: 你们找到了，真是太好了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(437,13,0);   --  1(1):[谢逊]说: 不过，*阳教主还跟我提了一些别*的事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(438,0,1);   --  1(1):[WWW]说: 什麽事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(439,13,0);   --  1(1):[谢逊]说: 我想你应该也知道，*此书原本并不是明教之物，*而是一位武林前辈的着作．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(440,0,1);   --  1(1):[WWW]说: 没错．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(441,13,0);   --  1(1):[谢逊]说: 所以外人自然也可以从明教*取走该书．但是明教历代教*主曾传下一个规定，*就是要取走该书之人，必须*破了”光明圣火阵”才行．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(442,0,1);   --  1(1):[WWW]说: ”光明圣火阵”？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(443,13,0);   --  1(1):[谢逊]说: 是的．*此阵是由光明左右使及四大*护法所组成的六合大阵．*虽然少侠有恩於我明教，但*是谢逊不敢违背先人遗令．**所以少侠若想取得该书，*还必须破了此阵才行．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(444,0,1);   --  1(1):[WWW]说: 好吧，*那我只好硬着头皮请教各位*前辈了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(445,13,0);   --  1(1):[谢逊]说: 不过，*要摆出此阵现在还差一人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(446,0,1);   --  1(1):[WWW]说: 还少谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(447,13,0);   --  1(1):[谢逊]说: 紫衫龙王．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(448,0,1);   --  1(1):[WWW]说: 这紫衫龙王在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(449,13,0);   --  1(1):[谢逊]说: 紫衫龙王因教中不合之事而*出走，听说跑到东海的小岛*上隐居起来了．*要找回她还须费一番功夫．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(450,0,1);   --  1(1):[WWW]说: 没关系，*我去试试看好了，*反正天生劳碌命嘛．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,110,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_26(73,2,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

