--function oldevent_715()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2615,73,0);   --  1(1):[南贤]说: 另一组敌我分明的两方分别　*是光明顶上的明教与六大派*之间的恩怨了．*这两方的恩怨多半是由於明*教中的金毛狮王谢逊所引起*的，据闻他杀害了许多六大*派中的人物，而且他手中还*拥有可号令天下的屠龙刀，*更是引起六大派中有心人士*的觊觎．*另外传说中倚天剑是落在峨*嵋灭绝师太的手上．*这”倚天”与”屠龙”或许*和那”倚天屠龙记”一书有*关．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,0,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

