--function oldevent_291()
    instruct_1(993,0,1);   --  1(1):[WWW]说: 林兄剑法不知练的怎样了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(994,36,0);   --  1(1):[林平之]说: 哈！哈！*真的”辟邪剑谱”被我找到*了．*我终於领悟到辟邪剑法的精*妙之处了．**我打算上四川，诛灭他青城*派．*你要不要一起去．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(11,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(996,0,1);   --  1(1):[WWW]说: 以暴制暴，不是上策，*林兄要多三思啊．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(997,36,0);   --  1(1):[林平之]说: 哼！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(995,0,1);   --  1(1):[WWW]说: 好，我们就上青城杀光他全*派．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,36,0);   --  1(1):[林平之]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(36,3,-2,-2,315,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[青城派]:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(36);   --  10(A):加入人物[林平之]
    instruct_37(-4);   --  37(25):增加道德-4
--end

