--function oldevent_153()

    if instruct_16(9,1,0) ==false then    --  16(10):队伍是否有[张无忌]是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(570,9,1);   --  1(1):[张无忌]说: 太师父，太师父，*无忌回来看你了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(571,5,0);   --  1(1):[张三丰]说: 无忌，真的是你．好孩子，*你没有死，翠山可有後了．*是蝶谷医仙将你医好的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(572,9,1);   --  1(1):[张无忌]说: 不是的．我是有了一番奇遇*．．．．如此如此．．．．*这般这般．．．*後来修习了九阳神功，*才将我身上的寒毒化去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(573,5,0);   --  1(1):[张三丰]说: 很好，很好，真难为你了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(574,9,1);   --  1(1):[张无忌]说: 我现在跟着这位大哥到处云*游，也顺便历练历练自己．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(575,5,0);   --  1(1):[张三丰]说: 历练自己是好的，*但要记得常存侠义之心，*才是我辈中人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(576,9,1);   --  1(1):[张无忌]说: 太师父教诲，无忌谨记在心*．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,5,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,-2,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_37(2);   --  37(25):增加道德2
--end

