--function oldevent_758()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2658,74,0);   --  1(1):[北丑]说: 想要在这武林中存活下去，*必须拥有过人的功夫才行．**而想要在短期间就拥有高深*的功夫，则必须要靠辛勤的*”练功”才行．*可以练功的地方虽多，但稍*有不慎，你就要去见阎罗王*了．所以要慎选练功之地．*我知道有两个地方可以好好*练功．分别是两个老人家住*的地方．*初期的话可以到灵蛇岛找那*老太婆打架，到了中期则可*以到百花谷找老顽童讨教．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,1,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

