--function oldevent_665()
    instruct_1(2433,106,0);   --  1(1):[???]说: 客倌，您要吃饭还是住宿？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2434,0,1);   --  1(1):[WWW]说: 客倌？．．你是店小二！*你是店小二对不对！**你一定有什麽线索可以告诉*我，对不对，快告诉我！**玩ＲＰＧ我最拿手了，只要*找到你们这种人，就一切搞*定！*快告诉我接下来该怎麽做，*给你一些”小费”，然後去*找”某一个人”，对不对？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2435,106,0);   --  1(1):[???]说: 那里来的疯子，不吃饭就到*别处去，不要在这疯言疯语*的，影响大爷我做生意．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,-2,666,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

