--function oldevent_659()
    instruct_1(2410,0,1);   --  1(1):[WWW]说: 想不到在这没什麽人烟的地*方，你们客栈生意还这麽的*好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2411,106,0);   --  1(1):[???]说: 那可不．*要知方圆百里之内，只有我*们这间客栈．*你若不想冻死在这东北雪地*里，就必须在本店里歇上一*歇再走．*怎麽，这位公子不远千里来*到这东北雪地中，是为了向*”北丑”寻求解惑呢？*还是去找那”狐狸”要书的*呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2412,0,1);   --  1(1):[WWW]说: 北丑？*狐狸？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2413,106,0);   --  1(1):[???]说: 是啊！***会来我们这的，要不是想跟*北丑那疯子要些线索，打听*一些武林中的秘密．*要不就是找那外号”雪山飞*狐”的胡斐打架，夺取”十*四天书”．*江湖中人都盛传着，”雪山*飞狐”一书肯定在他那，否*则他怎麽以此做为外号．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2414,0,1);   --  1(1):[WWW]说: 小二哥，你知道的还真多．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2415,106,0);   --  1(1):[???]说: 那当然，要不然怎麽会叫做*小二哥呢？**好，今天小二哥高兴，多告*诉你一些．**那北丑住的地方，是在本店*的西北方，而胡斐则是住在*东北方．*不过你得小心点，最近有很*多居民在山中无缘无故走失*了，传说是雪怪出来作乱．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2416,0,1);   --  1(1):[WWW]说: 谢谢你的忠告．
    instruct_0();   --  0(0)::空语句(清屏)
--end

