--function oldevent_691()
    instruct_1(2520,0,1);   --  1(1):[WWW]说: 啊！头好痛呀！*是不是最近Ｋ书Ｋ太凶了，*所以有点恍惚了．*．．．．．我记得我正在玩*”金庸群侠传”啊！*怎麽突然就睡着了．*管他的，我得赶紧起来玩，*这游戏可是等了半年多才玩*到的，非第一个破关不可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,6890,6932);   --  27(1B):显示动画
    instruct_1(2521,0,1);   --  1(1):[WWW]说: 咦！我的电脑呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,6934,6986);   --  27(1B):显示动画
    instruct_1(2522,0,1);   --  1(1):[WWW]说: 奇怪，我什麽时候换了衣服*的，我都不知道．*哎！还是古装的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,6988,7000);   --  27(1B):显示动画
    instruct_27(-1,6988,7000);   --  27(1B):显示动画
    instruct_1(2523,0,1);   --  1(1):[WWW]说: 奇了奇了，这儿也不是我家*呀？*难不成我被绑架了？*还是平日ＲＰＧ玩太多了，*做起白日梦了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2524,114,0);   --  1(1):[???]说: 非常恭喜你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_67(24);   --  67(43):播放音效24
    instruct_27(1,6820,6860);   --  27(1B):显示动画
    instruct_1(2525,0,1);   --  1(1):[WWW]说: 软体娃娃！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(1,6862,6888);   --  27(1B):显示动画
    instruct_1(2526,114,0);   --  1(1):[???]说: 非常恭喜你，你是本产品消*费者中最幸运的一位．**软体世界经过多年的努力研*究後，终於发展出一套完全*的ＶＲ游戏．*你将亲身的扮演游戏的主人*翁，在我们为你设计的游戏*世界中冒险．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2527,0,1);   --  1(1):[WWW]说: 你说什麽？*这不是在做梦吧？*”真正的ＶＲ游戏”？*不会吧？*你是说，你们已经可以像电*影，漫画中的剧情一般，将*游戏设计的这麽”真实”？*让玩者真的”身”处在游戏*世界中，而不是只能操纵键*盘，盯着萤幕看而已．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2528,114,0);   --  1(1):[???]说: 没错．*这是”最真实的游戏”！**而且你知道吗，你是所有消*费者中最幸运的一位．*因为基於成本考量，在众多*的产品中，你购买的这套，*是我们所生产中仅有的一套*”ＶＲ”版．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2529,0,1);   --  1(1):[WWW]说: 哇塞！*好险我不是买”大补帖”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2530,114,0);   --  1(1):[???]说: 是的．*唯有尊重智慧财产权的消费*者，才是最可爱的．*好了，接下来就要靠你自己*了．*祝你幸运．*因为唯有完成本游戏，你才*能离开这个”游戏世界”，*回到现实的世界里．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2531,0,1);   --  1(1):[WWW]说: 等会等会．．．．*你不给我一点提示吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2532,114,0);   --  1(1):[???]说: 难道你没先看说明书吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2533,0,1);   --  1(1):[WWW]说: 抱歉！*我不习惯先看说明书的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2534,114,0);   --  1(1):[???]说: 你们这些人都是这样的，自*以为厉害，都不看说明书．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2535,0,1);   --  1(1):[WWW]说: 好啦，下次我一定会先看．*麻烦给点提示，比如说，这*游戏的目的是什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2536,114,0);   --  1(1):[???]说: 这要留给你自己到游戏中去*找寻，现在不能告诉你．*不过．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2537,0,1);   --  1(1):[WWW]说: 不过什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2538,114,0);   --  1(1):[???]说: 不过我还是给你一点提示．***游戏中有一个很重要的人，*你必须先找到他．**这个人懂的东西非常的多，*你找到他後，就可以明了到*游戏的大概及其目的了．*而且也唯有先找到他，游戏*中的许多场景才会打开，让*你可以进入．*在此之前，你所能去的地方*只有客栈以及他家和这儿．*所以你得赶快找到他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2539,0,1);   --  1(1):[WWW]说: 这个人是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2540,114,0);   --  1(1):[???]说: 什麽都跟你说的话，游戏还*有乐趣吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2541,0,1);   --  1(1):[WWW]说: 这．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2542,114,0);   --  1(1):[???]说: 别担心，游戏才刚开始，不*会太难的．**等会出了这里後，到对面的*客栈打听一下就有消息了．**不过可别忘了这游戏的背景*是古代，所以注意一下你的*言谈举止．*对了，忘记告诉你，本游戏*是采”有死亡”的设计，*所以．．愿主保佑你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2543,0,1);   --  1(1):[WWW]说: 我最怕的就是这样了！*都什麽年头了，还设计这种*”死亡制”的游戏．*你们喜欢复古啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2544,114,0);   --  1(1):[???]说: 别怕，这房内为你准备了一*些基本物品，都放在各种箱*子中．*这其中有些药丸，在你生命*垂危时可以派上用场的．**另外，你身上好像有些东西*是从现代带过来的，也可以*派上用场．*而且看你的资料，似乎也会*一点拳法，没问题的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2545,0,1);   --  1(1):[WWW]说: 什麽拳法，*我只会”野球拳”！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2546,114,0);   --  1(1):[???]说: 好了，不能再说下去了，游*戏设计者叮咛过我，话不能*说太多，否则会犯了游戏的*大忌，俗语说．．．．．．*”好ＧＡＭＥ不多话”．**ＢＹＥ！ＢＹＥ！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,692,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
--end

