--function oldevent_408()
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_17(-2,1,26,34,4738);   --  17(11):修改场景贴图:当前场景层1坐标1A-22
    instruct_17(-2,1,26,31,4738);   --  17(11):修改场景贴图:当前场景层1坐标1A-1F
    instruct_17(-2,1,26,26,4738);   --  17(11):修改场景贴图:当前场景层1坐标1A-1A
    instruct_17(-2,1,26,23,4738);   --  17(11):修改场景贴图:当前场景层1坐标1A-17
    instruct_17(-2,1,27,34,4740);   --  17(11):修改场景贴图:当前场景层1坐标1B-22
    instruct_17(-2,1,27,31,4740);   --  17(11):修改场景贴图:当前场景层1坐标1B-1F
    instruct_17(-2,1,27,26,4740);   --  17(11):修改场景贴图:当前场景层1坐标1B-1A
    instruct_17(-2,1,27,23,4740);   --  17(11):修改场景贴图:当前场景层1坐标1B-17
    instruct_3(-2,5,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,12,1,1,409,-1,-1,6256,6262,6256,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
--end

