--function oldevent_362()
    instruct_1(1196,23,0);   --  1(1):[天门]说: 银光灿烂，鞍自平稳．天马*行空，瞬息万里．．．原来*天马是手．并非真的是马．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(38,11,0) ==false then    --  16(10):队伍是否有[石破天]是则跳转到:Label0
        instruct_1(1198,23,0);   --  1(1):[天门]说: 这壁上的注解说道：白居易*诗云”勿轻直折剑，犹胜曲*全勾”．*可见我这直折之剑，方合石*壁注文原意．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1199,20,1);   --  1(1):[莫大]说: 不对，”吴钩霜雪明”是*主，”犹胜曲全钩”是宾．*喧宾夺主，必非正道．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1197,38,1);   --  1(1):[石破天]说: ＜这些口诀甚是深奥，我是*弄不明白的．*唉！没读过书就是不行．＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1198,23,0);   --  1(1):[天门]说: 这壁上的注解说道：白居易*诗云”勿轻直折剑，犹胜曲*全勾”．*可见我这直折之剑，方合石*壁注文原意．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1199,20,1);   --  1(1):[莫大]说: 不对，”吴钩霜雪明”是*主，”犹胜曲全钩”是宾．*喧宾夺主，必非正道．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1200,38,1);   --  1(1):[石破天]说: ＜咦！这些字的笔划看起来*好像是一把把的长剑，有的*剑尖朝上，有的向下，有的*斜起欲飞，有的横掠欲堕．*”五里穴”好热．．．现在*跑到”曲池穴”了．．*自从练了木偶身上的经脉图*之後，内力大盛，但从没像*今日这般劲急．．．＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,4,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(-2,5,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(-2,6,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,10,-2,-2,387,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,-2,-2,387,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
--end

