--function oldevent_70()
    instruct_1(229,0,1);   --  1(1):[WWW]说: 嗨！你叫什麽名字，*一个人躲在这深山中做什*麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(230,9,0);   --  1(1):[张无忌]说: 我叫张无忌，*你怎麽也进来了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(231,0,1);   --  1(1):[WWW]说: 我是无意间找到这地方的．*喂，你是不是有自闭症啊？**还是一个人躲在深山中练仙*术呀．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(232,9,0);   --  1(1):[张无忌]说: 自闭症？那是什麽病啊？*胡伯伯的医书中并没有提过*此病症．*其实，我是中了玄冥神掌的*寒毒，是一种不治之症．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(233,0,1);   --  1(1):[WWW]说: 可是我看你脸色很好啊，*不像是快死的人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(234,9,0);   --  1(1):[张无忌]说: 我也觉得奇怪？按理说，*我应该在几年前就应死的，*现在反而都不会发病了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(235,0,1);   --  1(1):[WWW]说: 你是不是吃了什麽仙丹妙药*啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(236,9,0);   --  1(1):[张无忌]说: 大概是四，五年前吧，*我离开蝴蝶谷後，无意间*发现了这个世外桃源，*想说能死在这里也不错，*就决定留在这里等死．**几年前我碰巧救了一只大白*猿，在牠的肚中发现了一本*经书，好像是一本修练内功*的书，我想闲来无事，就照*着练了起来．**另外，这里的一些水果啊，*白鱼啊，食用後也都令我精*神百倍．*该不会就是这些遭遇，*才让我到现在还没死．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(237,0,1);   --  1(1):[WWW]说: 依我看，你非但是死不了，*而且还练了一身绝世武功，*想来该是你的一番奇缘．*在这里这麽久了，难道你不*想出去走走？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(238,9,0);   --  1(1):[张无忌]说: 我本自以为将死，所以一直*待在这，但经你这麽一说，*我现在倒有一点想出去．*我想回武当山看看太师父，*还有就是去找寻我义父．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(239,0,1);   --  1(1):[WWW]说: 你义父？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(240,9,0);   --  1(1):[张无忌]说: 是啊．我义父是金毛狮王谢*逊，他双眼失明，还一个人*待在无人荒岛上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,75,71,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

