--function oldevent_427()
    instruct_1(1365,65,0);   --  1(1):[一灯]说: 真希望瑛姑赶快来杀我，*解除我的罪孽．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(1366,0,1);   --  1(1):[WWW]说: ．．．．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_37(-1);   --  37(25):增加道德-1

    if instruct_6(68,0,35,1) ==true then    --  6(6):战斗[68]否则跳转到:Label1
        instruct_3(21,1,-2,-2,420,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [1]
        instruct_3(-2,-2,-2,-2,-1,-1,-1,6226,6226,6226,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_37(-10);   --  37(25):增加道德-10
        instruct_56(10);   --  56(38):提高声望值10
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1363,65,0);   --  1(1):[一灯]说: 阁下还是回去请瑛姑亲自来*动手吧，我会在这等她的．
    instruct_0();   --  0(0)::空语句(清屏)
--end

