--function oldevent_124()
    instruct_1(476,0,1);   --  1(1):[WWW]说: 这位大哥，*此处山灵水秀，峻伟挺拔，*不知是那个门派驻紮在此．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(477,79,0);   --  1(1):[???]说: 小子，这里是崆峒山，*是我崆峒派习武养生之地，*这个都不知道还出来混．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(478,0,1);   --  1(1):[WWW]说: 小弟初涉江湖，见闻浅薄，*还望大哥指教．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(479,79,0);   --  1(1):[???]说: 想当年我掌门师祖木灵子以*一套七伤拳威镇天下，名扬*四海，奠定我崆峒派百年的*基业，名列当今武林六大派*之一．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(480,0,1);   --  1(1):[WWW]说: 六大派？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(481,79,0);   --  1(1):[???]说: 是啊！*少林，武当，崆峒，峨嵋，*崑仑，华山六大门派．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(482,0,1);   --  1(1):[WWW]说: 是这样的啊！那我可真想拜*见拜见贵派掌门．见识见识*崆峒派的绝技七伤拳．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(483,79,0);   --  1(1):[???]说: 掌门师叔可能不会见你，*因为最近我们六大派正忙着*进攻魔教．*不过你还是进去碰碰运气好*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,1,-2,-2,125,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,125,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,125,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,125,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,125,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,125,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,125,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
--end

