--function oldevent_134()
    instruct_1(525,0,1);   --  1(1):[WWW]说: 在下云游各方，途经崑仑，*见此三圣坳绿草如茵，*忍不住前来欣赏一番，*并顺道拜会人称*”铁琴先生”的何掌门．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(526,7,0);   --  1(1):[何太冲]说: 你是打从中原来的吧！*欣赏完了就赶紧离去吧．**最近西域已成多事之地，*小心惹上祸端．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(527,0,1);   --  1(1):[WWW]说: 是吗？*那我可得小心点．*在下告退了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_17(-2,1,18,24,0);   --  17(11):修改场景贴图:当前场景层1坐标12-18
    instruct_17(-2,1,17,24,1832);   --  17(11):修改场景贴图:当前场景层1坐标11-18
    instruct_17(-2,1,19,24,1836);   --  17(11):修改场景贴图:当前场景层1坐标13-18
    instruct_3(-2,-2,-2,-2,164,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

