--function oldevent_515()
    instruct_1(2197,70,0);   --  1(1):[玄慈]说: 少侠就请自己四处看看．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(51,6,0) ==false then    --  16(10):队伍是否有[慕容复]是则跳转到:Label0
        instruct_1(1895,70,0);   --  1(1):[玄慈]说: 希望少侠多做善事才是．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1831,51,1);   --  1(1):[慕容复]说: 大师，我们是来向你借一样*东西的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1832,70,0);   --  1(1):[玄慈]说: 不知施主要跟老衲借什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1833,51,1);   --  1(1):[慕容复]说: 一份信件．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1834,70,0);   --  1(1):[玄慈]说: 一份信件？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1835,51,1);   --  1(1):[慕容复]说: 没错，一份信件．*一份当年武林夙宿们共同草*拟的信件．．．*一份证明现在丐帮帮主乔峰*并不是汉人，而是契丹人的*信件．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1836,70,0);   --  1(1):[玄慈]说: 你是谁！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1837,51,1);   --  1(1):[慕容复]说: 在下姑苏慕容复．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1838,70,0);   --  1(1):[玄慈]说: 你是慕容复，你如何知道此*事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1839,51,1);   --  1(1):[慕容复]说: 我自然知道．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1840,70,0);   --  1(1):[玄慈]说: 是了，一定是那个人告诉你*的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1841,0,1);   --  1(1):[WWW]说: 慕容公子，这是怎麽回事？*什麽汉人，契丹人的？   　　　　　　　　　　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1842,51,1);   --  1(1):[慕容复]说: 你不知道吧，我看恐怕江湖*上也没几个人会知道，原来*我们丐帮现任的帮主乔峰乔*大侠，并不是汉人，而是血*腥屠杀汉人的契丹狗．**当年这位玄慈方丈率领中原*群侠，误杀了一名契丹人．*而那名契丹人留有一子，中*原群侠因为愧疚想好好照顾*他，就决定由少林寺私下扶*养他长大，．．．*後来那个孩子当上了丐帮帮*主，他就是乔峰．**可是呢，当年那些中原群侠*又怕乔峰体内所流露的契丹*性格，将来会爆发出来，危*害到中原武林，於是就写了*一份信件，说明了乔峰的身*份，一旦他野性暴露，就将*他的身份揭发出来，让中原*群侠一起对付他，就像对付*他爹一样．*所以呢，今天我们只要弄到*这信件，就可让乔峰羞愧的*无地自容，*兄弟你自然也能轻易地得到*”天龙八部”了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1843,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，阿弥陀佛！*当年我们的确误杀了乔峰他*父亲．如今他的儿子有这番*成就，大仁大义，就是连汉*人也比不上的，老衲是不会*将那封信件交给你们的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1844,51,1);   --  1(1):[慕容复]说: 方丈话别说的这麽快．*兄弟，接下来我会让你知道*带我来的好处．*方丈，你还记得”叶二娘”*吧？**还记得”紫云洞相会”之事*还记得”乔婆婆接生”之事*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1845,70,0);   --  1(1):[玄慈]说: 你．．你．．*你怎麽知．．知道的．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1846,51,1);   --  1(1):[慕容复]说: 我知道的还很多，要不要我*再讲下去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1847,70,0);   --  1(1):[玄慈]说: 不要再讲了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1848,51,1);   --  1(1):[慕容复]说: 那信件呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1849,70,0);   --  1(1):[玄慈]说: 这．．．．．．***唉！．．．*你们拿去吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1850,51,1);   --  1(1):[慕容复]说: 兄弟，得手了，我们去丐帮*揭发乔峰吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1851,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，阿弥陀佛！*施主得饶人处且饶人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,512,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_2(183,1);   --  2(2):得到物品[带头大哥书信][1]
    instruct_3(-2,0,-2,-2,-1,-1,514,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,-1,-1,514,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,-1,-1,514,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
--end

