--function oldevent_148()
    instruct_1(557,6,0);   --  1(1):[灭绝]说: 魔教妖邪，来我峨嵋山有何*贵事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(558,0,1);   --  1(1):[WWW]说: 上回看你手中那把宝剑，*寒芒吞吐，电闪星飞，想必*就是传说中的”倚天剑”？*小侠我想向你借来用用．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(559,6,0);   --  1(1):[灭绝]说: 光明顶上被你侥幸获胜，*你现在还敢来我峨嵋撒野，*莫非真视我峨嵋无人．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(11,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(566,0,1);   --  1(1):[WWW]说: 那里，那里．我只不过是来*劝师太，与明教间的事能和*就和．*自古以来冤家宜解不宜结．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(567,6,0);   --  1(1):[灭绝]说: 阁下未免管的太多了吧，*难道你真以为你是*”武林盟主”吗！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_6(20,3,0,0) ==false then    --  6(6):战斗[20]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(560,0,1);   --  1(1):[WWW]说: 宝剑还是应该配英雄，*怎样？师太，这”倚天剑”*可以让给我了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(561,6,0);   --  1(1):[灭绝]说: 魔教妖孽，想从我灭绝手中*拿走倚天剑，等下辈子吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(2,5468,5496);   --  27(1B):显示动画
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,149,-1,-1,5238,5238,5238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(562,77,0);   --  1(1):[???]说: 师父，师父！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(563,0,1);   --  1(1):[WWW]说: 师太，师太！何苦如此呢？*若真不想给我，跟我说一声*就行了．唉！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(564,6,0);   --  1(1):[灭绝]说: 魔教的淫徒，你若玷污了我*爱徒们的清白，我做鬼也不*饶过．．．．．．．．你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(565,77,0);   --  1(1):[???]说: 师父，师父！*可恶的魔教妖邪，*替我师父嚐命来．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(21,3,0,0) ==false then    --  6(6):战斗[21]是则跳转到:Label2
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,3,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,-2,-2,151,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_37(-5);   --  37(25):增加道德-5
    instruct_56(8);   --  56(38):提高声望值8
--end

