--function oldevent_655()

   if instruct_29(0,90,1000,6,0) ==false then    --  29(1D):判断WWW武力90-1000是则跳转到:Label0
        instruct_1(2704,0,1);   --  1(1):[WWW]说: 我看这块巨石门大有问题，*後面肯定藏有宝物．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_43(106,26,0) ==false then    --  43(2B):是否有物品玄铁剑是则跳转到:Label1
        instruct_1(2704,0,1);   --  1(1):[WWW]说: 我看这块巨石门大有问题，*後面肯定藏有宝物．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    instruct_1(2706,0,1);   --  1(1):[WWW]说: 看我的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_57();   --  57(39):高昌迷宫劈门
    instruct_3(-2,2,1,1,-1,-1,-1,7746,7746,7746,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,-1,-1,-1,7804,7804,7804,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,1,1,-1,-1,-1,7862,7862,7862,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
--end

