--function oldevent_457()
    instruct_1(1625,68,0);   --  1(1):[丘处机]说: 阁下为何硬闯我全真教．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1626,0,1);   --  1(1):[WWW]说: 前辈是丘掌门吧，我听说先*师王重阳武功天下第一，所*以想看看他所创的全真教是*否同他一样厉害．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1627,68,0);   --  1(1):[丘处机]说: 废话少说，动手吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(74,66,0,1) ==false then    --  6(6):战斗[74]是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1639,68,0);   --  1(1):[丘处机]说: 就这麽一点微末道行，也敢*到我重阳宫撒野．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1640,0,1);   --  1(1):[WWW]说: 在下的确是自不量力，但人*在江湖，身不由己啊！**为了找那几本书，我只有硬*着头皮四处踢馆，看能不能*有什麽收获．
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_28(0,50,100,20,0) ==false then    --  28(1C):判断WWW品德50-100是则跳转到:Label1
            instruct_1(1643,68,0);   --  1(1):[丘处机]说: 就算功夫不行，也不能四处*为恶，如果下次见到你时，*你还陷入邪道之中，老道就*要开杀戒了．
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,-2,-2,-2,458,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            do return; end
        end    --:Label1

        instruct_1(1641,68,0);   --  1(1):[丘处机]说: 看你的本质还不坏，但武功*太差了，这样怎麽在江湖上*混呢？*我送你本秘笈，你拿去好好*钻研吧．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1642,0,1);   --  1(1):[WWW]说: 谢谢道长．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(70,1);   --  2(2):得到物品[七星剑谱][1]
        instruct_3(-2,-2,-2,-2,458,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
    end    --:Label0

    instruct_3(-2,-2,-2,-2,459,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(5);   --  56(38):提高声望值5
--end

