--function oldevent_937()
    instruct_1(2969,111,0);   --  1(1):[???]说: 来，来．来．*来看看有什麽需要的，我这*应有尽有．*这位小哥，看看有什麽需要*的，我小宝卖的东西价钱绝*对公道．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2970,0,1);   --  1(1):[WWW]说: 哇！你这好多东西．*小宝兄，你真有办法．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2971,111,0);   --  1(1):[???]说: 那里那里，小爷过奖了．*我的功夫不好，要在这江湖*上混，只得想办法到处弄点*好东西，在各地客栈兜售，*以此维生．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2972,0,1);   --  1(1):[WWW]说: 不知兄台如何称呼？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2973,111,0);   --  1(1):[???]说: 我叫韦．．．*别这麽别忸，你就叫我小宝*好了．*记着，如果有什麽需要的，*到各地的客栈找我就对了．**不过我不一定会待在那个客*栈，你得碰碰运气．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,938,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,17,0,0,-1,-1,939,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,0,0,-1,-1,939,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
--end

