--function oldevent_897()
    instruct_3(-2,-2,-2,-2,-1,-1,-1,2608,2608,2608,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(174,200);   --  2(2):得到物品[银两][200]
    instruct_2(171,10);   --  2(2):得到物品[药材][10]
    instruct_2(1,4);   --  2(2):得到物品[精气丸][4]
    instruct_2(3,1);   --  2(2):得到物品[小还丹][1]
    instruct_2(11,3);   --  2(2):得到物品[人蔘][3]
    instruct_2(22,2);   --  2(2):得到物品[黄连解毒丸][2]
    instruct_2(186,2);   --  2(2):得到物品[智慧果][2]
    instruct_2(102,5);   --  2(2):得到物品[毒蒺黎][5]
    instruct_37(-2);   --  37(25):增加道德-2
--end

