--function oldevent_498()
    instruct_1(1797,0,1);   --  1(1):[WWW]说: 小和尚，借个位．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1798,49,0);   --  1(1):[虚竹]说: 佛观一钵水，八万四千虫，*若不持此咒，如食众生肉．*唵缚悉波罗摩尼莎诃
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1799,0,1);   --  1(1):[WWW]说: 小师父，你叽哩咕噜念什麽*咒啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1800,49,0);   --  1(1):[虚竹]说: 小僧念的是饮水咒．*佛说每一碗水中，有八万四*千条小虫，出家人戒杀，因*此要念了饮水咒，这才喝得*．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1801,0,1);   --  1(1):[WWW]说: 这水乾净得很，一条虫子也*没有，小师父真会说笑．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1802,49,0);   --  1(1):[虚竹]说: 施主有所不知．*我辈凡夫看来，水中自然无*虫，但我佛以天眼看水，却*看到水中小虫成千上万．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1803,0,1);   --  1(1):[WWW]说: 那你念了饮水咒之後，将八*万四千条小虫喝入肚中，那*些小虫便不死了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1804,49,0);   --  1(1):[虚竹]说: 这．．．这个．．．*师父倒没教过．*多半小虫便不死了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1805,0,1);   --  1(1):[WWW]说: 对了，小和尚怎麽一个人在*此，是要准备前往西方取经*的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1806,49,0);   --  1(1):[虚竹]说: 不是，我是和师父他们走丢*了，正想办法该如何回少林*寺去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1807,0,1);   --  1(1):[WWW]说: 哦，原来是少林寺的高僧，*武功定是很高喽！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1808,49,0);   --  1(1):[虚竹]说: 那里，小僧武功低微，在寺*中是打杂的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,499,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(1812,0,1);   --  1(1):[WWW]说: 小和尚，那改天我们少林寺*再见．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1809,0,1);   --  1(1):[WWW]说: 既然如此，小和尚要不要和*我一起走，我知道回少林的*路．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,75,100,6,0) ==false then    --  28(1C):判断WWW品德75-100是则跳转到:Label1
        instruct_1(1811,49,0);   --  1(1):[虚竹]说: 不用了，小僧自己找路回少*林即可．**倒是施主眼神中充满戾气，*恐入魔道，望施主能即时回*头．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,49,0);   --  1(1):[虚竹]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(1810,49,0);   --  1(1):[虚竹]说: 好啊．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,15,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(49);   --  10(A):加入人物[虚竹]
    instruct_37(3);   --  37(25):增加道德3
--end

