--function oldevent_448()
    instruct_1(1606,94,0);   --  1(1):[???]说: 来者何人，擅闯我铁掌山．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1607,0,1);   --  1(1):[WWW]说: 铁掌山？我还以为是”猴爪*山”呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1608,94,0);   --  1(1):[???]说: 大胆狂徒，竟敢上我铁掌帮*找碴．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(70,3,0,0) ==false then    --  6(6):战斗[70]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,2,-2,-2,449,-1,-1,6092,6092,6092,-2,27,47);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,449,-1,-1,6098,6098,6098,-2,30,47);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,-2,-2,449,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(1);   --  56(38):提高声望值1
--end

