--function oldevent_464()
    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]

    if instruct_55(2,-1,14,0) ==false then    --  55(37):事件d*编号2是否为-1是则跳转到:Label0
        instruct_3(-2,2,-2,-2,862,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    end    --:Label0


    if instruct_55(3,-1,14,0) ==false then    --  55(37):事件d*编号3是否为-1是则跳转到:Label1
        instruct_3(-2,3,-2,-2,863,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    end    --:Label1


    if instruct_55(4,-1,14,0) ==false then    --  55(37):事件d*编号4是否为-1是则跳转到:Label2
        instruct_3(-2,4,-2,-2,864,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    end    --:Label2


    if instruct_55(5,-1,14,0) ==false then    --  55(37):事件d*编号5是否为-1是则跳转到:Label3
        instruct_3(-2,5,-2,-2,865,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    end    --:Label3

--end

