--function oldevent_33()

    if instruct_16(1,0,74) ==true then    --  16(10):队伍是否有[胡斐]否则跳转到:Label0
        instruct_1(130,3,0);   --  1(1):[苗人凤]说: 胡斐，你准备好了吗？
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_5(1,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label1
            do return; end
        end    --:Label1


        if instruct_6(4,0,52,1) ==true then    --  6(6):战斗[4]否则跳转到:Label2
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_1(131,3,0);   --  1(1):[苗人凤]说: 不错，你有这样的武艺，你*爹也可放心了．来，把我杀*了，替你爹报仇．
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(132,1,1);   --  1(1):[胡斐]说: 兄弟，我们走吧．仇我已经*报了．
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(133,0,1);   --  1(1):[WWW]说: 对嘛！这才是我的好大哥．
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(134,3,0);   --  1(1):[苗人凤]说: 走之前，*拿了这把冷月宝刀，*这是一把适合你的宝刀．*还有，这本书拿去吧，*希望能帮小兄弟解决困难．
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_2(116,1);   --  2(2):得到物品[冷月宝刀][1]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_2(144,1);   --  2(2):得到物品[飞狐外传][1]
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(138,0,1);   --  1(1):[WWW]说: 呀呼！找到”飞狐外传”了
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,-2,-2,-2,34,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_37(2);   --  37(25):增加道德2
            do return; end
        end    --:Label2

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(135,3,0);   --  1(1):[苗人凤]说: 再去好好琢磨琢磨．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(136,3,0);   --  1(1):[苗人凤]说: 麻烦你转告胡斐，等他准备*好了，可随时来找我．
    instruct_0();   --  0(0)::空语句(清屏)
--end

