--function oldevent_432()
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(47,0,-2,-2,429,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[一灯居]:场景事件编号 [0]
    instruct_3(20,4,1,1,412,-1,-1,6154,6154,6154,-2,-2,-2);   --  3(3):修改事件定义:场景[百花谷]:场景事件编号 [4]
    instruct_3(20,13,1,1,415,-1,-1,6158,6158,6158,-2,-2,-2);   --  3(3):修改事件定义:场景[百花谷]:场景事件编号 [13]
    instruct_38(-2,0,990,994);   --  38(26):修改图层贴图
--end

