--function oldevent_276()
    instruct_1(893,0,1);   --  1(1):[WWW]说: 喂！就是你要跟我较量较量*吗？是的话就快动手，我可*没那麽多时间和你穷磨菇．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(894,26,0);   --  1(1):[任我行]说: 你是谁？*到这里来大小声的干什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(895,0,1);   --  1(1):[WWW]说: 你还问我是谁，我就是打败*”梅庄四友”的那个少年英*雄．*听二庄主黑白子说，你因为*崇拜我的武功了得，想跟我*较量较量，不是吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(896,26,0);   --  1(1):[任我行]说: 哈！哈！看你年纪轻轻，竟*如此狂妄，*不错！不错！我喜欢．*你说你打败梅庄那四个窝囊*废，当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(897,0,1);   --  1(1):[WWW]说: 当然是真的，怀疑啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(898,0,1);   --  1(1):[WWW]说: 你还真奇怪，竟然把自己关*在这不见天日的地洞，有病*啊！还是受了什麽刺激？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(899,26,0);   --  1(1):[任我行]说: 把自己关在这？我任我行会*把自己关在这地牢之中？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(900,0,1);   --  1(1):[WWW]说: ＜任我行？任我行？这名字*  好像在那听过．＞**难道任前辈是被囚禁在这？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(901,26,0);   --  1(1):[任我行]说: 说来惭愧，我堂堂日月神教*教主竟会被困在这儿．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(902,0,1);   --  1(1):[WWW]说: ＜这老头是日月神教教主？*  怎麽看都不像啊！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(903,26,0);   --  1(1):[任我行]说: 要不是当年我潜心修习一门*武功大法，将教中的所有大*权交给东方不败．*不料那东方不败狼子野心，*表面上对我十分恭敬，*什麽事都不敢违背，*暗中却培植一己势力，假借*诸般藉口，将所有忠於我的*部属或是撤革，或是处死，*数年之间，我的亲信竟然凋*零殆尽．他见时机成熟，*竟趁我练功入关之际，*干下叛逆篡位之事，*并把我关在这西湖之底！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(904,0,1);   --  1(1):[WWW]说: 竟有如此狼心狗肺的家伙，*不要让我遇上，不然一定要*给他好看．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(905,26,0);   --  1(1):[任我行]说: 哈！哈！哈！*就凭你．哈．．．！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(906,0,1);   --  1(1):[WWW]说: 啊．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,5974,5992);   --  27(1B):显示动画
    instruct_14();   --  14(E):场景变黑
    instruct_32(177,-1);   --  32(20):物品[广陵散琴曲]+[-1]
    instruct_32(178,-1);   --  32(20):物品[刘仲甫呕血棋谱]+[-1]
    instruct_32(179,-1);   --  32(20):物品[张旭率意帖]+[-1]
    instruct_32(180,-1);   --  32(20):物品[谿山行旅图]+[-1]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(-1,6014,6024);   --  27(1B):显示动画
    instruct_1(907,0,1);   --  1(1):[WWW]说: 可恶的老头，竟趁我不备偷*袭．．．．*啊！我的宝物！我上当了！*一定是那四个卑鄙狗贼，明*的打不过我，来阴的．真是*太无耻下流了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(908,0,1);   --  1(1):[WWW]说: 这是什麽鬼地方？奇怪？*方才那老家伙突然一阵吼声*．．．．．*喔！一定是那四个狗贼，*明的打不过我，来暗的．*真是太无耻下流了．*咦？这门没关，又不像是要*把我关在这儿．*嗯，真是可疑？*看来可得好好的”瞧瞧”这*个鬼地方！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(55,20,1,1,-1,-1,-1,6060,6060,6060,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [20]
    instruct_3(55,21,1,1,-1,-1,-1,6050,6050,6050,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [21]
    instruct_3(55,22,1,1,-1,-1,-1,6062,6062,6062,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [22]
    instruct_3(55,23,1,1,-1,-1,-1,6074,6074,6074,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [23]
    instruct_3(55,24,0,0,-1,-1,275,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[梅庄]:场景事件编号 [24]
    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_37(2);   --  37(25):增加道德2
--end

