--function oldevent_288()
    instruct_1(974,36,0);   --  1(1):[林平之]说: 怎麽样，救出我爹了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(975,0,1);   --  1(1):[WWW]说: 迟了一步！我赶到了青城派*之时，令．．．令尊已惨遭*毒手．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(976,36,0);   --  1(1):[林平之]说: 什麽！！！*他们杀．．．杀了我父亲． 　　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(977,0,1);   --  1(1):[WWW]说: 是的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(978,36,0);   --  1(1):[林平之]说: 余沧海！！*此仇不报，我林平之禽兽不*如！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(979,0,1);   --  1(1):[WWW]说: 林兄请节哀．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(980,36,0);   --  1(1):[林平之]说: 我林家到底与他有何冤仇？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(981,0,1);   --  1(1):[WWW]说: 江湖上传言，似乎是为了一*本叫”辟邪剑谱”的秘笈．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(982,36,0);   --  1(1):[林平之]说: 可是我家实在没什麽辟邪剑*谱．**这七十二路辟邪剑法，是我*爹爹亲口传授，那有什麽剑*谱．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(983,0,1);   --  1(1):[WWW]说: 江湖中人谣传此剑法威力无*穷，所以引得余沧海这老贼*的觊觎．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(984,36,0);   --  1(1):[林平之]说: 若是我林家的辟邪剑法当真*威力无穷，今天我林家也不*会落的如此下场．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(985,0,1);   --  1(1):[WWW]说: 可是你先祖不是打败过长青*子吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(986,36,0);   --  1(1):[林平之]说: 是了，或许是我和父亲尚未*完全融会贯通，从今以後，*我要好好钻研此剑法，为我*双亲报仇．*多谢少侠帮忙，这份恩情，*我林平之他日定当回报．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,2,-2,-2,-1,-1,312,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,-2,-2,-2,314,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(36,3,-2,-2,315,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[青城派]:场景事件编号 [3]
    instruct_37(2);   --  37(25):增加道德2
--end

