--function oldevent_936()
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_25(33,26,21,26);   --  25(19):场景移动33-26--21-26
    instruct_1(2849,19,0);   --  1(1):[岳不群]说: 承蒙各位看得起我华山派，*每年都选择在我华山齐聚，*举办这武林大会．*今年岳某特别邀请到少林寺　*住持玄慈大师，前来此处主　*持今年的”华山论剑”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2850,70,4);   --  1(1):[玄慈]说: 阿弥陀佛！*承蒙大家看得起我玄慈，今　*年就由我来为各位服务．*今年还是和往年一样，受到*邀请前来华山的各位英雄，*都有机会成为新一任的武林*盟主，获得保管”神杖”的*资格．**现在，我宣布大会开始，只*要愿意，谁都可出来比试，*直到无人挑战为止．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2851,19,0);   --  1(1):[岳不群]说: 不知那位英雄要先出来接受*挑战？**．．．．．***似乎没有人愿意先出来？*．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(21,26,33,26);   --  25(19):场景移动21-26--33-26
    instruct_1(2852,0,1);   --  1(1):[WWW]说: 好，那就我先来！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(33,26,25,26);   --  30(1E):主角走动33-26--25-26
    instruct_1(2853,0,1);   --  1(1):[WWW]说: 不知那位英雄愿下场赐教？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_58();   --  58(3A):武道大会比武
--end

