--function oldevent_1015()
    instruct_3(-2,35,1,1,-1,-1,-1,8246,8246,8246,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,36,1,1,-1,-1,-1,8248,8248,8248,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,37,1,1,-1,-1,-1,8250,8250,8250,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,38,1,1,-1,-1,-1,8252,8252,8252,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_1(2915,0,1);   --  1(1):[WWW]说: 门总算开了，*终於可以回去了．**可是，心里面好像怪怪的，*总觉得好像少了件什麽事．*．．．．．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,0,50,386,0) ==false then    --  28(1C):判断WWW品德0-50是则跳转到:Label0
        instruct_1(2916,60,0);   --  1(1):[欧阳锋]说: 小子，别想走．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2917,0,1);   --  1(1):[WWW]说: 真的发生事情了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,25,1,1,-1,-1,-1,8206,8206,8206,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
        instruct_3(-2,26,1,1,-1,-1,-1,8208,8208,8208,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,27,1,1,-1,-1,-1,8210,8210,8210,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,28,1,1,-1,-1,-1,8212,8212,8212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,29,1,1,-1,-1,-1,8214,8214,8214,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,30,1,1,-1,-1,-1,8216,8216,8216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,31,1,1,-1,-1,-1,8218,8218,8218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,32,1,1,-1,-1,-1,8220,8220,8220,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,33,1,1,-1,-1,-1,8222,8222,8222,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,34,1,1,-1,-1,-1,8224,8224,8224,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_40(1);   --  40(28):改变主角站立方向1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2918,0,1);   --  1(1):[WWW]说: 我就知道，每次在结局前，*总是少不了一场大混战．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2919,67,0);   --  1(1):[裘千仞]说: 小子，你武功那麽强，*一定是从”十四天书”中领*悟到什麽奥妙．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2920,71,0);   --  1(1):[洪教主]说: 快将它说出来，否则．．．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2921,0,1);   --  1(1):[WWW]说: 否则怎样？*你们个个都是小侠我的手下*败将，还想怎样？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2922,22,0);   --  1(1):[左冷禅]说: 一个人打不过你，*那十个人呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2923,0,1);   --  1(1):[WWW]说: 不会吧！你们个个都是武林*中有名的夙宿，不会联合起*来打我一个人吧？*传了出去，你们以後怎麽做*人？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2924,19,0);   --  1(1):[岳不群]说: 事到如此，还管得了这麽许*多吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2925,51,0);   --  1(1):[慕容复]说: 何况，把你杀了後，也没人*会传出去了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2926,62,0);   --  1(1):[金轮法王]说: 别说废话了．动手吧！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(133,3,0,0) ==false then    --  6(6):战斗[133]是则跳转到:Label1
            instruct_15(83);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label1

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2927,60,0);   --  1(1):[欧阳锋]说: 哼！算你厉害．*我们走．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,25,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
        instruct_3(-2,26,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,27,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,28,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,29,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,30,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,31,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,32,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,33,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,34,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_67(23);   --  67(43):播放音效23
        instruct_1(2928,0,1);   --  1(1):[WWW]说: 总算料理完毕了．*咦！好像又有声音．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_17(-2,1,18,25,4062);   --  17(11):修改场景贴图:当前场景层1坐标12-19
        instruct_17(-2,1,18,26,4062);   --  17(11):修改场景贴图:当前场景层1坐标12-1A
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2929,0,1);   --  1(1):[WWW]说: 怎麽门又关起来了．*这次大概真的结束了．*走吧，我得赶快了．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2930,57,0);   --  1(1):[黄药师]说: 小子，*你想就这样子走了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2917,0,1);   --  1(1):[WWW]说: 真的发生事情了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,25,1,1,-1,-1,-1,8226,8226,8226,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,1,1,-1,-1,-1,8228,8228,8228,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,1,1,-1,-1,-1,8230,8230,8230,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,1,1,-1,-1,-1,8232,8232,8232,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,1,1,-1,-1,-1,8234,8234,8234,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,1,1,-1,-1,-1,8236,8236,8236,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,31,1,1,-1,-1,-1,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,32,1,1,-1,-1,-1,8240,8240,8240,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,33,1,1,-1,-1,-1,8242,8242,8242,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,34,1,1,-1,-1,-1,8244,8244,8244,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2918,0,1);   --  1(1):[WWW]说: 我就知道，每次在结局前，*总是少不了一场大混战．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2931,69,0);   --  1(1):[洪七公]说: 在这武林中，你干下了多少*坏事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2932,3,0);   --  1(1):[苗人凤]说: 看看你的道德指数吧，你都*干了些什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2933,55,0);   --  1(1):[郭靖]说: 练武是为了什麽？*行侠仗义，济弱扶倾的目的*你都忘了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2934,64,0);   --  1(1):[周伯通]说: 你在武林中混了这麽久，尽*学一些坏东西．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2935,56,0);   --  1(1):[黄蓉]说: 是我们错了，*没能把你教好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2936,70,0);   --  1(1):[玄慈]说: 但我们也不能让你就这样一*走了之．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2937,50,0);   --  1(1):[乔峰]说: 别怪我们出手太重，你留在*这世间也只是个祸害．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2938,69,0);   --  1(1):[洪七公]说: 动手吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2939,70,0);   --  1(1):[玄慈]说: 阿弥陀佛！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(134,3,0,0) ==false then    --  6(6):战斗[134]是则跳转到:Label2
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2940,55,0);   --  1(1):[郭靖]说: 我们已经尽力了，还是无法*消灭你这祸害．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2941,70,0);   --  1(1):[玄慈]说: 阿弥陀佛！*这是众生的浩劫呀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2942,69,0);   --  1(1):[洪七公]说: 杀不了你这个大魔头．*唉！或许是天意吧！*我们走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,25,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,31,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,32,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,33,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,34,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_67(23);   --  67(43):播放音效23
    instruct_1(2928,0,1);   --  1(1):[WWW]说: 总算料理完毕了．*咦！好像又有声音．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_17(-2,1,18,25,4062);   --  17(11):修改场景贴图:当前场景层1坐标12-19
    instruct_17(-2,1,18,26,4062);   --  17(11):修改场景贴图:当前场景层1坐标12-1A
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2929,0,1);   --  1(1):[WWW]说: 怎麽门又关起来了．*这次大概真的结束了．*走吧，我得赶快了．
    instruct_0();   --  0(0)::空语句(清屏)
--end

