--function oldevent_620()
    instruct_1(2327,112,0);   --  1(1):[???]说: 这位少侠，远道而来，*不知有何贵事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2328,0,1);   --  1(1):[WWW]说: ＜哇！这马子正点＞*哦！没什麽事，我等旅游各*地，为的是找几本书，路过*这里，想进来碰碰运气．***不过刚刚进来时，好像听他*们在讲，你们也在找书，叫*什麽．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2329,112,0);   --  1(1):[???]说: 是我回族圣物可兰经．*此书是本族祖传之物，得自*回教圣地麦加，数十代都是*由首领珍重保管，乃本族圣*物．**不料前些日子金轮法王趁我*父亲远出之际，竟将经书抢*了过去，说要献给朝廷，以*此为挟，控制我回人．***因此我率领了本族勇士，想*从金轮法王那儿将经书抢夺*回来，但那家伙实在太厉害*了，三番两次都被他打了回*来.
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2330,0,1);   --  1(1):[WWW]说: 是吗？*此事包在我身上．我替姑娘*将那可兰经要回来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2331,112,0);   --  1(1):[???]说: 少侠若肯帮忙，我霍青桐代*全族人向少侠谢谢．**但还请少侠小心，那和尚功*夫厉害的紧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2332,0,1);   --  1(1):[WWW]说: ＜为你赴汤蹈火在所不惜＞*我会小心的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,621,622,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,-2,-2,625,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,625,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(16,2,1,1,-1,-1,-1,6812,6812,6812,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [2]
    instruct_3(16,3,1,1,631,-1,-1,6814,6814,6814,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [3]
    instruct_3(16,4,1,1,-1,-1,-1,6816,6816,6816,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [4]
    instruct_3(16,5,-2,-2,633,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [5]
    instruct_3(16,6,-2,-2,633,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [6]
    instruct_3(16,7,-2,-2,633,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [7]
    instruct_3(16,8,-2,-2,633,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [8]
    instruct_3(16,9,-2,-2,633,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [9]
    instruct_3(16,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [10]
    instruct_3(16,11,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [11]
    instruct_3(16,12,1,1,633,-1,-1,6758,6758,6758,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [12]
    instruct_3(16,13,1,1,633,-1,-1,6758,6758,6758,-2,-2,-2);   --  3(3):修改事件定义:场景[金轮寺]:场景事件编号 [13]
    instruct_8(3);   --  8(8):切换大地图音乐
--end

