--function oldevent_59()
    instruct_3(-2,0,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,3,-2,-2,-1,-1,62,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_1(195,13,0);   --  1(1):[谢逊]说: 你是谁？*到这冰火岛上做什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(196,0,1);   --  1(1):[WWW]说: 想不到这冰天雪地的荒岛上*竟还有人居住．*前辈身体想必甚为健朗．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(197,13,0);   --  1(1):[谢逊]说: 听你的声音，还只是个年轻*小子，你们还有多少帮手，*一起出来吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(198,0,1);   --  1(1):[WWW]说: 听我的声音？*莫非前辈视力不是很好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(199,13,0);   --  1(1):[谢逊]说: 别以为我谢逊眼睛瞎了就好*对付，你们这些想夺屠龙宝*刀的贼子，动手吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,2,-2,-2,74,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_1(202,0,1);   --  1(1):[WWW]说: 你我无冤无仇，我们干嘛动*手．
    instruct_0();   --  0(0)::空语句(清屏)
--end

