--function oldevent_660()
    instruct_1(2417,79,0);   --  1(1):[???]说: 我说老五啊，天气这麽冷，*喝这烈酒虽能驱寒，但如能*再配上热腾腾的兔肉，那才*真是够味呢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2418,79,4);   --  1(1):[???]说: 四哥，在这寒天雪地中，上*那找兔肉去？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2419,79,0);   --  1(1):[???]说: 谁说没有兔子，只是我们功*夫不济，抓不到罢了．*我曾听人家说，在极北之地*有一个很厉害的猎户，轻功*极高，在这雪地上猎兔，犹*如猎鹰般的快，狠，准．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2420,79,4);   --  1(1):[???]说: 那还等什麽，我们这就上他　*家去要点兔肉来吃．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2421,79,0);   --  1(1):[???]说: 你想上他家？我看要等到下*辈子了．*你知道他住那吗？*他住的地方叫”云鹤崖”，*轻功不到家的人根本就上不*去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2422,79,4);   --  1(1):[???]说: 云鹤崖？*他该不会是．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2423,79,0);   --  1(1):[???]说: 没错，四大恶人之一的云中*鹤．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2424,79,4);   --  1(1):[???]说: 那．．．那我们还是喝酒就*好了．
    instruct_0();   --  0(0)::空语句(清屏)
--end

