--function oldevent_139()
    instruct_1(528,7,0);   --  1(1):[何太冲]说: 没事就快走吧，*别在此逗留．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(1,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(532,0,1);   --  1(1):[WWW]说: 在下想请何掌门放过那位*可怜的大夫，何况那女人长*得这麽丑，不要也罢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(533,7,0);   --  1(1):[何太冲]说: 你说什麽！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(534,0,1);   --  1(1):[WWW]说: 糟了，说溜了嘴．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(18,3,0,0) ==false then    --  6(6):战斗[18]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(17,7,0);   --  1(1):[何太冲]说: ．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,-2,-2,-2,165,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(2);   --  37(25):增加道德2
    instruct_56(3);   --  56(38):提高声望值3
--end

