--function oldevent_20()
    instruct_1(53,0,1);   --  1(1):[WWW]说: 奇怪，头怎麽这麽重．．*莫非．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,5994,6012);   --  27(1B):显示动画
    instruct_14();   --  14(E):场景变黑
    instruct_22();   --  22(16):内力降为0
    instruct_3(-2,-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,1,-2,21,-1,-1,5168,5168,5168,0,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(54,4,0);   --  1(1):[阎基]说: 原本预备对付苗人凤的悲酥*清风，居然先让你受用了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,6026,6036);   --  27(1B):显示动画
    instruct_1(55,0,1);   --  1(1):[WWW]说: 你．．你．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(56,4,0);   --  1(1):[阎基]说: 江湖上最近盛传有个年轻小*毛头到处找”十四天书”，*想必就是你吧？*找到几本书啦？*快交出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(57,0,1);   --  1(1):[WWW]说: 你真卑鄙．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(58,4,0);   --  1(1):[阎基]说: 我阎基做事向来只求结果，*不问方法．**怎麽？还不拿出来，要大爷*我亲自动手吗？要知道书对*死人是没有意义的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(59,0,1);   --  1(1):[WWW]说: 倒要看看死的是你还是我．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(1,0,58,0) ==true then    --  6(6):战斗[1]否则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(60,4,0);   --  1(1):[阎基]说: 想不到少侠武功如此盖世，*连西夏的悲酥清风都对你没*有作用，*”十四天书”的确该是少侠*所有．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(61,0,1);   --  1(1):[WWW]说: 转的倒是挺快的嘛，毛头小*子马上就变成少侠，难怪这*一点点武艺可以混到现在．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(62,4,0);   --  1(1):[阎基]说: 小的这两下那能和少侠相比*呢，混口饭吃罢了．**对了，小的略通点医术，少*侠是否有什麽病痛，小的帮*你看看．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(63,0,1);   --  1(1):[WWW]说: 我看是算了吧，给你看病，*那岂不是让黄鼠狼给鸡把脉*一样的道理．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(64,4,0);   --  1(1):[阎基]说: 那儿的话，那少侠就随便看*看，若不嫌弃的话，有什麽*喜欢的就拿去吧．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,7,-2,-2,-2,-2,25,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_3(-2,8,-2,-2,-2,-2,-2,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_56(1);   --  56(38):提高声望值1
        do return; end
    end    --:Label0

    instruct_15(83);   --  15(F):战斗失败，死亡
--end

