--function oldevent_32()

    if instruct_4(137,1,0) ==false then    --  4(4):是否使用物品[苗人凤眼毒解药]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_37(3);   --  37(25):增加道德3

    if instruct_55(10,-1,14,0) ==false then    --  55(37):事件d*编号10是否为-1是则跳转到:Label1
        instruct_3(-2,10,-2,-2,867,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    end    --:Label1

    instruct_32(137,-1);   --  32(20):物品[苗人凤眼毒解药]+[-1]
    instruct_1(103,0,1);   --  1(1):[WWW]说: 苗大侠，我这就帮你敷上解*药．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,-2,-2,33,-1,-1,5216,5216,5216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,9,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(104,0,1);   --  1(1):[WWW]说: 苗大侠，你觉得怎麽样．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(105,3,0);   --  1(1):[苗人凤]说: 嗯！我觉得好多了．***少侠一路辛苦了，苗某不胜*感激，若苗家有任何你需要*的东西，请尽管拿取．*这毒手药王也真是厉害，用*毒至深，想不到医术也是一*流．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(106,0,1);   --  1(1):[WWW]说: 药王他老人家已过世了，*这解药是他徒弟调制的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(107,3,0);   --  1(1):[苗人凤]说: 难怪，当年我因为一件事曾*与药王有过冲突，所以当我*听说要去求毒手药王时，*我就劝你不要去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(108,0,1);   --  1(1):[WWW]说: 是什麽事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(109,3,0);   --  1(1):[苗人凤]说: 这一件事我到今日还是不能*明白．**十八年前，我误伤了一位好*友，只因兵刃上喂有剧毒，*见血封喉，竟尔无法挽救．*我想这毒药如此厉害，多半*与毒手药王有关，因此去向*他询问．*结果他一口否认，说他毫不*知情，想我一来不会说话，*二来心情甚恶，就打了起来
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(110,0,1);   --  1(1):[WWW]说: 如此说来，这位好朋友是你*亲手杀死的了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(111,3,0);   --  1(1):[苗人凤]说: 是的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(112,0,1);   --  1(1):[WWW]说: 这好朋友姓啥叫什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(113,3,0);   --  1(1):[苗人凤]说: 辽东大侠胡一刀．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(1,0,46) ==true then    --  16(10):队伍是否有[胡斐]否则跳转到:Label2
        instruct_1(114,1,1);   --  1(1):[胡斐]说: 当真是你杀了我父亲．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(115,3,0);   --  1(1):[苗人凤]说: 你是胡一刀的儿子！*好，快来将我杀了，替你爹*报仇．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(116,0,1);   --  1(1):[WWW]说: 且慢．这中间有很大的误会
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(117,1,1);   --  1(1):[胡斐]说: 有什麽误会，他都承认了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(118,0,1);   --  1(1):[WWW]说: 你听我说，当年在苗大侠剑*上偷偷喂毒的是名叫阎基的*人．他因为知道苗，胡二人*身上有两本极重要的书，所*以在两人比武时偷偷喂上剧*毒，想让二人两败俱伤，*他好坐收渔翁之利．只是，*当初你二人为何比试，才让*阎基这小人从中搞鬼？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(119,3,0);   --  1(1):[苗人凤]说: 唉！当年我二人都因受过*”金先生”的恩惠，**所以当他的书籍被人偷出，*我二人都想把书找齐送回去*．．．．*当时，我二人各找到一本，*双方都想把对方的书夺来，*以便日後送回去，*所以才相约比试．*其实，只要好好讲，或许我*们可以一起去找寻这些书，*但可能是听双方名声太大，*本就想互相较量一下，**看看是他的胡家刀法厉害，*还是我苗家剑法强．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(120,0,1);   --  1(1):[WWW]说: 这真是一场误会．***一切都是阎基那卑鄙小人所*引起的，所幸这个小人已无*法再作恶了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(121,1,1);   --  1(1):[胡斐]说: 照你这麽说，是我胡家刀法*比不上你苗家剑法，所以死*的才是我父亲．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(122,3,0);   --  1(1):[苗人凤]说: 其实我心中有个遗憾，当年*我砍到令尊手臂时，同时我*也被令尊的後着踢倒在地，*只因我剑上被喂上剧毒，*令尊才会毒发死亡．**所以到底是何者功夫高明，*一直没有答案．**今天我看见你这麽大了，我*很高兴．但我更希望你能学*好胡家刀法，把我打败，*让胡家刀法发扬光大，那我*对你爹也有个交待．**届时这位小兄弟想要的*”飞狐外传”一书也将一并*送上．*等你练好了胡家刀法，可随*时来找我．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(123,0,1);   --  1(1):[WWW]说: 苗大侠．这中间有很大的误*会．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(124,3,0);   --  1(1):[苗人凤]说: 有什麽误会？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(125,0,1);   --  1(1):[WWW]说: 你听我说，当年在苗大侠剑*上偷偷喂毒的是名叫阎基的*人．他因为知道苗，胡二人*身上有两本极重要的书，所*以在两人比武时偷偷喂上剧*毒，想让二人两败俱伤，*他好坐收渔翁之利．只是，*当初你二人为何比试，才让*阎基这小人从中搞鬼？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(119,3,0);   --  1(1):[苗人凤]说: 唉！当年我二人都因受过*”金先生”的恩惠，**所以当他的书籍被人偷出，*我二人都想把书找齐送回去*．．．．*当时，我二人各找到一本，*双方都想把对方的书夺来，*以便日後送回去，*所以才相约比试．*其实，只要好好讲，或许我*们可以一起去找寻这些书，*但可能是听双方名声太大，*本就想互相较量一下，**看看是他的胡家刀法厉害，*还是我苗家剑法强．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(126,0,1);   --  1(1):[WWW]说: 这真是一场误会．一切都是*阎基那卑鄙小人所引起的，*所幸这个小人已无法再作恶*了，我会将这事转告给胡大*侠的儿子知道．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(127,3,0);   --  1(1):[苗人凤]说: 你知道他儿子的下落，*快带他来见我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(128,0,1);   --  1(1):[WWW]说: 只怕他一看到你就想拼命．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(129,3,0);   --  1(1):[苗人凤]说: 其实我心中有个遗憾，当年*我砍到胡兄手臂时，我同时*也被胡兄的後着踢倒在地，*只因我剑上被喂上剧毒，胡*兄才会毒发死亡．所以到底*是何者的功夫高明，一直没*有答案．***今天我知道胡家有後，我很*高兴．但我更希望他能学好*胡家刀法，把我打败，让胡*家刀法发扬光大，那我对他*爹也有个交待．**届时你想要的”飞狐外传”*一书也将送上．**麻烦你转告他，等他准备好*了，可随时来找我．
    instruct_0();   --  0(0)::空语句(清屏)
--end

