--function oldevent_466()
    instruct_1(1579,0,1);   --  1(1):[WWW]说: 晚辈参见郭大侠，黄女侠．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1580,56,0);   --  1(1):[黄蓉]说: 你是来找”射鵰英雄传”的*吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1581,0,1);   --  1(1):[WWW]说: 江湖中人传言果然不假，黄*女侠的聪明机智真是令人敬*佩．*没错，此次上桃花岛拜见二*位，主要目的就是为了”射*鵰英雄传”一书．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1582,56,0);   --  1(1):[黄蓉]说: 来到这里，费了番功夫吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1583,0,1);   --  1(1):[WWW]说: 是费了番功夫，不过若是能*拿到”射鵰英雄传”，再苦*也是值得的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1584,55,0);   --  1(1):[郭靖]说: 没错，”射鵰英雄传”一书*是在我夫妇手里，给你也是*可以．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1585,0,1);   --  1(1):[WWW]说: 多谢郭大侠及黄女侠．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1586,55,0);   --  1(1):[郭靖]说: 小兄弟，你叫我一声大侠．*我问你，为什麽江湖上人会*尊称我一声郭大侠．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1587,0,1);   --  1(1):[WWW]说: 那是因为郭大侠武功高强，*降龙十八掌威震八方．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1588,55,0);   --  1(1):[郭靖]说: 我再问你，为什麽我们要练*武功．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1589,0,1);   --  1(1):[WWW]说: 因为武功若练的比别人强，*则可以压制对方，做到你想*要做的事．*当然啦，我不是说要去欺压*别人，而是你若武功比不上*对方，拿什麽去行侠仗义？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1590,55,0);   --  1(1):[郭靖]说: 我辈练功学武，所为何事？*行侠仗义，济人困厄固然是*本份，但那只是侠之小者．*江湖上所以尊称我一声郭大*侠，实乃敬我早年为国为民*，奋不顾身地戍守襄阳．*然我能力有限，不能为民解*困，有愧这”大侠”二字．**我想你聪明智慧过我十倍，　　　*将来的成就定然远胜於我．　　　　*只盼你心头牢牢记着：*”为国为民，侠之大者”*这八个字，日後名扬天下，*成为万民敬仰的真正大侠．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1591,0,1);   --  1(1):[WWW]说: ．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1592,55,0);   --  1(1):[郭靖]说: 所以说，只要你能发挥一个*侠者的风范，这本书我就直*接送给你．*不然，你就得胜过我才能拿*走这本书．**为了让你好好的修练，我就*送你一些东西，以免你去偷*别人的东西，误入歧途．*在厨房角落的柜子里，放有*一些我桃花岛的独特药丸，*你就拿去吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_55(3,-1,14,0) ==false then    --  55(37):事件d*编号3是否为-1是则跳转到:Label0
        instruct_3(-2,3,-2,-2,924,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    end    --:Label0


    if instruct_55(4,-1,14,0) ==false then    --  55(37):事件d*编号4是否为-1是则跳转到:Label1
        instruct_3(-2,4,-2,-2,925,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    end    --:Label1

    instruct_1(1591,0,1);   --  1(1):[WWW]说: ．．．．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,90,100,0,37) ==true then    --  28(1C):判断WWW品德90-100否则跳转到:Label2
        instruct_1(1593,55,0);   --  1(1):[郭靖]说: 你在江湖上的作为，我夫妇*俩已有所闻，这书你就拿去*吧．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(148,1);   --  2(2):得到物品[射鵰英雄传][1]
        instruct_3(-2,1,-2,-2,467,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,2,-2,-2,468,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        do return; end
    end    --:Label2

    instruct_3(-2,1,-2,-2,469,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,475,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_1(1603,55,0);   --  1(1):[郭靖]说: 要成为一个真正的侠客，或*是只想拥有高强的武功，就*看你自己了．
    instruct_0();   --  0(0)::空语句(清屏)
--end

