--function oldevent_555()

    if instruct_4(128,1,0) ==false then    --  4(4):是否使用物品[七宝指环]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(2078,45,0);   --  1(1):[薛慕华]说: 这．．这是我逍遥派掌门之*信物，怎会在阁下手中．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2079,0,1);   --  1(1):[WWW]说: 你师祖已将逍遥派掌门传给*我兄弟了．．．*事情是这样的．．．*你师父跟我们说，如果有需*要医术高明的人加入的话，*可以来这边找你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2080,45,0);   --  1(1):[薛慕华]说: 是，少侠有什麽需要，*弟子将全力配合．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,556,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

