--function oldevent_189()
    instruct_25(30,28,30,14);   --  25(19):场景移动30-28--30-14
    instruct_1(652,20,0);   --  1(1):[莫大]说: 还请费兄回去告诉左掌门，*五岳并派之事，我衡山派是*不会答应的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(653,84,4);   --  1(1):[???]说: 莫掌门还请三思，五岳合并*之後，对我五岳剑派是大有*好处的．*到时我五岳派就可和少林，*武当各大派相庭抗礼了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(654,20,0);   --  1(1):[莫大]说: 衡山派百年基业，还不想断*送在我莫大手里．*费兄还请回吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(655,84,4);   --  1(1):[???]说: 本来我是不想提的，*刘师兄此次金盆洗手，*是跟魔教有关吧？*左盟主已知道其中曲折了，*但顾全五岳同盟之情．．．**所以还是请莫掌门三思，*届时还望光临嵩山，参加五*狱同盟大会．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(656,20,0);   --  1(1):[莫大]说: 送客！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,14,1,1,232,-1,-1,5208,5208,5208,-2,49,53);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,1,1,232,-1,-1,5202,5202,5202,-2,48,53);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,1,1,232,-1,-1,5202,5202,5202,-2,48,54);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,22,-2,-2,-1,-1,225,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,-2,-2,-1,-1,226,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,-2,-2,-1,-1,227,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,25,-2,-2,-1,-1,228,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,-2,-2,-1,-1,229,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,-2,-2,-1,-1,230,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,-2,-2,-1,-1,231,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(30,14,30,28);   --  25(19):场景移动30-14--30-28
--end

