--function oldevent_41()

    if instruct_4(158,1,0) ==false then    --  4(4):是否使用物品[七心海棠]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(158,-1);   --  32(20):物品[七心海棠]+[-1]
    instruct_1(168,2,0);   --  1(1):[程灵素]说: 你找到了？挺厉害的嘛！*断肠草的解药在这，*拿去吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(137,1);   --  2(2):得到物品[苗人凤眼毒解药][1]
    instruct_3(-2,-2,-2,-2,42,-1,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(1);   --  37(25):增加道德1
--end

