--function oldevent_535()
    instruct_27(3,6342,6348);   --  27(1B):显示动画
    instruct_1(2005,52,0);   --  1(1):[苏星河]说: 逍遥派不肖弟子苏星河，*拜见本派新任掌门．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2006,49,0);   --  1(1):[虚竹]说: 老前辈行此大礼，*可折杀小僧了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2007,52,0);   --  1(1):[苏星河]说: 师弟，你是我师父的关门弟*子，又是本派掌门．我虽是*师兄，却也要向你磕头！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2008,49,0);   --  1(1):[虚竹]说: 这个．．这个．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2009,52,0);   --  1(1):[苏星河]说: 师父叫你拜他为师，要你磕*九个头，你磕了没有？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2010,49,0);   --  1(1):[虚竹]说: 头是磕过的，不过当时我不*知道是拜师．我是少林派弟*子，不能改入别派．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2011,52,0);   --  1(1):[苏星河]说: 师父当然也想到了这一点，*他老人家定是化去了你原来*的武功，再传你本派功夫．*师父已将毕生功力都传给了*你，是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2012,49,0);   --  1(1):[虚竹]说: 是的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2013,52,0);   --  1(1):[苏星河]说: 象徵本派掌门人的那枚宝石*指环，是师父从自己手上除*下来，给你戴在手上的，*是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2014,49,0);   --  1(1):[虚竹]说: 是！不过．．．*不过我实在不知道这是什麽*掌门人的信物．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2015,52,0);   --  1(1):[苏星河]说: 师弟，你真是福泽深厚．*我和丁春秋想这宝石指环，*想了几十年，始终都无法到*手，你却在一个时辰之内，*便受到师父的垂青．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2016,49,0);   --  1(1):[虚竹]说: 前辈拿去便是．*这只指环，小僧半点用处也*没有．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2017,52,0);   --  1(1):[苏星河]说: 师弟，你受师父临死时的重*托，岂能推卸责任？**师父将指环交给你，是叫你*除灭丁春秋那厮，是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2018,49,0);   --  1(1):[虚竹]说: 正是．但小僧功行浅薄，*怎能当此重任？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2019,0,1);   --  1(1):[WWW]说: 贤弟，想不到你得到了个大*奖，当起掌门来了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2020,49,0);   --  1(1):[虚竹]说: 大哥，我．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

