--function oldevent_932()
    instruct_1(2845,0,1);   --  1(1):[WWW]说: 咦！桌上好像有封请帖．*．．．．．．．．．．．．*是今年华山论剑的邀请帖！*经过这麽久的努力，我终於*得到认可，受邀参加今年在*华山举行的武林大会．*似乎已到了游戏的尽头了，*只要我在武林大会中打败群*雄，夺得武林盟主一位，那*麽我就可以得知如何离开这*里的秘密．**感谢各位朋友的帮忙，让我*能顺利走到现在，接下来就*得看我自己了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(189,1);   --  2(2):得到物品[武林帖][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(25,24,-2,-2,934,935,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[武道大会]:场景事件编号 [24]
    instruct_59();   --  59(3B):全体队员离队并找不着
--end

