--function oldevent_335()

    if instruct_4(136,1,0) ==false then    --  4(4):是否使用物品[玄冰碧火酒]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_37(4);   --  37(25):增加道德4
    instruct_3(-2,-2,-2,-2,337,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_32(136,-1);   --  32(20):物品[玄冰碧火酒]+[-1]
    instruct_1(45,0,1);   --  1(1):[WWW]说: 小兄弟，快将这酒喝下去！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(46,38,0);   --  1(1):[石破天]说: 我不喜欢喝酒．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(47,0,1);   --  1(1):[WWW]说: 快喝了他吧！喝下去之後，*你就不会忽冷忽热了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(48,38,0);   --  1(1):[石破天]说: 真的．那我要喝．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,-2,-2,-2,-2,-2,5152,5152,5152,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,-2,-2,-2,-2,338,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(49,38,0);   --  1(1):[石破天]说: 哇！这酒怎麽这麽辛辣！*不过好像真的挺有效的，*谢谢你！*既然老伯伯不在了，*我要去找妈妈跟小黄了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(1,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label1
        do return; end
    end    --:Label1

    instruct_1(50,0,1);   --  1(1):[WWW]说: 你要找你妈妈？*我正好在四处旅行，不妨我*们结伴一起走，好吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,38,0);   --  1(1):[石破天]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(51,38,0);   --  1(1):[石破天]说: 好啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(38);   --  10(A):加入人物[石破天]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(40,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[悦来客栈]:场景事件编号 [7]
    instruct_3(40,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[悦来客栈]:场景事件编号 [8]
--end

