--function oldevent_26()
    instruct_1(66,4,0);   --  1(1):[阎基]说: 少侠近日可好，*”十四天书”找齐了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(67,0,1);   --  1(1):[WWW]说: 干嘛！这麽关心书的下落．*如果找齐了，这次又准备了*什麽迷药伺候？*”奇淫合欢散”还是*”我爱一条材”？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(68,4,0);   --  1(1):[阎基]说: 小的怎敢．倒是少侠刚才所*提的那两味药，不知是那个*门派所有，是新配制出来的*吗？药效如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(69,0,1);   --  1(1):[WWW]说: 是周星星配制出来的，药效*肯定是天下一流的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(70,4,0);   --  1(1):[阎基]说: ＜他日若能够巧遇周大侠，*　一定得向他请教．＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(71,0,1);   --  1(1):[WWW]说: ＜你遇的到才有鬼！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,21,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,7,-2,-2,-2,-2,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
--end

