--function oldevent_105()
    instruct_1(417,15,0);   --  1(1):[金花婆婆]说: 小子，*你怎麽老是跑来灵蛇岛，*存心扰我老人家清静是不？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(418,0,1);   --  1(1):[WWW]说: 只怕您不是普通的老太婆，*而是明教的四大护法之首，*紫衫龙王．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(419,15,0);   --  1(1):[金花婆婆]说: 你这小子倒也厉害，*居然知道我老太婆的真实身*份．*你说，这次来是做什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(420,0,1);   --  1(1):[WWW]说: 晚辈是替明教捎个口信，*希望龙王能回光明顶去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(421,15,0);   --  1(1):[金花婆婆]说: 要我回去做什麽，*看他们在那里争吵谁要当教*主吗？*老太婆我倒宁愿留在这清静*清静．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(422,0,1);   --  1(1):[WWW]说: 龙王，你还有所不知，*阳教主生前留下一封遗书，*要谢护法暂代副教主之位．*事情的经过是这样的．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(423,15,0);   --  1(1):[金花婆婆]说: 那更好了，有谢三哥在，*教中的一切事务，*我就放心了．*而我，*就更可以在这休养了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(424,0,1);   --  1(1):[WWW]说: ＜看来得激她一下 ＞***我说明教这”光明圣火阵”*有多厉害嘛？我倒也不信．**明教被六大派围攻，*还不是靠我去帮他们解围．*我看是谢护法不想给我这*”倚天屠龙记”一书，*才故意编了这麽一个难题．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(425,15,0);   --  1(1):[金花婆婆]说: 你说什麽？*你是说我明教都没人了，*一切都要靠你这娃儿帮忙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(426,0,1);   --  1(1):[WWW]说: 我是没这麽说，*但事实是如此．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(427,15,0);   --  1(1):[金花婆婆]说: 小娃儿，不要以为运气好打*赢了几场，就神气起来了．**要知一山还有一山高，我明*教这”光明圣火阵”从创教*至今，还没人能破过．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(428,0,1);   --  1(1):[WWW]说: 我就不信有什麽是破不了的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(429,15,0);   --  1(1):[金花婆婆]说: 好大的口气，我就让你知道*”光明圣火阵”的厉害，*有种就上我光明顶来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(11,90,1,1,111,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [90]
    instruct_3(11,91,1,1,112,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [91]
    instruct_3(11,92,1,1,113,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [92]
    instruct_3(11,93,1,1,114,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [93]
    instruct_3(11,94,1,1,115,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [94]
    instruct_3(11,101,1,1,116,-1,-1,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [101]
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_14();   --  14(E):场景变黑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_8(3);   --  8(8):切换大地图音乐
--end

