--function oldevent_484()
    instruct_1(1672,0,1);   --  1(1):[WWW]说: 这雕像中的女子倒也美丽．*．．．．**咦！这下面写着几个字．．*”磕首千遍，供我驱策，．*遵行我命，百死无悔”．．*＜神经病，谁要对着个石像*磕头＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(53,1,0) ==false then    --  16(10):队伍是否有[段誉]是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(1673,53,1);   --  1(1):[段誉]说: 神仙姊姊，小生段誉今日得*睹芳容，死而无憾．**姊姊在此离世独居，不也太*寂寞了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1674,0,1);   --  1(1):[WWW]说: 段兄，你该不会在跟这玉像*说话吧．*＜这人真是獃得可以＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1675,53,1);   --  1(1):[段誉]说: 藐姑射之山，有神人居焉，*肌肤若冰雪，绰约若处子，*不食五谷，吸风饮露．*神仙姊姊，你若能活过来跟*我说一句话，我便为你死一*千遍，一万遍，也如身登极*乐，欢喜无限．***磕首千遍，原本就是天经地*义之事．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,-2,-2,-2,-2,-2,6316,6316,6316,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(0,6316,6334);   --  27(1B):显示动画
    instruct_27(0,6316,6334);   --  27(1B):显示动画
    instruct_1(1677,0,1);   --  1(1):[WWW]说: 兄弟，你干麽？*你真的要磕一千下呀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1678,53,1);   --  1(1):[段誉]说: 十，十一，十二．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(0,6316,6334);   --  27(1B):显示动画
    instruct_27(0,6316,6334);   --  27(1B):显示动画
    instruct_27(0,6316,6334);   --  27(1B):显示动画
    instruct_1(1679,0,1);   --  1(1):[WWW]说: 我的妈呀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,-2,-2,-2,-2,-2,6338,6338,6338,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,11,-2,-2,-2,-2,-2,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1680,0,1);   --  1(1):[WWW]说: 兄弟，你还真磕了一千下，*你的头还好吧．*你看，蒲团都被你磕破了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1681,53,1);   --  1(1):[段誉]说: 咦！这蒲团中似乎藏有一个*绸包，这上面还有写字．．*．．．．．*”汝既磕首千遍，自当供我*驱策，终身无悔．此卷为我*逍遥派武功精要，每日卯午*酉三时，务须用心修习一次*．．．．”
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1682,0,1);   --  1(1):[WWW]说: 这里面好像有两本册子，一*本叫”北冥神功”，另一本*叫”凌波微步”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1683,53,1);   --  1(1):[段誉]说: ＜我不想学武功，可是神仙*姊姊的命令焉可不遵？*我向她磕足一千个头，便是*答允供他驱策，奉行她的命*令．*我就先看看书上写些什麽＞*”穷发之北有冥海者．．．*．．．．．．．．．北冥神*功系引世人之力而为我有．*北冥大水，非由自生．*语云：百川汇海，大海之水*以容百川而得．汪洋巨浸，*端在积聚．此手太阴肺经为*北冥神功第一课．．．．．*．．．．．．．．．．．．*这上面还附有一些穴道图，*上面有条绿线．．．．．．*．．．．．．．．．．．．*咦！*我体内怎麽有点热热的．．*．．．．．．*另外一本”凌波微步”中，*上面画着好多脚印，而且还*注明着一些易经中的方位，*正好前几日刚钻研过易经，*这看起来容易多了．．．．*．．．．．．．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1684,53,1);   --  1(1):[段誉]说: 神仙姊姊，你吩咐我朝午晚*三次练功，段誉不敢有违．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1685,0,1);   --  1(1):[WWW]说: 段兄想通了，肯练武了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1686,53,1);   --  1(1):[段誉]说: 但今後我会对人加倍客气，*别人不会来打我，我自然也*不会去吸他的内力．*至於这”凌波微步”我更要*用心练熟，眼见不对，立刻*溜之大吉．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1687,0,1);   --  1(1):[WWW]说: 随便你了，我们走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,11,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(63,1);   --  2(2):得到物品[北冥神功][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(47,1);   --  2(2):得到物品[凌波微步][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_33(53,29,0);   --  33(21):段誉学会武功北冥神功
    instruct_45(53,30);   --  45(2D):段誉增加轻功30
    instruct_47(53,10);   --  47(2F):段誉增加攻击力10
    instruct_34(53,20);   --  34(22):段誉增加资质20
    instruct_49(53,2);   --  49(31):段誉内力属性2
    instruct_3(-2,1,-2,-2,485,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,1,1,-1,-1,-1,6752,6752,6752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,-1,-1,486,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,-1,-1,486,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,-1,-1,486,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_17(52,1,27,28,1842);   --  17(11):修改场景贴图:场景[燕子坞]层1坐标1B-1C
    instruct_17(52,1,27,20,1838);   --  17(11):修改场景贴图:场景[燕子坞]层1坐标1B-14
    instruct_17(52,1,27,29,0);   --  17(11):修改场景贴图:场景[燕子坞]层1坐标1B-1D
    instruct_67(21);   --  67(43):播放音效21
--end

