--function oldevent_295()
    instruct_1(1003,0,1);   --  1(1):[WWW]说: 看你的样子，*你就是那”狗熊野猪”的头*头？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1004,24,0);   --  1(1):[余沧海]说: 阁下是谁，*为何跟我青城派过不去？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1005,0,1);   --  1(1):[WWW]说: 我跟你说，快将林震南前辈*放了，否则打你满头包．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1006,24,0);   --  1(1):[余沧海]说: 原来是为了林家的事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1007,0,1);   --  1(1):[WWW]说: 快说，林前辈在那？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1008,24,0);   --  1(1):[余沧海]说: 哼！只怕你见不到他了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1009,0,1);   --  1(1):[WWW]说: 你将他杀了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1010,24,0);   --  1(1):[余沧海]说: 谁叫他不说出”辟邪剑谱”*的下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1011,0,1);   --  1(1):[WWW]说: 你好狠毒的心．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1012,24,0);   --  1(1):[余沧海]说: 你这麽想见他，*我就送你去．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(50,3,0,0) ==false then    --  6(6):战斗[50]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1013,0,1);   --  1(1):[WWW]说: 看来阎王爷不收留我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1014,24,0);   --  1(1):[余沧海]说: 哼！*废话少说，要杀要剐随你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1015,0,1);   --  1(1):[WWW]说: 我看起来像会乱杀人的吗？*要如何处置你，由林家自己*来决定．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,296,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,0,-2,-2,315,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,315,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,315,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,297,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(56,1,-2,-2,288,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [1]
    instruct_56(2);   --  56(38):提高声望值2
--end

