--function oldevent_215()

    if instruct_16(35,29,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        instruct_3(-2,56,-2,-2,-1,-1,206,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,57,-2,-2,-1,-1,214,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        do return; end
    end    --:Label0

    instruct_3(-2,56,-2,-2,-1,-1,219,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,57,-2,-2,-1,-1,220,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
--end

