--function oldevent_247()
    instruct_1(797,31,0);   --  1(1):[丹青生]说: 小兄弟到梅庄来不知有何见*教？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(798,0,1);   --  1(1):[WWW]说: 在下听闻杭州梅庄的佳酿美*酒名闻遐尔，特来叨扰一杯*酒喝喝．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(799,31,0);   --  1(1):[丹青生]说: 喝酒？你是什麽东西．*要喝我精酿的美酒岂是那麽*容易．*快滚！省得我动手赶人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(800,0,1);   --  1(1):[WWW]说: 不给喝就不给喝，*那麽凶干嘛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,250,248,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

