--function oldevent_409()
    instruct_1(1392,0,1);   --  1(1):[WWW]说: 前辈，我送你的玉蜂浆很有*用吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1393,64,0);   --  1(1):[周伯通]说: 你的玉蜂浆固然有用，*但我养蜂的本事更是高强．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1394,0,1);   --  1(1):[WWW]说: 哦？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1395,64,0);   --  1(1):[周伯通]说: 你没看，我培养出一批天下*无双，人间罕见的异种来，*当真是巧夺天工，造化之奇*也无如此奇法．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1396,0,1);   --  1(1):[WWW]说: 不知是怎样的奇法？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1397,64,0);   --  1(1):[周伯通]说: 小兄弟，我且问你．*人是万物之灵，身上有刺花*刺字，或刺盘龙虎豹，或书*天下太平．*但除了人之外，禽兽虫蚁身*上，可有刺字的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1398,0,1);   --  1(1):[WWW]说: 虎有黄斑，豹有金钱，至於*蝴蝶毒蛇，身上花纹更奇於*刺花百倍．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1399,64,0);   --  1(1):[周伯通]说: 但你见过虫蚁身上有字的没*有？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1400,0,1);   --  1(1):[WWW]说: 你说是天生的麽？*那倒没见过．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1401,64,0);   --  1(1):[周伯通]说: 好，今天给你开一开眼界．*仔细看看那些蜜蜂的翅膀．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1402,0,1);   --  1(1):[WWW]说: 咦！真的有字．*好像是”情谷底”三个字．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1403,64,0);   --  1(1):[周伯通]说: 看到没有．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1404,0,1);   --  1(1):[WWW]说: ＜这字决非天生，分明是有*  人故意刺成的．＞**这那是什麽天下无双，人间*罕见了，八成是你用绣花针*刺上去的，对不对．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1405,64,0);   --  1(1):[周伯通]说: 你说什麽？*你再看看其他的蜜蜂．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1406,0,1);   --  1(1):[WWW]说: 这．．这．怎麽每只都有．*而且写的字都不太一样．*这只写的是”我在绝”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1407,64,0);   --  1(1):[周伯通]说: 我还看过别只上面写的是*”二午寺”，*还有”一山恶”的．*你说，这全都是我写的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1409,0,1);   --  1(1):[WWW]说: ”情谷底”，”我在绝”，*”二午寺”，”一山恶”*．．．．*这到底是什麽意思？*前辈，这蜜蜂不是你自己养*的吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1410,64,0);   --  1(1):[周伯通]说: 咦，你怎麽知道？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1411,0,1);   --  1(1):[WWW]说: 我胡乱猜的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1412,64,0);   --  1(1):[周伯通]说: 这些蜜蜂是从北边山脉飞来*的，起先我也吓了一大跳．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1413,0,1);   --  1(1):[WWW]说: 我看这事有点怪异．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1414,64,0);   --  1(1):[周伯通]说: 看来你还是不服气的样子，*你等着好了，我会养出更奇*怪的蜜蜂来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,4,-2,-2,406,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,12,-2,-2,410,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(21,1,1,1,417,-1,-1,6158,6158,6158,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [1]
    instruct_3(21,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [4]
    instruct_3(40,9,1,1,18,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[悦来客栈]:场景事件编号 [9]
    instruct_3(40,10,1,1,18,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[悦来客栈]:场景事件编号 [10]
    instruct_3(40,11,1,1,18,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[悦来客栈]:场景事件编号 [11]
    instruct_3(40,12,1,1,18,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[悦来客栈]:场景事件编号 [12]
    instruct_39(80);   --  39(27):打开场景绝情谷底
--end

