--function oldevent_478()
    instruct_1(1666,90,0);   --  1(1):[???]说: 赏善罚恶两使既已出巡，*江湖上任何帮会门派都难逍*遥．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1667,90,4);   --  1(1):[???]说: 老李，若是掌门师叔奉令而*去，那便如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1668,90,0);   --  1(1):[???]说: 自是有去无回．过去三十年*中奉令而去侠客岛的那些帮*主，总舵主，掌门人，．．*又有那一个回来过了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1669,0,1);   --  1(1):[WWW]说: 那侠客岛是什麽地方？*为什麽各掌门都一去不回？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1670,90,0);   --  1(1):[???]说: 小子，别偷听别人讲话．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1671,0,1);   --  1(1):[WWW]说: 自己说的这麽大声．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,2,-2,-2,479,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,6,-2,-2,479,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,479,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
--end

