--function oldevent_678()
    instruct_1(2485,72,0);   --  1(1):[孔八拉]说: 年轻人，是来投靠我霹雳堂*的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2486,0,1);   --  1(1):[WWW]说: 霹雳堂？*这里叫做霹雳堂．*是演布袋戏的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2487,72,0);   --  1(1):[孔八拉]说: 你胡说些什麽！*我霹雳堂在江湖上是何等的*地位，你居然不知．*那麽轰动武林，惊动万教的*霹雳堂堂主”孔八拉”，*你总该知道了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2488,0,1);   --  1(1):[WWW]说: ”孔八拉”！*那不是流氓吗？*你是坏人对不对．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2489,72,0);   --  1(1):[孔八拉]说: 胡说，我孔八拉怎麽会是坏*人，你不要乱说话，害我招*不到弟子．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2490,0,1);   --  1(1):[WWW]说: 我才没胡说呢，否则全屋子*里怎麽只有你一个人，难道*其它人都送去管训了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2491,72,0);   --  1(1):[孔八拉]说: 那是我还没找到合适的人，*去宣扬我霹雳堂的教义，否*则我霹雳堂早就人满为患．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2492,0,1);   --  1(1):[WWW]说: 难怪日後我台湾岛上有这麽*多的”兄弟”，有人在打*球，有人打”打球的人”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2493,72,0);   --  1(1):[孔八拉]说: 你是在绕口令吗？*嗯！听起来口才不错，很适*合做我霹雳堂的宣扬大使．*这样吧，我将我霹雳堂最厉*害的武器”霹雳弹”赠送给*你，你把它拿到江湖上去大*展神威，让道上的朋友知道*我霹雳堂的厉害．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2494,0,1);   --  1(1):[WWW]说: ”霹雳弹”？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2495,72,0);   --  1(1):[孔八拉]说: 不错，这霹雳弹是我霹雳堂*所研发出来的独门暗器，用*”硝石”制成，威力无比．*我这里有几颗，你拿去吧．*另外还有一本”霹雳秘笈”*里面记载霹雳弹的制作方法*及一般暗器的介绍，你也拿*去吧．**不过记着，必须要有硝石才*能制造出霹雳弹．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2496,0,1);   --  1(1):[WWW]说: 好啊，快给我．*有了这，武功不强也可打倒*敌人了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2497,72,0);   --  1(1):[孔八拉]说: 等一下．*我想起了一件事，*这东西不能给你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2498,0,1);   --  1(1):[WWW]说: 为什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2499,72,0);   --  1(1):[孔八拉]说: 我差点忘记父亲的交待了，*我父亲交待我要将这东西留*给”金先生”的传人．*因为这人刚开始时武功一定*不好，要靠我霹雳堂的霹雳*弹去帮助他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2500,0,1);   --  1(1):[WWW]说: 你父亲认识Ｍｒ．金？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2501,72,0);   --  1(1):[孔八拉]说: 他的外号叫”密斯特”吗？*这个我父亲倒没提过．**不过据我父亲讲，他们的交*情还不错．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2502,0,1);   --  1(1):[WWW]说: 那你知道”十四天书”的事*吗？或是其他有关金先生的*事？　　　　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2503,72,0);   --  1(1):[孔八拉]说: 我父亲没跟我讲多少，除了*说有一位金先生的传人日後*可能会来，要我帮助他．．*对了，你怎麽会问这些？*莫非．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2504,0,1);   --  1(1):[WWW]说: 没错，我就是那位传人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2505,72,0);   --  1(1):[孔八拉]说: 真的吗！那太好了．　*如此我就可以将这两样东西　*送你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2506,0,1);   --  1(1):[WWW]说: 谢谢孔堂主．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2507,72,0);   --  1(1):[孔八拉]说: 对了，屋内还有两样东西你*也拿去吧．**一样是一种可提神醒脑，恢*复体力的东西，也是本岛的*名产，叫做”槟榔”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2508,0,1);   --  1(1):[WWW]说: 我的妈呀！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2509,72,0);   --  1(1):[孔八拉]说: 还有一样则是我以前常穿的*”皮衣”，具有着防御的功*能．*但是最近实在太热了，我也*用不着，就送你吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2510,0,1);   --  1(1):[WWW]说: ＜穿皮衣吃槟榔！还真是标*准的”孔八拉 ”！＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2511,72,0);   --  1(1):[孔八拉]说: 如果屋子内还有什麽你需要*的，尽管拿，别客气．**日後，如果有什麽困难，就*回来找我，到时，就算我帮*不上忙，我也会召集一票弟*兄去帮你．***不过，还得先靠你将我霹雳*堂的名声发扬光大才是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2512,0,1);   --  1(1):[WWW]说: 我会的．那在下告辞了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2513,72,0);   --  1(1):[孔八拉]说: 慢走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2514,0,1);   --  1(1):[WWW]说: 如果屋子内还有什麽你需要*的，你尽管拿，别客气．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(101,10);   --  2(2):得到物品[霹雳弹][10]
    instruct_2(89,1);   --  2(2):得到物品[霹雳秘笈][1]
    instruct_2(163,1);   --  2(2):得到物品[黄钥匙][1]
    instruct_3(-2,-2,-2,-2,679,686,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

