--function oldevent_675()
    instruct_1(2471,0,1);   --  1(1):[WWW]说: 林师父，有件事能不能请你*帮个忙．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2472,75,0);   --  1(1):[???]说: 什麽事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2473,0,1);   --  1(1):[WWW]说: 有道菜不知你听过没，*能不能帮我作一下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2474,75,0);   --  1(1):[???]说: 那道菜？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2475,0,1);   --  1(1):[WWW]说: ”玉笛谁家听落梅”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2476,75,0);   --  1(1):[???]说: ”玉笛谁家听落梅”，*这不是桃花岛的招牌菜吗．**嗯，做这道菜是有点麻烦，*不过还难不倒我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2477,0,1);   --  1(1):[WWW]说: 真的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2478,75,0);   --  1(1):[???]说: 不过，这菜需要的材料蛮多*的，我这边现在也没有．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2479,0,1);   --  1(1):[WWW]说: 什麽材料，我帮你找去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2480,75,0);   --  1(1):[???]说: 好，仔细听着．***第一样材料是羊羔坐臀．*第二样材料是小猪耳朵．*第三样材料是小牛腰子．*第四样材料是獐腿肉．*最後一样材料是兔肉．*总共五种材料．*你如果找齐这五种材料後，*我就可以帮你作出”玉笛谁*家听落梅”这道菜了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,676,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

