--function oldevent_486()
    instruct_67(21);   --  67(43):播放音效21
    instruct_1(1688,0,1);   --  1(1):[WWW]说: 哇！这是什麽怪物．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1689,53,1);   --  1(1):[段誉]说: 难道．．．．．．．．．．*难道竟是传说中的万毒之王*”莽牯朱蛤”，小心点！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(78,3,0,0) ==false then    --  6(6):战斗[78]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1690,0,1);   --  1(1):[WWW]说: 真是好险，差点就变成了这*”癞蛤蟆”的晚餐了．这会*换我来顿”三杯田鸡”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(38,1);   --  2(2):得到物品[莽牯朱蛤][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(3);   --  56(38):提高声望值3
--end

