--function oldevent_10()

    if instruct_4(133,1,0) ==false then    --  4(4):是否使用物品[两页刀法]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_3(-2,-2,-2,-2,11,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,-2,-2,-2,-2,7,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_32(133,-1);   --  32(20):物品[两页刀法]+[-1]
    instruct_1(24,1,0);   --  1(1):[胡斐]说: 咦？这．．．这是．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(25,0,1);   --  1(1):[WWW]说: 此两页刀法乃是从江南恶霸*閰基家中所得．难道这就是*你所失之物？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(26,1,0);   --  1(1):[胡斐]说: 正是家传胡氏刀谱的总诀．*多年来寻觅不得，*不料今日被你找到．*小时候我曾听平四叔说，*偷我胡家刀谱的人，也是我*的杀父仇人之一．*今後我定要勤练胡家刀法，*再找那苗人凤及恶霸阎基*报杀父之仇．*小兄弟，你的盛情，*我胡斐不知如何言谢！**有什麽需要我效劳的，*尽管说吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(27,0,1);   --  1(1):[WWW]说: 找到了你胡家刀法的缺页，*我却还没找到”雪山飞狐”*一书，唉！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(28,1,0);   --  1(1):[胡斐]说: 我胡斐虽不知该书的下落，*但我曾经想过，为什麽我的*名字与这本书名这麽相似？*莫非家父当初跟此书有什麽*关联？**这样吧！若你有需要的话，*尽管讲一声，我就陪你找上*一找．*我正好也想到江湖上去历练*一下，找害死我父亲的苗人*凤报仇．*当然，还得先找那偷我胡家*刀法的阎基报仇，害我一直*无法练功．走，找他去．*而我屋内的东西，你若有需*要，也可自行拿取．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_55(2,-1,14,0) ==false then    --  55(37):事件d*编号2是否为-1是则跳转到:Label1
        instruct_3(-2,2,-2,-2,833,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    end    --:Label1


    if instruct_55(3,-1,14,0) ==false then    --  55(37):事件d*编号3是否为-1是则跳转到:Label2
        instruct_3(-2,3,-2,-2,834,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    end    --:Label2

    instruct_37(2);   --  37(25):增加道德2

    if instruct_9(1,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label3
        do return; end
    end    --:Label3

    instruct_1(29,0,1);   --  1(1):[WWW]说: 胡大哥肯随我闯荡江湖否？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label4
        instruct_1(175,1,0);   --  1(1):[胡斐]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label4

    instruct_1(30,1,0);   --  1(1):[胡斐]说: 好．我就随你一走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(31,0,1);   --  1(1):[WWW]说: 胡大哥肯随我闯荡江湖帮这*个忙，那再好也不过了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,1,-2,-2,-2,-2,7,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_10(1);   --  10(A):加入人物[胡斐]
    instruct_37(1);   --  37(25):增加道德1
--end

