--function oldevent_446()
    instruct_1(1632,61,0);   --  1(1):[欧阳克]说: 上次我是大意输你，你还敢*再来，这次要你躺着出去．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(69,3,0,0) ==false then    --  6(6):战斗[69]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1633,0,1);   --  1(1):[WWW]说: 怎样，又大意了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1634,61,0);   --  1(1):[欧阳克]说: 哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,445,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,7,-2,-2,-1,-1,473,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,-1,-1,473,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
--end

