--function oldevent_76()
    instruct_1(256,11,0);   --  1(1):[杨逍]说: 不知小兄弟是那派的高徒，*其他五派的人呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(257,0,1);   --  1(1):[WWW]说: 在下并非六大派的人，*此次前来明教是想打听一本*书的下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(258,11,0);   --  1(1):[杨逍]说: 是”倚天屠龙记”吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(259,0,1);   --  1(1):[WWW]说: 江湖上传言果然非假，*”倚天屠龙记”一书果然在*明教中．*不知前辈可否借小弟一用．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(260,11,0);   --  1(1):[杨逍]说: 借你一用．*哼！你没将明教光明左使*杨逍瞧在眼里，*是不是仗着我明教大难之际*来捡现成便宜？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(261,0,1);   --  1(1):[WWW]说: 事情并非如此，实在是*这本书对我十分重要，*我非得到它不可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(262,11,0);   --  1(1):[杨逍]说: 那我就先把你解决再说，*免得六大派攻来後被你*混水摸鱼了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(263,0,1);   --  1(1):[WWW]说: 我并不是来与明教为难的，*杨左使还是留点气力对付*六大派好了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(264,11,0);   --  1(1):[杨逍]说: 对付你倒也不用花费什麽*力气．*出招吧！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(9,3,0,0) ==false then    --  6(6):战斗[9]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,4,-2,-2,-1,-1,-1,5308,5308,5308,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,-1,-1,-1,5310,5310,5310,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,-1,-1,-1,5312,5312,5312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,-1,-1,-1,5314,5314,5314,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,-1,-1,-1,5312,5308,5312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,-1,-1,-1,5310,5310,5310,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,1,1,-1,-1,-1,5298,5298,5298,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(265,0,1);   --  1(1):[WWW]说: 杨左使，我就说了嘛，*跟我打很耗力气的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(266,11,0);   --  1(1):[杨逍]说: 你．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(267,18,0);   --  1(1):[成崑]说: 哈！哈！哈！*打的好，打的好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(268,0,1);   --  1(1):[WWW]说: 那里来的贼秃在那鬼吼鬼*叫的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(269,11,0);   --  1(1):[杨逍]说: 你是谁？是怎麽混进我明*教的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(270,18,0);   --  1(1):[成崑]说: 你问我成崑怎麽进来的？*当然是大摇大摆走进来的．**还多亏了这小朋友，替我省*下一番功夫．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(271,11,0);   --  1(1):[杨逍]说: 你是混元霹雳手成崑，*谢法王的师父？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(272,18,0);   --  1(1):[成崑]说: 没错，*我就是那头笨狮的师父．**拜他的鲁莽所赐，你们和六*大派结下了这麽多梁子．*　　　　　　　　　　　*今天起明教就将化为灰烬，*也了结了我多年来的心愿．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(273,0,1);   --  1(1):[WWW]说: 要是我猜的没错，*这中间的一切都是*你苦心安排的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(274,18,0);   --  1(1):[成崑]说: 你这小子倒还蛮聪明的嘛．***没错，激起谢逊的愤怒，*让他到处乱杀人，*留下我的名字好激我现身，*到最後再故意让江湖人知道*其实是明教谢逊所为，引起*江湖各大派与明教间仇杀，*这一切都是我精心计画的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(275,11,0);   --  1(1):[杨逍]说: 你为何要如此做？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(276,18,0);   --  1(1):[成崑]说: 要问就去问你们前任教主*阳顶天．我原本一桩美好的*姻缘却被他活生生拆散了，*明明是我爱妻，只因他当*上了魔教的大头子，就将我*爱妻霸占了去．*因此我心中便立下重誓：*只要我成崑还有一口气在，*定要让魔教永无宁日．*我立下此誓已有二十余年，*今日方见大功告成．**哈哈！*现下六大派应该已攻下*总坛光明顶了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(277,11,0);   --  1(1):[杨逍]说: 什麽！*那我得快点赶回光明顶．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(278,18,0);   --  1(1):[成崑]说: 不用赶回去死了，*你死在这就可以了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(279,0,1);   --  1(1):[WWW]说: 喂！老秃驴，*你们这些恶人怎麽每次都喜*欢将自己的坏勾当讲出来．*是不是以为我们这些好人都*会死掉，无法揭发你的阴谋*？*杨左使，你先赶回光明顶，*这个秃驴交给我好了，*让他嚐嚐多嘴的後果．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(280,18,0);   --  1(1):[成崑]说: 哼！就凭你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(281,11,0);   --  1(1):[杨逍]说: 你．．你．．真的行吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(282,0,1);   --  1(1):[WWW]说: 别忘了，如果连我也不行的*话，那你可能更惨哦！*快去吧，我随後就到．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(4);   --  56(38):提高声望值4

    if instruct_6(10,3,0,0) ==false then    --  6(6):战斗[10]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,1,1,80,-1,-1,5310,5310,5310,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_17(-2,1,28,24,0);   --  17(11):修改场景贴图:当前场景层1坐标1C-18
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(283,0,1);   --  1(1):[WWW]说: 这老贼溜的倒快，*没时间追他了，*我得赶快赶去光明顶才是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(3);   --  56(38):提高声望值3
    instruct_8(3);   --  8(8):切换大地图音乐
--end

