--function oldevent_546()

    if instruct_16(47,0,5) ==true then    --  16(10):队伍是否有[阿紫]否则跳转到:Label0
        instruct_1(2086,46,0);   --  1(1):[丁春秋]说: 阿紫，你居然还敢回来．*”神木王鼎”呢？
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(2053,0,1);   --  1(1):[WWW]说: ＜怎麽长的好像小孩子，*莫非真练到返老还童了？＞**丁春秋，你认得这七宝指环*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2054,46,0);   --  1(1):[丁春秋]说: 你是谁，怎麽会有这东西．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2055,0,1);   --  1(1):[WWW]说: 见到掌门还不跪下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2056,46,0);   --  1(1):[丁春秋]说: 这逍遥派掌门的信物是那偷*来的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2057,0,1);   --  1(1):[WWW]说: 是你师父给的，他还要我们*来替他清理门户，除去你这*武林败类．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2058,46,0);   --  1(1):[丁春秋]说: 那老贼被我打落山崖，居然*还没死，竟然还将这七宝指*环给了你．*也好，你亲自来送死，也免*得我去找这七宝指环了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2059,92,0);   --  1(1):[???]说: 师父功力，震烁古今，你竟*敢和我们作对，这叫萤火虫*与日月争光！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2060,92,0);   --  1(1):[???]说: 螳臂挡车，自不量力，可笑*啊！可笑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2061,92,0);   --  1(1):[???]说: 我师父谈笑之间，便可将你*们这一干妖魔小丑置之死地*．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2062,0,1);   --  1(1):[WWW]说: 你们烦不烦，要打就快打，*别在那大吹法螺．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(86,3,0,0) ==false then    --  6(6):战斗[86]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,0,1,1,590,-1,-1,6600,6600,6600,-2,39,28);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,4,-2,-2,547,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,548,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,549,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,550,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,547,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,548,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,-2,-2,549,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,12,-2,-2,550,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,-2,-2,547,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,-2,-2,548,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(53,0,-2,-2,538,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[擂鼓山]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2063,0,1);   --  1(1):[WWW]说: 好不容易解决了这老怪．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2064,92,0);   --  1(1):[???]说: 少侠英雄无敌，小人忠诚归*附，死心塌地，愿为主人效*犬马之劳．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2065,92,0);   --  1(1):[???]说: 这天下盟主一席，非少侠莫*属．只须主人下令动手，小*人赴汤蹈火，万死不辞．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2066,92,0);   --  1(1):[???]说: 丁春秋这灯烛之火，居然也*敢和日月争光．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2067,92,0);   --  1(1):[???]说: 少侠德配天地，威震当世，*古今无比．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2068,0,1);   --  1(1):[WWW]说: 这些家伙转的真快，不愧是*星宿派的弟子．不过听了虽*有点肉麻，但也蛮舒服的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(10);   --  37(25):增加道德10
    instruct_56(6);   --  56(38):提高声望值6
--end

