--function oldevent_82()
    instruct_1(296,0,1);   --  1(1):[WWW]说: 哇！这里这麽多人，*干什麽这麽热闹，*可少不了小侠我．*我说名门正派又怎麽样，*还不是一样赶尽杀绝，*跟魔教又有什麽两样，*只不过藉口好听一点罢了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(297,14,0);   --  1(1):[韦一笑]说: 都是你这个兔崽子，*打伤了鹰王和我，
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(298,11,0);   --  1(1):[杨逍]说: 还有我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(299,14,0);   --  1(1):[韦一笑]说: 害我们只剩下范右使应战，*寡不敌众．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(300,0,1);   --  1(1):[WWW]说: 既然如此，*我就帮你们打发这些人，*当是陪罪好了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(301,70,0);   --  1(1):[玄慈]说: 少侠非魔教人士，*还请速速离去，*以免受池鱼之殃．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(302,0,1);   --  1(1):[WWW]说: 那好，大家都别打了，因为*这中间着实有许多误会，*让我好好说给你们听．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(303,6,0);   --  1(1):[灭绝]说: 现在年轻人都这麽狂妄吗？*你自以为是武林盟主吗！*要我们听你说．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(304,8,0);   --  1(1):[唐文亮]说: 你这小贼，跟魔教勾结，*想要拖延时间，好施什麽诡*计麽？先杀了你再说．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(305,0,1);   --  1(1):[WWW]说: 我就知道要你们安安静静听*我说是不太可能，那只有想*办法让你们服气了．*一起来吧，这样比较省事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(306,6,0);   --  1(1):[灭绝]说: 好狂妄的口气．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(307,70,0);   --  1(1):[玄慈]说: 阿弥陀佛．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(12,3,0,0) ==false then    --  6(6):战斗[12]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,12,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,14,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,0,0,-1,-1,-1,5434,5434,5434,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,0,0,-1,-1,-1,5432,5432,5432,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,0,0,-1,-1,-1,5434,5434,5434,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,20,0,0,-1,-1,-1,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,21,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,22,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,-1,-1,-1,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,25,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,0,0,-1,-1,-1,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,29,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,32,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,33,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,34,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,35,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,38,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,39,0,0,-1,-1,-1,5446,5446,5446,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,40,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,41,0,0,-1,-1,-1,5444,5444,5444,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,42,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,43,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,44,0,0,-1,-1,-1,5444,5444,5444,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,45,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,46,0,0,-1,-1,-1,5446,5446,5446,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,48,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,51,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,52,0,0,-1,-1,-1,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,53,0,0,-1,-1,-1,5438,5438,5438,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,54,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,55,0,0,-1,-1,-1,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,56,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,58,0,0,-1,-1,-1,5442,5442,5442,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,59,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,60,0,0,-1,-1,-1,5440,5440,5440,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_3(-2,61,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,62,0,0,-1,-1,-1,5442,5442,5442,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,63,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(308,0,1);   --  1(1):[WWW]说: 如何？*现在肯安静地听我说了吧．**事情的经过是这样的．．．*如此如此．．．．．．．．*这般这般．．．．．．．．*总之，一切的阴谋，*都是成崑那奸贼所计划的．**所以我说呢，你们两方还是*握手言和吧，反正明教杀过*六大派的人，六大派也杀过*明教的人，大家半斤八两，*差不了多少，就都罢手吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(309,8,0);   --  1(1):[唐文亮]说: 话都是你在说的，*是不是真的，*我们怎麽知道．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(310,6,0);   --  1(1):[灭绝]说: 哼！技不如人，*说这麽多做什麽，*走吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(311,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，盼少侠以後多所*规劝引导，总要使明教改邪*归正，少做坏事．*我们走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,12,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,21,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,22,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,25,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,26,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,31,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,32,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,33,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,34,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,35,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,36,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,37,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,38,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,39,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,40,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,41,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,42,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,43,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,44,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,45,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,46,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,47,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,48,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,49,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,50,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,51,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,52,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,53,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,54,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,55,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,56,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,57,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
    instruct_3(-2,58,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,59,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,60,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_3(-2,61,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,62,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,63,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
    instruct_3(-2,64,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
    instruct_3(-2,65,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
    instruct_3(-2,66,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
    instruct_3(-2,67,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
    instruct_3(-2,68,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
    instruct_3(-2,69,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
    instruct_3(-2,70,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
    instruct_3(-2,79,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
    instruct_3(-2,80,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
    instruct_3(-2,81,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
    instruct_3(-2,82,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [82]
    instruct_3(-2,83,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,84,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
    instruct_3(-2,96,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [96]
    instruct_3(-2,97,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [97]
    instruct_3(-2,98,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [98]
    instruct_3(-2,99,0,0,-1,-1,89,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [99]
    instruct_3(-2,3,1,1,83,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,1,1,84,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,1,1,85,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,1,1,88,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,77,1,1,87,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [77]
    instruct_3(-2,78,1,1,87,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [78]
    instruct_19(29,34);   --  19(13):主角移动至1D-22
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(312,14,0);   --  1(1):[韦一笑]说: 小子，你还不赖嘛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(313,10,0);   --  1(1):[范遥]说: 蝠王，不可无礼．*明教全教下上，*叩谢少侠护教救命的大恩！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(314,0,1);   --  1(1):[WWW]说: 快别这麽说，仗义行侠，*本就是我辈中人应当做的．**况且，*这次也因为我的鲁莽，*害你们陷入苦战．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(315,12,0);   --  1(1):[殷天正]说: 那里，是我们没问清楚．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(316,14,0);   --  1(1):[韦一笑]说: 你们也别这麽客套了．*这样吧，大家听我一言，**我说呢，这位少侠武功盖世*义薄云天，於本教有存亡续*绝的大恩．*咱们拥立他为本教第三十四*任教主．**由他来做教主，总比你来做*教主好吧，*杨左使，你说对不对啊．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(317,11,0);   --  1(1):[杨逍]说: 是啊！*这位少侠来做我们教主，*也比你韦一笑来做好的多．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(318,14,0);   --  1(1):[韦一笑]说: 你．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(319,10,0);   --  1(1):[范遥]说: 你们两个别在那里吵了，*丢人现眼的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(320,0,1);   --  1(1):[WWW]说: 不，不，在下我虽然一直梦*想能当个什麽掌门教主的．**但是我仍有要事在身，且跟*你们是不同世界的人，所以*你们还是另觅他人吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(321,10,0);   --  1(1):[范遥]说: 少侠如果一直推却不肯，我*们明教恐怕又要为此争闹不*休，四分五裂，*到时又会被其他门派围攻，*导致灭亡了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(322,0,1);   --  1(1):[WWW]说: 我这里有封阳教主的遗书，*上面提到要谢逊谢法王暂代*教主之职．*我想你们还是先找到他再说*吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(323,10,0);   --  1(1):[范遥]说: 哦！真是如此，*来人啊！即刻通令下去，*全力寻找谢法王．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(324,0,1);   --  1(1):[WWW]说: 另外还有一件事拜托你们，*你们明教中是否有一本叫*”倚天屠龙记”的书？*是否能借我一下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(325,10,0);   --  1(1):[范遥]说: 有的．阳教主曾对我提过，*我们教中有一本奇书，*是我明教镇教之宝，*皆由历代教主相传而下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(326,0,1);   --  1(1):[WWW]说: 是吗？真的有．皇天不负苦*心人，打了这麽多场仗，*终於让我找到了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(327,10,0);   --  1(1):[范遥]说: 可是，这本书因为阳教主的*突然消失，其下落也无人知*道了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(328,12,0);   --  1(1):[殷天正]说: 少侠别担心，等我们找到谢*法王，整顿好教务後，必当*全力搜寻此书的下落．*若有消息，定当告之少侠．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(329,0,1);   --  1(1):[WWW]说: 好吧，也只有这样了．我有*空也会帮你们找找谢前辈，*在下这就告辞了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(330,10,0);   --  1(1):[范遥]说: 这里有块铁焰令，是我明教*的信物．**少侠在江湖上行走，若有什*麽困难需要我明教帮忙的时*後，只须出示这块铁焰令，*我明教全体教众一定全力相*助．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(190,1);   --  2(2):得到物品[明教铁焰令][1]
    instruct_37(10);   --  37(25):增加道德10
    instruct_56(15);   --  56(38):提高声望值15
--end

