--function oldevent_638()
    instruct_1(2389,54,0);   --  1(1):[袁承志]说: 看到你的样子，我的心也整*个活跃了起来．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(1,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(2390,0,1);   --  1(1):[WWW]说: 不如这样，袁兄何不暂时离*开这小岛，和在下一起到江*湖上闯闯，再显当年威风．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,54,0);   --  1(1):[袁承志]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(2391,54,0);   --  1(1):[袁承志]说: 好．离开武林这麽多年，也　*不知变得怎麽样了．袁某的*功夫不知是否还管用．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2392,0,1);   --  1(1):[WWW]说: 我们走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(54);   --  10(A):加入人物[袁承志]
    instruct_37(5);   --  37(25):增加道德5
--end

