--function oldevent_86()
    instruct_1(312,14,0);   --  1(1):[韦一笑]说: 小子，你还不赖嘛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(313,10,0);   --  1(1):[范遥]说: 蝠王，不可无礼．*明教全教下上，*叩谢少侠护教救命的大恩！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(314,0,1);   --  1(1):[WWW]说: 快别这麽说，仗义行侠，*本就是我辈中人应当做的．**况且，*这次也因为我的鲁莽，*害你们陷入苦战．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(315,12,0);   --  1(1):[殷天正]说: 那里，是我们没问清楚．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(316,14,0);   --  1(1):[韦一笑]说: 你们也别这麽客套了．*这样吧，大家听我一言，**我说呢，这位少侠武功盖世*义薄云天，於本教有存亡续*绝的大恩．*咱们拥立他为本教第三十四*任教主．**由他来做教主，总比你来做*教主好吧，*杨左使，你说对不对啊．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(317,11,0);   --  1(1):[杨逍]说: 是啊！*这位少侠来做我们教主，*也比你韦一笑来做好的多．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(318,14,0);   --  1(1):[韦一笑]说: 你．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(319,10,0);   --  1(1):[范遥]说: 你们两个别在那里吵了，*丢人现眼的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(320,0,1);   --  1(1):[WWW]说: 不，不，在下我虽然一直梦*想能当个什麽掌门教主的．**但是我仍有要事在身，且跟*你们是不同世界的人，所以*你们还是另觅他人吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(321,10,0);   --  1(1):[范遥]说: 少侠如果一直推却不肯，我*们明教恐怕又要为此争闹不*休，四分五裂，*到时又会被其他门派围攻，*导致灭亡了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(322,0,1);   --  1(1):[WWW]说: 我这里有封阳教主的遗书，*上面提到要谢逊谢法王暂代*教主之职．*我想你们还是先找到他再说*吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(323,10,0);   --  1(1):[范遥]说: 哦！真是如此，*来人啊！即刻通令下去，*全力寻找谢法王．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(324,0,1);   --  1(1):[WWW]说: 另外还有一件事拜托你们，*你们明教中是否有一本叫*”倚天屠龙记”的书？*是否能借我一下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(325,10,0);   --  1(1):[范遥]说: 有的．阳教主曾对我提过，*我们教中有一本奇书，*是我明教镇教之宝，*皆由历代教主相传而下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(326,0,1);   --  1(1):[WWW]说: 是吗？真的有．皇天不负苦*心人，打了这麽多场仗，*终於让我找到了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(327,10,0);   --  1(1):[范遥]说: 可是，这本书因为阳教主的*突然消失，其下落也无人知*道了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(328,12,0);   --  1(1):[殷天正]说: 少侠别担心，等我们找到谢*法王，整顿好教务後，必当*全力搜寻此书的下落．*若有消息，定当告之少侠．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(329,0,1);   --  1(1):[WWW]说: 好吧，也只有这样了．我有*空也会帮你们找找谢前辈，*在下这就告辞了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(330,10,0);   --  1(1):[范遥]说: 这里有块铁焰令，是我明教*的信物．**少侠在江湖上行走，若有什*麽困难需要我明教帮忙的时*後，只须出示这块铁焰令，*我明教全体教众一定全力相*助．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,6,-2,-2,88,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
--end

