--function oldevent_397()
    instruct_1(1305,58,0);   --  1(1):[杨过]说: 少侠别来无恙，旅程一切还*好吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1306,0,1);   --  1(1):[WWW]说: 一切还好．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(1,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(1302,0,1);   --  1(1):[WWW]说: 不知杨兄是否有意与我为伴*云游各地，一览这五岳三川*的风貌．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,58,0);   --  1(1):[杨过]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(1303,58,0);   --  1(1):[杨过]说: 好啊！或许旅途中会有龙儿*的下落也说不定．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(58);   --  10(A):加入人物[杨过]
    instruct_37(3);   --  37(25):增加道德3
--end

