--function oldevent_14()
    instruct_1(52,38,0);   --  1(1):[石破天]说: 我要去找妈妈跟小黄．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(1,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(50,0,1);   --  1(1):[WWW]说: 你要找你妈妈？*我正好在四处旅行，不妨我*们结伴一起走，好吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,38,0);   --  1(1):[石破天]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(51,38,0);   --  1(1):[石破天]说: 好啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(38);   --  10(A):加入人物[石破天]
    instruct_37(1);   --  37(25):增加道德1
--end

