--function oldevent_709()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2609,73,0);   --  1(1):[南贤]说: 我记得金先生曾跟我提过，*”天龙八部”一书是描写有*关皇室，平民，荣华，富贵*一类的故事．***而目前武林中具有皇室背景*的英雄少年有两位．*一位是大理段家的公子，*另一位则是姑苏慕容家的慕*容复公子．尤其慕容复现在*住的燕子坞内藏书丰富，或*许那里有些”十四天书”的*下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,0,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

