--function oldevent_101()
    instruct_1(388,0,1);   --  1(1):[WWW]说: 看你的样子，你大概就是金*花婆婆吧．快放了王前辈，*否则要你吃不完兜着走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(389,15,0);   --  1(1):[金花婆婆]说: 胡青牛老眼昏花了是不是，*叫了个小子来送死．**小子，*我看你年纪轻轻的，*快走吧，别自讨苦吃了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(390,0,1);   --  1(1):[WWW]说: 你活生生的拆散人家夫妻，*我就是看不惯，*这档事我管定了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(391,15,0);   --  1(1):[金花婆婆]说: 本来想这不关你的事，你非*要管，我就让你这不知天高*地厚的小子吃点苦头．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(14,0,35,1) ==true then    --  6(6):战斗[14]否则跳转到:Label0
        instruct_3(-2,-2,-2,-2,100,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_17(-2,1,21,17,0);   --  17(11):修改场景贴图:当前场景层1坐标15-11
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(392,0,1);   --  1(1):[WWW]说: 老婆婆，我想请问你天有多*高，地有多厚啊？我真的不*知道耶！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(393,15,0);   --  1(1):[金花婆婆]说: 哼！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_56(3);   --  56(38):提高声望值3
        do return; end
    end    --:Label0

    instruct_3(-2,-2,-2,-2,102,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(387,15,0);   --  1(1):[金花婆婆]说: 看你资质挺好的，*老婆婆我不想杀你，*你走吧．
    instruct_0();   --  0(0)::空语句(清屏)
--end

