--function oldevent_603()

    if instruct_4(160,1,0) ==false then    --  4(4):是否使用物品[唐诗选辑]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(2246,0,1);   --  1(1):[WWW]说: 咦！怎麽有字浮现出来，*写着什麽来着 ．．．**”连城诀”．．．*江陵城南西天宁寺大殿佛像*後．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,-2,604,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(63,1,1,1,-1,-1,-1,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [1]
    instruct_3(63,2,1,1,-1,-1,-1,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [2]
    instruct_3(63,3,1,1,-1,-1,-1,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [3]
    instruct_3(63,4,1,1,-1,-1,-1,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [4]
    instruct_3(63,5,1,1,-1,-1,-1,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [5]
    instruct_3(63,6,1,1,-1,-1,-1,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [6]
    instruct_3(63,7,1,1,-1,-1,-1,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [7]
    instruct_3(63,8,1,1,-1,-1,-1,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [8]
    instruct_3(63,9,1,1,-1,-1,-1,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [9]
    instruct_3(63,10,1,1,-1,-1,-1,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [10]
    instruct_3(63,11,1,1,-1,-1,-1,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [11]
    instruct_3(63,12,1,1,-1,-1,-1,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [12]
    instruct_3(63,13,1,1,-1,-1,-1,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [13]
    instruct_3(63,14,1,1,-1,-1,-1,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [14]
    instruct_3(63,15,1,1,-1,-1,-1,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [15]
    instruct_3(63,16,1,1,-1,-1,-1,6778,6778,6778,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [16]
    instruct_3(63,17,0,0,-1,-1,606,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [17]
    instruct_3(63,18,0,0,644,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [18]
--end

