--function oldevent_751()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2651,74,0);   --  1(1):[北丑]说: 道德有几斤重？*别听南贤那老头胡扯，满嘴*仁义道德的．*你想想看，如果你为了道德*不被减低，却不肯拿箱子里*的宝物，这样你还过得了关*吗？***世上那有真的圣人，重要的*是你必须能在这江湖混的下*去，”玩”成你的目标．*所以放手去开箱子吧，顶多*以後做些善事补回来不就得*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,1,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

