--function oldevent_429()
    instruct_1(1365,65,0);   --  1(1):[一灯]说: 真希望瑛姑赶快来杀我，*解除我的罪孽．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1367,0,1);   --  1(1):[WWW]说: 只怕她不会来杀你了，她现*在高兴都来不及了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1368,65,0);   --  1(1):[一灯]说: 这话怎讲？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1369,0,1);   --  1(1):[WWW]说: 这事是这样子的．．．．．*如此如此．．．．*这般这般．．．．*所以瑛姑和老顽童两人算是*破镜重圆了，前辈也就不用*自责了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1370,65,0);   --  1(1):[一灯]说: 善哉！善哉！*阁下真是功德一件．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,431,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,-2,-2,-1,-1,430,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
--end

