--function oldevent_292()
    instruct_1(998,86,0);   --  1(1):[???]说: 这里是四川青城派，*闲杂人等不得进入．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1064,0,1);   --  1(1):[WWW]说: 在下久仰四川青城松风观，*余观主及手下四大弟子之名*声已久，今特地前来拜访．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1065,86,0);   --  1(1):[???]说: 是吗？算你还有点见识．*我就是”青城四秀”中的*侯人英．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1066,0,1);   --  1(1):[WWW]说: ”英雄豪杰，青城四秀”*今日得见侯兄，实是小弟三*生之幸．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1067,86,0);   --  1(1):[???]说: 本派近日有大事要办，*家师也不见客，*你参观参观就走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1068,0,1);   --  1(1):[WWW]说: 是，是，是．
    instruct_0();   --  0(0)::空语句(清屏)
--end

