--function oldevent_143()
    instruct_1(550,6,0);   --  1(1):[灭绝]说: 你是何人，到我峨嵋派做什*麽？是想随我六大派一起进*剿光明顶的侠义之士？*还是魔教派来的奸细，想打*探我六大派的动静．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(551,0,1);   --  1(1):[WWW]说: 师太快别误会了，我并不是*您口中什麽”魔教”奸细，*所以还请放心．*虽然我自命为侠义之士，但*是我并不想随你们去打那个*”魔教”．*因为我觉得战争这种东西能*避免就避免，像在我的国家*中，就因为战争这东西弄的*人心惶惶的，更何况你身为*一派掌门，应该为你的徒弟*着想．*要是我，可舍不得让这些美*貌的小尼姑去送命．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(552,6,0);   --  1(1):[灭绝]说: 大胆狂徒！念在你非魔教徒*的份子上，快快离去，免得*我後悔，动手要了你的命．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,144,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

