--function oldevent_293()
    instruct_1(998,86,0);   --  1(1):[???]说: 这里是四川青城派，*闲杂人等不得进入．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(999,0,1);   --  1(1):[WWW]说: 你们这些江湖的败类，*不但占地为王，*而且还血洗了福威镳局，*将人家总镳头给捉了来．*你们眼中还有王法吗．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1000,86,0);   --  1(1):[???]说: 让我们”青城四秀”来告*诉你什麽叫王法．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(49,3,0,0) ==false then    --  6(6):战斗[49]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,0,-2,-2,294,-1,-1,6044,6044,6044,-2,30,26);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,294,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,294,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,294,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1001,0,1);   --  1(1):[WWW]说: 江湖上人说什麽*”英雄豪杰，青城四秀”，*在我看来，*叫”狗熊野猪，青城四兽”*还差不多．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1002,86,0);   --  1(1):[???]说: 看我师父如何收拾你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(2);   --  37(25):增加道德2
    instruct_56(1);   --  56(38):提高声望值1
--end

