--function oldevent_705()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2605,73,0);   --  1(1):[南贤]说: 资质好坏并没有关系，只要*你肯用心练武，一样可以成*为大侠．*桃花岛的郭靖就是一例，虽*然资质不好，一样成为一代*大侠．*而且有时後很好用的功夫反*而要资质不好的人才练的成*呢．*例如老顽童周伯通有套武功*”左右互搏之术”，修练後*可连续攻击两次．*而修练这门功夫的条件就是*资质不能太好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,0,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

