--function oldevent_671()
    instruct_1(2448,85,0);   --  1(1):[???]说: 小六子，你知不知道附近有*什麽好玩的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2449,85,4);   --  1(1):[???]说: 三师兄，这次咱们来到这江*南，少不得要上那杭州西湖*玩一玩．古人不是说，上有*天堂，下有苏杭吗？更何况*江南的美女是出了名的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2450,85,0);   --  1(1):[???]说: 你要上西湖玩，我问你对那*边了解多少．你知道那里有*什麽武林同道吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2451,85,4);   --  1(1):[???]说: 小六子见闻浅薄，还请师兄*开导．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2452,85,0);   --  1(1):[???]说: 我告诉你，苏杭一带最有名*的便是姑苏慕容家了．*江湖上人谈的”南慕容，北*乔峰”，其中北乔峰指的是*丐帮帮主，而南慕容指的就*是姑苏慕容家的慕容复了．*你们应该听说过姑苏慕容家*的绝技吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2453,85,4);   --  1(1):[???]说: ”以彼之道，还施彼身”！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2454,85,0);   --  1(1):[???]说: 没错．*听说姑苏慕容家藏书丰富，*熟知天下武功，最擅长的就*是以对方最厉害的功夫去杀*害对方，令对手到死之前还*不能相信这个事实．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2455,85,4);   --  1(1):[???]说: 那我们还是别乱玩好了，否*则被他来个”泰山十八盘”*剑法就糗大了．
    instruct_0();   --  0(0)::空语句(清屏)
--end

