--function oldevent_686()

    if instruct_4(143,1,0) ==false then    --  4(4):是否使用物品[神杖]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(143,-1);   --  32(20):物品[神杖]+[-1]
    instruct_1(2898,72,0);   --  1(1):[孔八拉]说: 这．．．．*这．．这是”武林神杖”！*你．．．你成了武林盟主！*哈！哈！哈！*不愧是我霹雳堂的弟子．**你今天来是为了将神杖送给*我的是不是？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2899,0,1);   --  1(1):[WWW]说: 送你？*我可是费了千辛万苦才得到*这玩意的．*你秀逗啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2900,72,0);   --  1(1):[孔八拉]说: 怎麽？*你不想送我吗？*你留着它有什麽用．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2901,0,1);   --  1(1):[WWW]说: 怎麽没用．*这神杖可是关系到我将来的*的幸福．*我还得靠它找”圣堂”呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2902,72,0);   --  1(1):[孔八拉]说: ”圣堂”？*就是我这啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2903,0,1);   --  1(1):[WWW]说: 什麽！*这里就是”圣堂”？*你不是说叫霹雳堂吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2904,72,0);   --  1(1):[孔八拉]说: 我父亲做堂主时是叫圣堂．*但後来由我继承後就改成叫*”霹雳堂”了．*因为我觉得”霹雳堂”听起*来比较霸气．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2905,0,1);   --  1(1):[WWW]说: 那麽你知道要如何离开*”这里”吗？*我是说．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2906,72,0);   --  1(1):[孔八拉]说: 要离开还不简单，从正门走*出去即可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2907,0,1);   --  1(1):[WWW]说: 我说的”这里”不是真的指*这里．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2908,72,0);   --  1(1):[孔八拉]说: 你不是要从正门出去吗？*．．．*．．．*那还有另一个出口，*就在我们的脚底下．**不过．．．不过我父亲交待*我不能跟别人说．**但是．．．．*如果你愿意把武林神杖给我*的话．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2909,0,1);   --  1(1):[WWW]说: 这．．．这可是武林盟主的*的信物耶．本来我还想带回*去做纪念呢．*你该不会是骗我的吧！*．．．．．**＜可是看他一副神秘样子，*或许真能让我回去．＞**好吧！就给你吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2910,72,0);   --  1(1):[孔八拉]说: 哈！哈！*想我孔八拉多麽厉害，坐在*家中不出门，就能当上这人*人梦寐以求的”武林盟主”*从此之後，我号令天下，有*谁敢不从呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2911,0,1);   --  1(1):[WWW]说: 喂，你乐完了吧．*可以告诉我另一个出口在那*了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2912,72,0);   --  1(1):[孔八拉]说: 好，一句话．*”就在我们俩的脚底下”．**而这把是通往”圣堂”的钥*匙．*拿去吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(164,1);   --  2(2):得到物品[绿钥匙][1]
    instruct_3(-2,-2,-2,-2,687,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

