--function oldevent_568()
    instruct_1(2132,44,0);   --  1(1):[岳老三]说: 你这小子，挺有两下子的，*过的了我的万鳄潭，很好．**咦！我看你手长足长，脑骨*後秃，腰胁柔软，跟我非常*像，真是学武的奇才．*快磕头，求我收你为弟子．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2133,0,1);   --  1(1):[WWW]说: 有没有搞错，看你呆头呆脑*的，还要我拜你为师．*我看你拜我为师还差不多．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2134,44,0);   --  1(1):[岳老三]说: 你这小子，还真倔强．*好，你若打的过我，我岳老*二就拜你为师．*否则，你就拜我为师．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2135,0,1);   --  1(1):[WWW]说: 奇怪，我怎麽听人家说南海*鳄神叫”岳老三”呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2136,44,0);   --  1(1):[岳老三]说: 是”岳老二”！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(90,3,0,0) ==false then    --  6(6):战斗[90]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2137,44,0);   --  1(1):[岳老三]说: 你这小子，资质果真不错，*我没看错眼．*来，快拜我岳老二为师．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2138,0,1);   --  1(1):[WWW]说: 岳老三，你自己说过的话都*忘了吗？你说打输我要拜我*为师的，怎麽忘了呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2139,44,0);   --  1(1):[岳老三]说: 拜就拜，我岳老二向来说话*算话．*你是我师父了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,569,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_56(3);   --  56(38):提高声望值3
--end

