--function oldevent_487()
    instruct_1(1694,0,1);   --  1(1):[WWW]说: 古人说，上有天堂，下有苏*杭，西湖的景色果然怡人，*慕容公子住在这地方，又有*美人相陪，真是好福气呀．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1695,51,0);   --  1(1):[慕容复]说: 阁下是谁，到这燕子坞来所*为何事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1696,0,1);   --  1(1):[WWW]说: 在下之名不足挂齿，流浪江*湖只为回到未来，今日特来*请慕容公子指点迷津．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1697,51,0);   --  1(1):[慕容复]说: 阁下有话就直说吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1698,0,1);   --  1(1):[WWW]说: 江湖中盛传，姑苏慕容家中*藏书丰富，天下武林奇书尽*皆收录．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1699,51,0);   --  1(1):[慕容复]说: 原来是想看我慕容家丰富的*武功秘笈．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1700,0,1);   --  1(1):[WWW]说: 慕容公子误会了，在下要找*的，不是什麽武功秘笈，只*是几本小说而已．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1701,51,0);   --  1(1):[慕容复]说: 你是说．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1702,0,1);   --  1(1):[WWW]说: 世人皆以为”十四天书”是*什麽高深的武功秘笈，其实*据我所知不过是几本小说罢*了．*不知慕容家是否有收藏这些*书籍？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1703,51,0);   --  1(1):[慕容复]说: 对不起，燕子坞的藏书并没*有阁下想要的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1704,0,1);   --  1(1):[WWW]说: 哦！是这样子啊．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1705,51,0);   --  1(1):[慕容复]说: 不过．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1706,0,1);   --  1(1):[WWW]说: 不过什麽．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1707,51,0);   --  1(1):[慕容复]说: 不过其中一本书的下落，*我是知道的．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1708,0,1);   --  1(1):[WWW]说: 那一本书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1709,51,0);   --  1(1):[慕容复]说: ”天龙八部”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1710,0,1);   --  1(1):[WWW]说: 真的，在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1711,51,0);   --  1(1):[慕容复]说: 不知阁下可曾听过我慕容家*的绝技．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1712,0,1);   --  1(1):[WWW]说: 嗯，江湖中人提过，姑苏慕*容”以彼之道，还施彼身”
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1713,51,0);   --  1(1):[慕容复]说: 是啊，既然这样，你知道应*该怎麽做了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1714,0,1);   --  1(1):[WWW]说: 你是说．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1715,51,0);   --  1(1):[慕容复]说: 如果你帮我找到一些东西，*我就告诉你”天龙八部”的*下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1716,0,1);   --  1(1):[WWW]说: 吓死我了，我以为你要用我*擅长的武功来对付我．．．*要知道.我所会的武功很多*．．．恐怕你不是这麽容易*”以彼之道，还施彼身”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1717,51,0);   --  1(1):[慕容复]说: 阁下见笑了，
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1718,0,1);   --  1(1):[WWW]说: 不知公子要找什麽东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1719,51,0);   --  1(1):[慕容复]说: 大燕国的传国玉玺．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1720,0,1);   --  1(1):[WWW]说: 大燕国的传国玉玺？*慕容公子是古董收藏家吗？*干嘛要”大燕国”的玉玺？　*你又不是皇帝，要玉玺做啥*用！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1721,51,0);   --  1(1):[慕容复]说: 住口，我乃大燕慕容王孙．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1722,0,1);   --  1(1):[WWW]说: 失敬，失敬．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1723,109,0);   --  1(1):[???]说: 表哥，你怎麽还在想复国的*事情．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1724,51,0);   --  1(1):[慕容复]说: 历代祖宗遗训，怎可忘记．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1725,0,1);   --  1(1):[WWW]说: 这位姑娘，有如天仙，不知*芳名．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1726,51,0);   --  1(1):[慕容复]说: 这是我表妹王语嫣．她熟读*各派武功精华，虽本身不会*任何武功，但武学见识广．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1727,0,1);   --  1(1):[WWW]说: 王姑娘，你好．．．．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(53,34,0) ==false then    --  16(10):队伍是否有[段誉]是则跳转到:Label0
        instruct_1(1737,51,0);   --  1(1):[慕容复]说: 记得，你若想知道”天龙八*部”的下落，就快去找大燕*国的传国玉玺．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,-2,-2,489,493,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(-2,2,-2,-2,490,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        do return; end
    end    --:Label0

    instruct_1(1728,53,1);   --  1(1):[段誉]说: 神仙姊姊．．神仙姊姊．．*小生段誉想你想得好苦啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1729,109,0);   --  1(1):[???]说: 这．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1730,51,0);   --  1(1):[慕容复]说: 你这獃子干什麽，这样看着*我表妹．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1731,0,1);   --  1(1):[WWW]说: 慕容公子请息怒，我这段兄*弟是认错人了，*只是．．只是真的很像．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1732,51,0);   --  1(1):[慕容复]说: 像什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1733,0,1);   --  1(1):[WWW]说: 没有，我是说令表妹很像一*个人，一个我们在无量山中*发现的玉像，实在太像了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1734,53,1);   --  1(1):[段誉]说: 神仙姊姊．．．*你怎麽不跟我说话．．．*你跟我们走好不好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1735,109,0);   --  1(1):[???]说: 不行，我要跟着我表哥．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1736,0,1);   --  1(1):[WWW]说: 段兄，别无礼了．*慕容公子，我们告退了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1737,51,0);   --  1(1):[慕容复]说: 记得，你若想知道”天龙八*部”的下落，就快去找大燕*国的传国玉玺．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,489,493,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,2,-2,-2,490,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,0,-2,-2,-1,-1,491,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
--end

