--function oldevent_514()
    instruct_1(1852,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，施主请留步．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,1,1,515,-1,-1,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,1,1,-1,-1,-1,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,1,1,-1,-1,-1,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,1,1,-1,-1,-1,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1853,51,1);   --  1(1):[慕容复]说: 怎麽，方丈後悔了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1854,70,0);   --  1(1):[玄慈]说: 老衲想通了，既造业因，便*有业果．自己的名声固然重*要，但是我亏欠乔峰一家人*实在太多了，我不能再让你*去害他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1855,51,1);   --  1(1):[慕容复]说: 方丈这是做什麽，今天我去*揭发乔峰，是为武林除害．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1856,70,0);   --  1(1):[玄慈]说: 是吗？*依老衲看，是为了你大燕复*国的计画吧．*其实我早就该想到了，当初*就是你父亲慕容博施主，假*传音讯，说是契丹武士要大*举侵犯少林夺取武学典籍，*才会酿成大错．这一切，都*是你父亲要挑起汉辽武人相*斗，使你大燕从中取利．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1857,51,1);   --  1(1):[慕容复]说: ．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1858,70,0);   --  1(1):[玄慈]说: 快将信件留下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1859,51,1);   --  1(1):[慕容复]说: 方丈不怕我将你的事也揭露*出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1860,70,0);   --  1(1):[玄慈]说: 我个人事小，中原武林的和*谐才重要，我不能让你利用*此信，引起武林的大风暴．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1861,51,1);   --  1(1):[慕容复]说: 好，你别怪我．这事传出去*後，看你少林寺的脸往那里*摆．*一个堂堂的少林方丈和女人*乱来，还生下了一名私生子*．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1862,0,1);   --  1(1):[WWW]说: 有这等事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1863,70,0);   --  1(1):[玄慈]说: 阿弥陀佛！*老衲是犯了佛门大戒，待将*你们拿下，取回信件後，老*衲自会自我惩处．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1864,51,1);   --  1(1):[慕容复]说: 看来免不了一战了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(81,3,0,0) ==false then    --  6(6):战斗[81]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,12,-2,-2,578,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(51,14,-2,-2,527,531,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1874,51,1);   --  1(1):[慕容复]说: 没事了，我们走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(8);   --  56(38):提高声望值8
--end

