--function oldevent_607()
    instruct_1(2247,97,0);   --  1(1):[???]说: 那里来的小子，敢擅闯我神*龙岛．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2248,0,1);   --  1(1):[WWW]说: 神龙岛？*听起来好像颇棘手的，我还*是下回有把握点再来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2249,97,0);   --  1(1):[???]说: 想走，我神龙岛可不是你说*来就来，说走就走的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2250,0,1);   --  1(1):[WWW]说: 别这样嘛！*我船随便开开，就开到你们*岛上了．*本想看看你们这边有没有我*要找的书，但．．我看大概*没有．．．打扰了．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2251,97,0);   --  1(1):[???]说: 果然是来偷书的．*来人呀！快将他拿下．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(94,3,0,0) ==false then    --  6(6):战斗[94]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2252,0,1);   --  1(1):[WWW]说: 踏破铁鞋无觅处，得来全不*费功夫．这里或许有我要找*的书，进去找他们老大要．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(1);   --  56(38):提高声望值1
--end

