--function oldevent_253()

    if instruct_4(179,1,0) ==false then    --  4(4):是否使用物品[张旭率意帖]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(820,32,0);   --  1(1):[秃笔翁]说: 这．．．这是真迹！*真是．．．真是唐朝．．．*唐朝张旭的”率意帖”．．*假不了，假不了的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(821,0,1);   --  1(1):[WWW]说: 三庄主果然是行家．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(822,32,0);   --  1(1):[秃笔翁]说: 少侠，可否再借老夫一看？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(823,0,1);   --  1(1):[WWW]说: 秃老头，要看可以，*先打赢我再说．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(824,32,0);   --  1(1):[秃笔翁]说: 说什麽？*我最痛恨人家叫我秃子，*你这小子太不知死活了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(825,0,1);   --  1(1):[WWW]说: 秃头，秃头下雨不愁，*人家有伞，我有秃头．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(826,32,0);   --  1(1):[秃笔翁]说: 好小子，*我瞧你是活得不耐烦了，*看看老夫怎麽收拾你．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(44,3,0,0) ==false then    --  6(6):战斗[44]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(827,32,0);   --  1(1):[秃笔翁]说: 小伙子，果然有两下子，*可是那”率意帖”我是要定*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(828,0,1);   --  1(1):[WWW]说: 三庄主，别自不量力了．*我看这梅庄之中也没什麽能*手了，真是害我白走一趟．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(829,32,0);   --  1(1):[秃笔翁]说: 臭小子！别这麽嚣张！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(830,0,1);   --  1(1):[WWW]说: 这样好了，贵庄中只要有人*能够胜得了我，连同先前那*幅”谿山行旅图”和这”率*意帖”一并送上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(831,32,0);   --  1(1):[秃笔翁]说: 小子，此话当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(832,0,1);   --  1(1):[WWW]说: 小爷我从来不说假话．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(833,32,0);   --  1(1):[秃笔翁]说: 好！*四弟，咱们去求二哥帮忙．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,-1,-1,-1,2908,2908,2908,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_17(-2,1,21,34,0);   --  17(11):修改场景贴图:当前场景层1坐标15-22
    instruct_3(-2,10,1,1,254,-1,-1,6054,6054,6054,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,1,1,254,-1,-1,6050,6050,6050,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(2);   --  56(38):提高声望值2
--end

