--function oldevent_166()
    instruct_25(32,33,32,24);   --  25(19):场景移动32-33--32-24
    instruct_1(546,6,0);   --  1(1):[灭绝]说: ．．．．魔教以火为圣，*尊火为神．．．．． ．**魔教自从第三十三代教主阳*顶天突然死去，不及指定继*承之人．*教中左右光明使者，四大护*教法王，五散人，谁都觊觎*这教主之位．*於是自相残杀争夺，魔教从*此中衰．**这也正是六大门派合当兴旺　*，妖邪数该覆灭的时候了．**倘若魔教不起内哄，要想挑*了这批妖孽，倒也是大大的*不易呢．*六大派这次进剿光明顶，*志在必胜，众妖邪即便是齐*心合力，咱们又有何惧？*只是相斗时损伤必多，各人*须得先心存决死之心，不可*意图侥幸，心有畏惧，*临敌时堕了峨嵋派的威风．***俗语说的好”千棺从门出，*其家好兴旺．子存父先死，*孙在祖乃丧．”*人孰无死？只须留下子孙血*脉，其家便是死了千百人，*仍能兴旺．*最怕的是你们都死了，老尼*我却孤伶伶的活着．**嘿嘿，但纵是如此，亦不足*惜．百年之前，世上又有什*麽峨嵋派．*只须大夥儿轰轰烈烈的死战*一场，峨嵋派纵一举覆灭，*又岂足道哉？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(547,77,0);   --  1(1):[???]说: 弟子誓决死战，*与妖魔邪道势不两立．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(548,6,0);   --  1(1):[灭绝]说: 无耻小徒，你偷听够了没！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(32,24,32,33);   --  25(19):场景移动32-24--32-33
    instruct_1(549,0,1);   --  1(1):[WWW]说: ＜自己话这麽多，*我也不想听呀！＞**晚辈实在是失礼之至，无意*间听到师太如此凛然大义的*训辞，忍不住就听了下去．*晚辈这就拜见峨嵋掌门．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,11,-2,-2,-1,-1,147,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
--end

