--function oldevent_573()

    if instruct_4(131,1,0) ==false then    --  4(4):是否使用物品[大燕皇帝世系图表]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_37(2);   --  37(25):增加道德2
    instruct_32(131,-1);   --  32(20):物品[大燕皇帝世系图表]+[-1]
    instruct_1(1761,51,0);   --  1(1):[慕容复]说: 哈哈，有了大燕皇帝世系谱*表及传国玉玺，我就可号召*大燕後代，实行复国计划．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1762,0,1);   --  1(1):[WWW]说: 慕容公子此次不会再失信了*吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1763,51,0);   --  1(1):[慕容复]说: 我慕容复何时曾失信过人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1764,0,1);   --  1(1):[WWW]说: ＜贵人多忘事＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1765,51,0);   --  1(1):[慕容复]说: ”天龙八部”一书的下落是*在．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1766,0,1);   --  1(1):[WWW]说: 在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1767,51,0);   --  1(1):[慕容复]说: 在乔峰的手里．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1768,0,1);   --  1(1):[WWW]说: 你是说丐帮帮主乔峰．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1769,51,0);   --  1(1):[慕容复]说: 正是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1770,0,1);   --  1(1):[WWW]说: 你该不会是随便说说的吧．*人家称你们为”南慕容，北*乔峰”，你就说书在他那．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1771,109,0);   --  1(1):[???]说: 我表哥没有说谎，此书的确*是流落在他的手中．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1772,0,1);   --  1(1):[WWW]说: 王姑娘说的话就可以信了．*好，我就上丐帮要书去了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1773,51,0);   --  1(1):[慕容复]说: 不对，不对，阁下应该先上*少林才对．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1774,0,1);   --  1(1):[WWW]说: 此话怎讲？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1775,51,0);   --  1(1):[慕容复]说: 你想想看，你打得过那乔峰*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1776,0,1);   --  1(1):[WWW]说: 打不过也得打，*不然怎麽办？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1777,51,0);   --  1(1):[慕容复]说: 我有办法让乔峰乖乖的将书*交出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1778,0,1);   --  1(1):[WWW]说: 他为什麽会乖乖交出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1779,51,0);   --  1(1):[慕容复]说: 因为我知道他一个极大的秘*密，一个足以让他身败名裂*的秘密．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1780,0,1);   --  1(1):[WWW]说: 那为什麽要先到少林？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1781,51,0);   --  1(1):[慕容复]说: 因为得先到少林寺拿一样东*西．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1782,0,1);   --  1(1):[WWW]说: 一样东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1783,51,0);   --  1(1):[慕容复]说: 是的，一样能让武林天翻地*覆的东西．*总之，你若和我一同前往，*我可以让你轻易获得该书．*否则，你自己一个人有自信*打败乔峰吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1784,0,1);   --  1(1):[WWW]说: 你为什麽要帮我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1785,51,0);   --  1(1):[慕容复]说: 没什麽，鱼帮水，水帮鱼．*我慕容氏人丁单薄，势力微*弱，想要重建邦国，谈何容*易？唯一的机会便是天下大*乱，武林动荡不安．而你也*可从中得到你要的东西．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1786,109,0);   --  1(1):[???]说: 表哥，你不要想复国想到疯*了，弄得天下大乱．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1787,51,0);   --  1(1):[慕容复]说: 住嘴！你以为我这慕容复的*”复”字是为何取的，我慕*容家族世世代代奔波一生，*所为何事？***怎样，你要不要和我合作？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,5,-2,-2,497,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,-2,-2,-2,494,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,2,-2,-2,495,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(51,14,-2,-2,527,531,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [14]

    if instruct_9(11,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label1
        instruct_1(1789,0,1);   --  1(1):[WWW]说: 慕容公子的”好”意，在下*心领了．在下对自己的武功*还有一点自信，我宁愿光明*正大的与乔大侠打斗，也不*愿用卑鄙的方法去得到那本*”天龙八部”．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1790,51,0);   --  1(1):[慕容复]说: 你再考虑清楚．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(1788,0,1);   --  1(1):[WWW]说: 好，我就和你上少林，揭发*乔峰的秘密．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,51,0);   --  1(1):[慕容复]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,2,-2,-2,495,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(51);   --  10(A):加入人物[慕容复]
--end

