--function oldevent_1016()
    instruct_1(2943,0,1);   --  1(1):[WWW]说: 咦！你们四人怎麽会在这？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2944,73,0);   --  1(1):[南贤]说: 少年人，恭喜你．***历经千辛万苦，你总算走到*这了．*证明你的修行有了结果．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2945,74,0);   --  1(1):[北丑]说: 年轻人，我给你的提示还有*用吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2946,75,0);   --  1(1):[???]说: 怎麽，还想吃我林厨子做的*菜吗？**还是想赶紧回到家里吃妈妈*亲手烧的菜呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2947,72,0);   --  1(1):[孔八拉]说: 我孔八拉真的服了你．*连十大高手联手都不是你的*对手．*真有你的．*这”武林神杖”还你，你拥*有它才是实至名归．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2948,0,1);   --  1(1):[WWW]说: 你们四人是．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2949,74,0);   --  1(1):[北丑]说: 你不觉得我们四人非常奇怪*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2950,0,1);   --  1(1):[WWW]说: 是有这麽一点．．．*尤其是．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2951,72,0);   --  1(1):[孔八拉]说: 尤其是我孔八拉吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2952,0,1);   --  1(1):[WWW]说: 没错，怪不伦不类的．***你们究竟是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2953,75,0);   --  1(1):[???]说: 我们是”群侠”之外的人．*也就是说，是这游戏世界外*的人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2954,72,0);   --  1(1):[孔八拉]说: 其实我们有个外号叫做*”游戏界的四大天王”．**而我们的总头目就是你家里*面的”软体娃娃”．*这样说你了解了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2955,0,1);   --  1(1):[WWW]说: 哦！原来你们是．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2956,73,0);   --  1(1):[南贤]说: 好了，*不担误你宝贵的时间了．*再往下走就是游戏尽头了．*我们几人是奉总头目之命前*来为你送行的，并且转告几*句话给你．*希望这个游戏能让你玩的高*兴，快乐．享受到一个玩者*该有的欢乐．*但如果没有的话，也希望你*能来信给我们指教，指出我*们没有注意到的地方．*这样我们下次才能改进，以*达到你的要求．**另外，本游戏的”外传”也*正在制作中，希望短期内能*与你们见面，到时搞不好你*又是”最幸运”的消费者．***不过这还得靠你们多多支持*才是，请来信赐教及鼓励．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,35,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,36,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,37,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,38,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2957,0,1);   --  1(1):[WWW]说: 这会真的都没人了，*那我可要回家了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(143,1);   --  2(2):得到物品[神杖][1]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
--end

