--function oldevent_104()
    instruct_1(408,0,1);   --  1(1):[WWW]说: 王前辈，你还好吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(409,17,0);   --  1(1):[王难姑]说: 你是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(410,0,1);   --  1(1):[WWW]说: 在下是受胡前辈所托，*前来救你的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(411,17,0);   --  1(1):[王难姑]说: 真的？那金花婆婆呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(412,0,1);   --  1(1):[WWW]说: 前辈放心，*那老太婆已被我打败，*暂时不会为难你了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(413,17,0);   --  1(1):[王难姑]说: 谢谢少侠相助，*我夫妇俩不会忘记你的恩情*．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(414,0,1);   --  1(1):[WWW]说: 那里，那里，*路见不平，拔刀相助，*本是我辈中人该做的事．*现在此事已了，*我还有其他的事要办，*前辈可先离去了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(415,17,0);   --  1(1):[王难姑]说: 好，那我先回蝴蝶谷了，*待少侠有空时，*一定要到我蝴蝶谷中作客．*你一定要来哦！*我和外子一定要送你些东西*来报答你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(416,0,1);   --  1(1):[WWW]说: 前辈慢走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(44,1,1,1,123,-1,-1,5290,5290,5290,-2,-2,-2);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [1]
    instruct_3(44,0,-2,-2,95,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [0]
    instruct_14();   --  14(E):场景变黑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(3);   --  37(25):增加道德3
--end

