--function oldevent_192()
    instruct_1(659,0,1);   --  1(1):[WWW]说: 请问这里是华山吗？*”华山论剑”是在这里吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(660,81,0);   --  1(1):[???]说: 不错，承蒙江湖同道看的起*我华山派，四年举办一次的*”华山论剑”正是由我华山*派主办，只不过不是在这，*而是在另一座山头．这里是*我华山派练功修行的地方．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(35,0,15) ==true then    --  16(10):队伍是否有[令狐冲]否则跳转到:Label0
        instruct_1(661,35,1);   --  1(1):[令狐冲]说: 各位近来好吧？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(662,81,0);   --  1(1):[???]说: 大师哥．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(663,35,1);   --  1(1):[令狐冲]说: 别叫我大师哥了，我现在不*是华山派的人了，我随这位*小兄弟浪迹天涯．
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(664,0,1);   --  1(1):[WWW]说: 久闻贵派掌门”君子剑”岳*先生为人正直，道德崇高，*不知在下能否有幸拜见？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(665,81,0);   --  1(1):[???]说: 我师父就在里面，少侠请．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,2,-2,-2,193,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,194,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,211,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,193,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,194,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
--end

