--function oldevent_662()
    instruct_1(2427,93,0);   --  1(1):[???]说: 鲁兄，我听人家说，东北雪*地中住着一个戏子，平常疯*言疯语的，但却知道很多江*湖中的秘密，有空我们也去*拜访拜访他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2428,93,4);   --  1(1):[???]说: 别去受骗了．*你们知不知道，我就上过他*一次当．*上回他跟我讲一个秘密山洞*的地点，说洞中藏有很多宝*物．结果我奔波了大半天，*照他的地点去找，根本就没*有他所说的洞穴，更别谈什*麽鸟宝藏了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2429,93,0);   --  1(1):[???]说: 可是为什麽江湖中人还盛传*着北丑无所不知的讲法？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2430,93,4);   --  1(1):[???]说: 谁晓得．*反正我是不会再上当了．
    instruct_0();   --  0(0)::空语句(清屏)
--end

