--function oldevent_722()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2622,73,0);   --  1(1):[南贤]说: 自来修习内功，不论是为了*强身治病，还是为了做为上*乘武功的根基，必当水火互*济，阴阳相配．*比如说练了”足少阴肾经”*便当练”足少阳胆经”，*少阴少阳融会调合，体力便*逐步增强．**若阴阳不调而相冲相克，终*将走火入魔，死於非命．**相传六合丁氏祖传秘方所配*制的”玄冰碧火酒”具阴阳*调合之功，可治疗因练功不　*慎而导致阴阳不调之习武之*人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,0,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

