--function oldevent_239()
    instruct_1(786,0,1);   --  1(1):[WWW]说: 小二哥，请问那里才有极品*的佳酿美酒？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(787,106,0);   --  1(1):[???]说: 我曾听说杭州多佳酿，*梅庄之美酒更是首屈一指．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_17(55,1,29,46,2050);   --  17(11):修改场景贴图:场景[梅庄]层1坐标1D-2E
    instruct_17(55,1,31,46,2054);   --  17(11):修改场景贴图:场景[梅庄]层1坐标1F-2E
    instruct_17(55,1,29,47,2048);   --  17(11):修改场景贴图:场景[梅庄]层1坐标1D-2F
    instruct_17(55,1,31,47,2052);   --  17(11):修改场景贴图:场景[梅庄]层1坐标1F-2F
    instruct_17(55,1,30,47,0);   --  17(11):修改场景贴图:场景[梅庄]层1坐标1E-2F
--end

