--function oldevent_232()
    instruct_1(768,0,1);   --  1(1):[WWW]说: 好啊，你们居然在这里计划*要杀人，亏你们还是同盟的*帮派．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(769,84,0);   --  1(1):[???]说: 小子，偷听了我们的计划，*只好杀了你灭口．*怪不得我们了．上！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(42,3,0,0) ==false then    --  6(6):战斗[42]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,14,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_26(27,0,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_37(3);   --  37(25):增加道德3
    instruct_56(1);   --  56(38):提高声望值1
--end

