--function oldevent_440()
    instruct_1(1504,0,1);   --  1(1):[WWW]说: 龙姑娘，你们古墓派还真是*奇特，长年住在这古墓中，*怪恐怖的．*这古墓是谁造的啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1505,59,0);   --  1(1):[小龙女]说: 这古墓是全真教的祖师爷王*重阳建的，又称活死人墓．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1506,0,1);   --  1(1):[WWW]说: 全真教的，怎麽不是古墓派*的人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1507,59,0);   --  1(1):[小龙女]说: 因为王重阳打不过我师祖林*朝英，所以就将这古墓让了*出来．*从此以後，我古墓派就在此*住了下来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1508,0,1);   --  1(1):[WWW]说: 原来还有这些典故．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1509,59,0);   --  1(1):[小龙女]说: 少侠近来如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,441,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号

    if instruct_9(16,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(1515,0,1);   --  1(1):[WWW]说: 一切还好，你们还好吧？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1516,59,0);   --  1(1):[小龙女]说: 嗯．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1517,0,1);   --  1(1):[WWW]说: 你们俩真是令人羡慕的神仙*侠侣．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1510,0,1);   --  1(1):[WWW]说: 近日旅途有些不顺，此次前*来是想请龙姑娘加入，助我*一臂之力．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1511,59,0);   --  1(1):[小龙女]说: 好啊，我夫妇俩受你这麽大*的恩惠，理应帮忙你一些．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1512,0,1);   --  1(1):[WWW]说: 真是不好意思，打扰了你跟*杨兄的清静．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1513,59,0);   --  1(1):[小龙女]说: 没有关系，等解决了你的问*题後，再回来古墓就好了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1514,0,1);   --  1(1):[WWW]说: 谢谢你的帮忙．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,59,0);   --  1(1):[小龙女]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(59);   --  10(A):加入人物[小龙女]
--end

