--function oldevent_640()

    if instruct_29(0,75,1000,11,0) ==false then    --  29(1D):判断WWW武力75-1000是则跳转到:Label0
        instruct_27(-1,7864,7912);   --  27(1B):显示动画
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2703,0,1);   --  1(1):[WWW]说: 哇塞！我使尽了吃奶的力气*还拔不出来，难道要请亚瑟*王来才行吗？
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_3(-2,-2,1,1,-1,-1,-1,4736,4736,4736,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_27(-1,7864,7912);   --  27(1B):显示动画
    instruct_27(-1,7864,7964);   --  27(1B):显示动画
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2705,0,1);   --  1(1):[WWW]说: 终於让我给拔出来了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(110,1);   --  2(2):得到物品[金蛇剑][1]
--end

