--function oldevent_394()
    instruct_1(1262,0,1);   --  1(1):[WWW]说: 这位兄台，不知洞中那头大*鵰是你驯养．．．**咦！你的手臂？*莫非是那头大鵰所．．．**唉！我刚还救了牠，早知就*该让牠被巨蟒咬死算了．　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1263,58,0);   --  1(1):[杨过]说: 巨蟒？你说你救了鵰兄，*杨过在此谢过．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1264,0,1);   --  1(1):[WWW]说: 你的伤不是那鵰所为？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1265,58,0);   --  1(1):[杨过]说: 不是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1266,0,1);   --  1(1):[WWW]说: 但你看起来像是最近才受伤*的，不知杨兄有何困难，是*否要在下相助？　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1267,58,0);   --  1(1):[杨过]说: 这伤？唉！不提也罢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1268,0,1);   --  1(1):[WWW]说: 莫非是女人所为？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1269,58,0);   --  1(1):[杨过]说: 阁下怎会知道？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1270,0,1);   --  1(1):[WWW]说: 我是随便猜猜的，因为自古*以来，只有贱女人才会变态*到砍人手臂．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1271,58,0);   --  1(1):[杨过]说: 唉！我们不谈这些了．*不知少侠为何会到此地？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1272,0,1);   --  1(1):[WWW]说: 老实说我是在找一些东西，*找东西当然是要往隐密的*地方去找．*找着找着就到了这山谷．*一进洞後，便看到大鵰与巨*蟒正在缠斗．*那只大鵰是杨兄饲养的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1273,58,0);   --  1(1):[杨过]说: 不是的．*其实我也是无意中来到这山*谷，才发现鵰兄的．後来相*处了一段时间，我们就成了*好朋友．**据我在洞中所见，这鵰应是*一位名为独孤求败的前辈所*养的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1274,0,1);   --  1(1):[WWW]说: 独孤求败？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1275,58,0);   --  1(1):[杨过]说: 是的，这位前辈号称自己为*”剑魔独孤求败”．在他遗*留下的字迹中这样子写到：*”纵横江湖三十余载，杀尽*仇寇，败尽英雄，天下更无*抗手，无可奈何，惟隐居深*谷，以鵰为友．*呜呼，生平求一敌手而不可*得，诚寂寥难堪也．”*这位前辈只因世上无敌，只*得在深山隐居，其武功之深*湛，真不知到了何等地步．*此人号称”剑魔”，自是运*剑若神，名字叫”求败”，*想是走遍天下欲寻一胜己之*人，始终未能如愿，终於在*此处郁郁以没．**每每缅怀到此前辈的风采，*就不禁．．咳．咳．．不禁*令人向往．．咳 ．咳．．．*一兴起话就说太多了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1276,0,1);   --  1(1):[WWW]说: 杨兄身上似乎有伤？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1277,58,0);   --  1(1):[杨过]说: 不瞒少侠，*杨某身中”情花”之毒，恐*怕活不了多久了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1278,0,1);   --  1(1):[WWW]说: 杨兄这什麽话，兄弟我帮你*去找个名医来看看，天下那*有治不好的病．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1279,58,0);   --  1(1):[杨过]说: 不劳少侠费心了，这情花乃*是绝情谷独有之物，而其毒*性也只有”绝情丹”能解．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1280,0,1);   --  1(1):[WWW]说: 那我替兄台去一趟绝情谷，*找这绝情丹好了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1281,58,0);   --  1(1):[杨过]说: 现在绝情谷想必已空无一人*了,最後的一颗绝情丹也被*我丢下绝情谷底．．．．*如此如此．．．．*这般这般．．．．**龙儿随南海神尼而去，也不*知过得如何．．．*啊！．．我．．我好想她．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1282,0,1);   --  1(1):[WWW]说: 原来事情的经过是这样，我*看还是请杨兄先暂时扼抑情*慾，以免牵动情花之毒．*我还是到处去寻访名医，看*看有没有别的方法医治这情*花之毒．*否则十六年後，龙姑娘病癒*归来，却见不着杨兄了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1283,58,0);   --  1(1):[杨过]说: 要不是杨某身染重毒，否则*就随少侠一走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1284,0,1);   --  1(1):[WWW]说: 看我得先上绝情谷走一趟，*看这”情花”到底长得什麽*模样．*或许在谷中有收获也说不定*呢．**常听人说毒蛇出没之处，七*步之内必有解毒之药．*　　　　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1285,58,0);   --  1(1):[杨过]说: 那少侠可得小心，别被那情*花刺到，否则．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1286,0,1);   --  1(1):[WWW]说: 否则这世上就多了个跟杨兄*”同病相怜”的人．*我这就去了，请杨兄保重．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1287,58,0);   --  1(1):[杨过]说: 对了，那绝情谷地处偏僻，*你必须乘船顺着黄河而上，*才到得了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,395,396,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,7,-2,-2,-1,-1,398,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,-1,-1,398,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,-1,-1,398,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_8(3);   --  8(8):切换大地图音乐
--end

