--function oldevent_284()

    if instruct_16(35,6,0) ==false then    --  16(10):队伍是否有[令狐冲]是则跳转到:Label0
        instruct_1(819,30,0);   --  1(1):[风清扬]说: ．．．．．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(941,35,1);   --  1(1):[令狐冲]说: 不知前辈是谁，怎会出现在*我华山思过崖上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(942,30,0);   --  1(1):[风清扬]说: 华山之人，*当然出现在华山．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(943,35,1);   --  1(1):[令狐冲]说: 前辈是我华山派的人？*我怎麽不认识你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(944,30,0);   --  1(1):[风清扬]说: 只怕世上的人早已忘记风某*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(945,35,1);   --  1(1):[令狐冲]说: 风．．难道是．．．***我曾听师父提过，说到本派*中的前辈时，有一位风清扬*风太师叔．莫非就是前辈？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(946,30,0);   --  1(1):[风清扬]说: 风清扬三个字算什麽，*我冒充他有何好处．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(947,35,1);   --  1(1):[令狐冲]说: 徒孙令狐冲有幸，得能拜见*本门前辈风太师叔，实是万*千之喜．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(948,30,0);   --  1(1):[风清扬]说: 你使几手剑法来着，让我看*看现在华山派弟子的功夫如*何．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(949,35,1);   --  1(1):[令狐冲]说: 徒儿遵命．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,1,1,-1,-1,-1,7624,7624,7624,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(3,7624,7654);   --  27(1B):显示动画
    instruct_27(3,7624,7654);   --  27(1B):显示动画
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,1,1,-1,-1,-1,7656,7656,7656,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(950,30,0);   --  1(1):[风清扬]说: 岳不群那小子，当真是狗屁*不通．**你本是块大好的材料，却给*他教得变成蠢牛木马．*招数是死的，发招之人却是*活的．死招数破的再妙，遇*上了活招数，免不了缚手缚*脚，只有任人屠戮．*这个”活”字，你要牢牢记*住了．学招时要活学，使招*时要活使．*倘若拘泥不化，便熟练了几*千万手绝招，遇上了真正高*手，终究还是给人家破的乾*乾净净．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(951,35,1);   --  1(1):[令狐冲]说: 是，是！须得活学活使．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(952,30,0);   --  1(1):[风清扬]说: 五岳剑派中各有无数蠢才，*以为将师父传下来的剑招学*的精熟，自然便成高手．*哼哼，熟读唐诗三百首，不*会作诗也会吟！**熟读了人家诗句，做几首打*油诗是可以的，但若不能自*出机抒，能成大诗人吗？*活学活使，只是第一步．要*做到出手无招，那才是踏入*了高手的境界．*剑招使得再浑成，只要有迹*可寻，敌人便有隙可乘．**但假如你根本并无招式，敌*人如何来破你的招式．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(953,35,1);   --  1(1):[令狐冲]说: 根本无招，如何可破？*根本无招，如何可破？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(954,30,0);   --  1(1):[风清扬]说: 你这小子心思活泼，很对我*的脾胃．今日你我有缘，我*就将一套剑法传你．*只不知你资质是否足够，就*看你自己的造化．**这剑法名为”独孤九剑”，*是独孤求败前辈所创．**全剑共分九式，*自”总诀式”，”破剑式”*”破刀式”以至”破枪式”*”破鞭式”，”破索式”，*”破掌式”，”破箭式”*而到”破气式”．．．．．*．．．．．．．．．．．．*这”料敌机先”四个字，*正是这剑法的精要所在．．*任何人一招之出，必定有若*干徵兆．他下一刀要砍向你*的左臂，眼光定会瞧上你的*左臂，如果这时他的单刀正*在右下方，自然会提起刀，*划个半圆，自上而下的斜向*下砍．．．．．．．．．．*．．．．．．．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(955,35,1);   --  1(1):[令狐冲]说: 独孤九剑，有进无退！*招招都是进攻，攻敌之不守*．．．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(956,35,1);   --  1(1):[令狐冲]说: 独孤九剑，真是精妙绝伦．*徒孙倘能在二十年之中，*通解独孤老前辈当年创制这*九剑的遗意，那是大喜过望*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(957,30,0);   --  1(1):[风清扬]说: 你倒也不必妄自菲薄，独孤*大侠是绝顶聪明之人，学他*的剑法，要旨在一个”悟”*字，绝不能死记硬记．***等到通晓了这九剑的剑意，*则无所施而不可，便是将全*部的变化尽数忘记，也不相*干，临敌之际，更是忘记的*越乾净澈底，越不受原来剑*法的拘束．*以後自己好好用功，我可要*去了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(958,35,1);   --  1(1):[令狐冲]说: 太师叔，*你．．．你到那里去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(959,30,0);   --  1(1):[风清扬]说: 冲儿，我暮年得见你这样一*个佳子弟传我剑法，实是大*畅老怀．*哈哈！哈哈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(960,0,1);   --  1(1):[WWW]说: 恭喜令狐兄学会这精妙的剑*法．*我们这就走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(79,1);   --  2(2):得到物品[独孤九剑][1]
    instruct_33(35,61,0);   --  33(21):令狐冲学会武功独孤九剑
    instruct_34(35,10);   --  34(22):令狐冲增加资质10
    instruct_47(35,5);   --  47(2F):令狐冲增加攻击力5
    instruct_34(0,5);   --  34(22):WWW增加资质5
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

