--function oldevent_560()

    if instruct_4(37,1,0) ==false then    --  4(4):是否使用物品[千年冰蚕]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(37,-1);   --  32(20):物品[千年冰蚕]+[-1]
    instruct_1(2122,47,0);   --  1(1):[阿紫]说: 小子，你捉到这冰蚕了．*好，有了牠，我这毒掌威力*就更大了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,3,-2,-2,561,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,562,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
--end

