--function oldevent_126()
    instruct_1(485,0,1);   --  1(1):[WWW]说: 前辈是崆峒派掌门吧．***晚辈云游江湖，听闻崆峒派*七伤拳神乎奇技，不知是否*有荣幸见识见识．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(486,8,0);   --  1(1):[唐文亮]说: 小兄弟，还算有点见识，*知道我七伤拳的奥妙．**要知我七伤拳中拳力刚中有*柔，柔中有刚，七般拳劲各*不相同，*吞吐闪烁，变化百端，敌手*委实难防难挡．．．*小兄弟还是别见识的好．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(9,75,0) ==false then    --  16(10):队伍是否有[张无忌]是则跳转到:Label0

        if instruct_5(15,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label1
            instruct_3(-2,-2,-2,-2,127,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            do return; end
        end    --:Label1

        instruct_1(487,0,1);   --  1(1):[WWW]说: 该不会是掌门您七伤拳练的*火侯不够，*才不敢拿出来见人吧？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(488,8,0);   --  1(1):[唐文亮]说: 小子，你自寻死路．
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(16,3,0,0) ==false then    --  6(6):战斗[16]是则跳转到:Label2
            instruct_15(83);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label2

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(489,0,1);   --  1(1):[WWW]说: 我说你火侯不够还不相信，*再多练个几年吧．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(490,8,0);   --  1(1):[唐文亮]说: 哼！小兄弟留下个字号，*他日我唐文亮再向你请教．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(491,0,1);   --  1(1):[WWW]说: 字号？好吧，记着，*”软世派河洛分舵”*金庸堂堂主是也．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(492,8,0);   --  1(1):[唐文亮]说: ”软世派河洛分舵”？*没听过．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,-2,-2,128,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_56(3);   --  56(38):提高声望值3
        do return; end
    end    --:Label0

    instruct_1(493,9,1);   --  1(1):[张无忌]说: 大哥，我听我义父说过，*这七伤拳若是内力修为不足*之人练之，练之反而有害．*我看这崆峒掌门显然已受了*内伤，七伤拳想必修练的也*不怎麽样，不看也罢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(494,8,0);   --  1(1):[唐文亮]说: 不知这位兄弟的义父是谁，*竟能对我崆峒派的绝技有高*明意见．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(495,0,1);   --  1(1):[WWW]说: 他义父是金毛狮王谢．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(496,8,0);   --  1(1):[唐文亮]说: 魔教的谢逊在那里？*你是他的义子，*先拿下再说．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(497,0,1);   --  1(1):[WWW]说: 完了，说溜了嘴．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(498,9,1);   --  1(1):[张无忌]说: 大哥，打就打吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(16,3,0,0) ==false then    --  6(6):战斗[16]是则跳转到:Label3
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(499,0,1);   --  1(1):[WWW]说: 贤弟，果真不怎麽样．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(500,8,0);   --  1(1):[唐文亮]说: 哼！你们现在不杀我，*到时我六大派联手，*非把你魔教剿灭不可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,128,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_56(3);   --  56(38):提高声望值3
--end

