--function oldevent_507()
    instruct_1(1816,0,1);   --  1(1):[WWW]说: 请问这位师父，*这里就是少林寺吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1817,96,0);   --  1(1):[???]说: 正是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1818,0,1);   --  1(1):[WWW]说: 少林寺耶！*武学的殿堂，武侠小说中绝*对少不了的场景，赶紧进去*看一看．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1829,96,0);   --  1(1):[???]说: 方丈率寺中弟子，与其余五*大派共同围攻光明顶去了，*至今未回．*请施主下山．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,3,-2,-2,521,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,521,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,521,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,521,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
--end

