--function oldevent_81()
    instruct_1(287,12,0);   --  1(1):[殷天正]说: 还是你这只蝙蝠飞的快，*比我这老鹰先一步到达．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(288,14,0);   --  1(1):[韦一笑]说: 那里，那里，鹰王承让了．***六大派似乎已经攻进去了，*这小子大概是後援的人手，*我们先将他拿下再说吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(289,12,0);   --  1(1):[殷天正]说: 好啊！*先暖暖我这把老骨头也好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(290,0,1);   --  1(1):[WWW]说: 不是，不是，*我是来帮．．．．．．　
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(291,12,0);   --  1(1):[殷天正]说: 帮六大派的！*我明教才不怕你们这些自居*名门的家伙．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(11,3,0,0) ==false then    --  6(6):战斗[11]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(292,14,0);   --  1(1):[韦一笑]说: 可恶，爪子真硬，*鹰王，我们先进去再说．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,4,-2,-2,-2,-2,-2,5454,5454,5454,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,-2,-2,-2,5456,5456,5456,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(29,48,29,35);   --  25(19):场景移动29-48--29-35
    instruct_1(293,8,0);   --  1(1):[唐文亮]说: 魔教已然一败涂地，*再不投降，*还待怎的？*玄慈大师，*咱们这便去毁了魔教三十三*代教主的牌位吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(294,7,0);   --  1(1):[何太冲]说: 什麽投不投降？*魔教之众，*今日不能留下任何活口．*除恶务尽，*否则他日死灰复燃，*又将为害江湖．*魔崽子们！*识时务的快快自我了断，*省得大爷们动手．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(295,70,0);   --  1(1):[玄慈]说: 华山派和崆峒派各位，*请将顶上的魔教余孽一概诛*灭了．*武当派从西往东搜索，峨嵋*派从东往西搜索，别让魔教*有一人漏网．*崑仑派预备火种，焚烧魔教*巢穴．**少林弟子各取法器，诵念往*生经文，替六派殉难英雄，*魔教教众超渡，化除冤孽．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(29,35,29,48);   --  25(19):场景移动29-35--29-48
    instruct_56(4);   --  56(38):提高声望值4
--end

