--function oldevent_650()

    if instruct_4(188,1,0) ==false then    --  4(4):是否使用物品[鸯刀]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(188,-1);   --  32(20):物品[鸯刀]+[-1]
    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_1(2519,0,1);   --  1(1):[WWW]说: 哈！*这刀孔大小正适合放这把*鸯刀．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_17(-2,1,23,39,0);   --  17(11):修改场景贴图:当前场景层1坐标17-27
    instruct_17(-2,1,24,39,0);   --  17(11):修改场景贴图:当前场景层1坐标18-27
    instruct_0();   --  0(0)::空语句(清屏)
--end

