--function oldevent_115()
    instruct_1(457,13,0);   --  1(1):[谢逊]说: 少侠准备好要破我明教之*”光明圣火阵”了吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(467,0,1);   --  1(1):[WWW]说: 我还没准备好．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(458,0,1);   --  1(1):[WWW]说: 我准备好了，*还请各位前辈高抬贵手．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_35(10,0,10,900);   --  35(23):设置范遥武功0:逍遥掌攻击力900
    instruct_35(11,0,50,900);   --  35(23):设置杨逍武功0:逍遥剑法攻击力900
    instruct_35(12,0,9,900);   --  35(23):设置殷天正武功0:鹰爪功攻击力900
    instruct_35(13,0,6,900);   --  35(23):设置谢逊武功0:七伤拳攻击力900
    instruct_35(13,1,92,900);   --  35(23):设置谢逊武功1:九阳神功攻击力900
    instruct_35(14,0,8,900);   --  35(23):设置韦一笑武功0:寒冰绵掌攻击力900
    instruct_35(15,0,85,900);   --  35(23):设置金花婆婆武功0:金花杖法攻击力900
    instruct_48(10,200);   --  48(30):范遥增加生命200
    instruct_48(11,200);   --  48(30):杨逍增加生命200
    instruct_48(12,200);   --  48(30):殷天正增加生命200
    instruct_48(13,200);   --  48(30):谢逊增加生命200
    instruct_48(14,200);   --  48(30):韦一笑增加生命200
    instruct_48(15,200);   --  48(30):金花婆婆增加生命200

    if instruct_6(15,8,0,1) ==false then    --  6(6):战斗[15]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(466,13,0);   --  1(1):[谢逊]说: 小兄弟似乎需要再磨练．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_3(-2,102,1,1,118,-1,-1,5318,5318,5318,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [102]
    instruct_3(-2,103,1,1,119,-1,-1,5324,5324,5324,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [103]
    instruct_3(-2,104,1,1,120,-1,-1,5342,5342,5342,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [104]
    instruct_3(-2,101,1,1,122,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [101]
    instruct_3(-2,90,1,1,117,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [90]
    instruct_3(-2,94,1,1,121,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [94]
    instruct_3(-2,91,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [91]
    instruct_3(-2,92,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [92]
    instruct_3(-2,93,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [93]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(459,12,0);   --  1(1):[殷天正]说: 果然是英雄出少年，*我们这些老骨头都不行了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(460,14,0);   --  1(1):[韦一笑]说: 今後武林中，*就是你们这些年轻人的天*下了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(461,0,1);   --  1(1):[WWW]说: 是各位前辈承让了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(462,13,0);   --  1(1):[谢逊]说: 就遵照我们的约定，*”倚天屠龙记”一书该为少*侠所有．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(463,0,1);   --  1(1):[WWW]说: 谢谢各位前辈．***在经过了这麽多波折才拿到*此书，虽说辛苦，但也从中*学到不少东西．*世上的好坏人真的很难去界*定，名门正派的人，外表有*羊皮披挂着，反倒是更容易*去为恶．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(464,10,0);   --  1(1):[范遥]说: 经过了这些，你的江湖历练*又增长了不少．希望你在其*它的旅途上也更能顺利．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(465,0,1);   --  1(1):[WWW]说: 好了，我还要去忙别的了．*有空我会再回来的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(155,1);   --  2(2):得到物品[倚天屠龙记][1]
    instruct_56(10);   --  56(38):提高声望值10
--end

