--function oldevent_264()

    if instruct_4(177,1,0) ==false then    --  4(4):是否使用物品[广陵散琴曲]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(860,34,0);   --  1(1):[黄钟公]说: ”广陵散”！！！***这”广陵散”绝响於人间已*久，今日得睹古人名谱，实*是不胜之喜．妙极！*和平中正，却又清绝幽绝．*高量雅致，深藏玄机，便这*麽神游琴韵，*片刻之间已然心怀大畅．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(861,0,1);   --  1(1):[WWW]说: 大庄主道号”黄钟公”，*自是琴中高手．看大庄主读*此琴谱时悠心自在，神情平*和之状，果是不求声名利禄*的世外高人，令小辈万分钦*羡．*此谱虽然难得，却也不是什*麽值钱的东西，我留在身上*也没用，大庄主就拿去吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(862,34,0);   --  1(1):[黄钟公]说: 常言道：无功不受禄，你我*素无渊源，焉可受你这等厚*礼？*听我那三个兄弟说道，只须*本庄有人武功胜过你，便可*得那四样东西，那老朽可不*能白占这个便宜．小兄弟，*咱们便来比划几招如何？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(863,0,1);   --  1(1):[WWW]说: 好，前辈请．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(46,3,0,0) ==false then    --  6(6):战斗[46]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(864,34,0);   --  1(1):[黄钟公]说: 小兄弟武艺精深，令老朽衷*心折服，那”广陵散”老夫*是无福消受了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(865,33,0);   --  1(1):[黑白子]说: 大哥，为了那四样书画，*也顾不得那麽多了，*咱们四兄弟一起上吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(866,34,0);   --  1(1):[黄钟公]说: 不可如此，咱们为了那些书*画以老欺小已是不该，更岂*可以多胜少．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(867,33,0);   --  1(1):[黑白子]说: 那咱们就请地牢那个老怪．*．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(868,34,0);   --  1(1):[黄钟公]说: 二弟！住嘴！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(869,0,1);   --  1(1):[WWW]说: 难道这梅庄中还另有高手？***没关系，我说过只要贵庄中*有人可以打败我，我这四件*书画，一定双手奉上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(870,33,0);   --  1(1):[黑白子]说: 大哥，没问题的，*有我们在旁边守着，*那老怪物跑不掉的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(871,34,0);   --  1(1):[黄钟公]说: 二弟你还说！***少侠，敝庄中已无可胜你之*人，你就请回吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,265,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,16,-2,-2,266,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,-2,-2,267,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,-2,-2,268,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,0,-2,-2,-1,-1,269,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,-1,-1,269,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,-1,-1,269,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_56(3);   --  56(38):提高声望值3
--end

