--function oldevent_501()
    instruct_1(2171,0,1);   --  1(1):[WWW]说: 小二哥，你们这龙门客栈生*意相当兴隆耶，高朋满座．*是不是有啥道地的招牌菜，*还是有美艳风骚的老板娘来*吸引顾客呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2172,106,0);   --  1(1):[???]说: 这位公子，不瞒你说．*从前呢，这龙门客栈的老板*的确是个风骚的大美人．*可是自从我们老板顶下这店*後，生意就一日不如一日．*谁叫地处偏僻的西域呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2173,0,1);   --  1(1):[WWW]说: 可是我看店中客人很多啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2174,106,0);   --  1(1):[???]说: 你不知道吗？*最近啊，很多人打东边来，*似乎是中原各大门派的人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2175,0,1);   --  1(1):[WWW]说: 他们要去那儿？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2176,106,0);   --  1(1):[???]说: 嘘！小声点．．．*我无意间听到一些．．*他们呢，好像都是六个门派*的弟子，此次来到西域，似*乎是冲着明教而来，说是什*麽六大派围攻光明顶来着．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2177,0,1);   --  1(1):[WWW]说: 六大派围攻光明顶？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2178,106,0);   --  1(1):[???]说: 小声点，别惹祸上身了．*客倌，我劝你没事就别在这*附近逗留，西域最近已成多*事之地了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,500,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

