--function oldevent_259()
    instruct_1(849,0,1);   --  1(1):[WWW]说: 看您老一脸英气凛然，*王者之尊的样子，*想必是梅庄的大庄主．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(850,34,0);   --  1(1):[黄钟公]说: 不敢当，正是老夫．*不知少侠到我梅庄来有何贵*事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(851,0,1);   --  1(1):[WWW]说: 我听江湖上传言贵庄内卧虎*藏龙，高手如云，一时心生*好奇，特来探个究竟．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(852,34,0);   --  1(1):[黄钟公]说: 我梅庄四友隐居江南已久，*对江湖之事早已淡如轻烟，*什麽卧虎藏龙，高手如云，*不过是武林中人随口胡诌罢*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(853,0,1);   --  1(1):[WWW]说: 我看也是如此，其它那三位*庄主简直是”鲁肉脚”，三*两下就被我解决了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(854,31,0);   --  1(1):[丹青生]说: 小子你！．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(855,34,0);   --  1(1):[黄钟公]说: 这个我已听我那三个兄弟说*过，不过对於外在的声名利*禄我们早已抛诸脑後，*也不会在乎武林上对我们的*评论！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(856,0,1);   --  1(1):[WWW]说: ＜这老家伙真沉得住气，*  要激他动手可不简单，*  可得好好想个办法＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(857,34,0);   --  1(1):[黄钟公]说: 少侠请慢走，老夫不送了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,260,264,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,16,-2,-2,261,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,-2,-2,262,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,-2,-2,263,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
--end

