--function oldevent_967()
    instruct_1(2748,35,0);   --  1(1):[令狐冲]说: 来来来，好久不见，我们喝*一杯．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(2749,0,1);   --  1(1):[WWW]说: 令狐兄还是这麽潇洒．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2750,0,1);   --  1(1):[WWW]说: 提起喝酒，我就想起一路上*少了令狐兄为伴，旅途中就*好像少了点什麽．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,35,0);   --  1(1):[令狐冲]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(2751,35,0);   --  1(1):[令狐冲]说: 那我们就再一起结伴天涯，*喝尽世间的美酒！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(35);   --  10(A):加入人物[令狐冲]
--end

