--function oldevent_554()
    instruct_1(2069,0,1);   --  1(1):[WWW]说: 请问是薛慕华薛前辈吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2074,45,0);   --  1(1):[薛慕华]说: 这位小兄弟今天来不知是．*．．．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(2077,0,1);   --  1(1):[WWW]说: 没什麽事，在下途经这柳宗*镇，听说神医住在附近，特*来拜见．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2075,0,1);   --  1(1):[WWW]说: 是这样的，我听说薛先生医*术高明，今日来是想请先生*加入我的队伍，日後能帮我*同伴们治病疗伤．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2076,45,0);   --  1(1):[薛慕华]说: 对不起，在下技艺有限，阁*下还是另请高明吧．
    instruct_0();   --  0(0)::空语句(清屏)
--end

