--function oldevent_30()
    instruct_25(41,31,34,31);   --  25(19):场景移动41-31--34-31
    instruct_1(86,3,0);   --  1(1):[苗人凤]说: 你们是田归农请来的吧！*神龙教何时跟田归农搭在一*起了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(87,97,0);   --  1(1):[???]说: 还多亏了田兄，我们才知道*”飞狐外传”一书在你这．*识相的话就快将书交出来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(88,3,0);   --  1(1):[苗人凤]说: 田归农呢？他怎麽不敢出来*见我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(89,97,0);   --  1(1):[???]说: 我看你是见不到他了．*田兄从毒手药王那弄来的断*肠草粉末，药效也真够狠，*现下你双眼已瞎，我看*”打遍天下无敌手”的金面*佛苗人凤，今日要上西天了*兄弟们，上！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(34,31,41,31);   --  25(19):场景移动34-31--41-31
    instruct_1(90,0,1);   --  1(1):[WWW]说: 苗大侠，我帮你拿贼．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(3,3,0,0) ==false then    --  6(6):战斗[3]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,2,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_19(35,31);   --  19(13):主角移动至23-1F
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(91,3,0);   --  1(1):[苗人凤]说: 小兄弟，你尊姓大名，*与我可有渊源？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(92,0,1);   --  1(1):[WWW]说: 丈夫结交，但重义气，*只需肝胆相照，何必提名道*姓．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(93,3,0);   --  1(1):[苗人凤]说: 好，苗人凤独来独往，生平*只有两个知交，一个是辽东*大侠胡一刀，*另一个便是你这位不知姓名*没见过面的小兄弟．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_16(1,0,15) ==true then    --  16(10):队伍是否有[胡斐]否则跳转到:Label1
        instruct_1(94,1,1);   --  1(1):[胡斐]说: 你说什麽．那你为何要杀死*胡大侠．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(95,3,0);   --  1(1):[苗人凤]说: 这说来话长．．．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(96,0,1);   --  1(1):[WWW]说: 大哥，*我们先想办法救苗大侠，*这事以後再说．
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_1(97,0,1);   --  1(1):[WWW]说: 苗大侠，既然这药是毒手药*王所配制，那我们去求毒手*药王救治，或能解得．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(98,3,0);   --  1(1):[苗人凤]说: 要求毒手药王吗？那是徒劳*往返，不用去了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(99,0,1);   --  1(1):[WWW]说: 不，天下无难事！*这位毒手药王住在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(100,3,0);   --  1(1):[苗人凤]说: 听说此人在洞庭湖畔隐居．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(101,0,1);   --  1(1):[WWW]说: 我这就去了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_17(49,1,28,37,0);   --  17(11):修改场景贴图:场景[药王庄]层1坐标1C-25
    instruct_17(49,1,27,37,3692);   --  17(11):修改场景贴图:场景[药王庄]层1坐标1B-25
    instruct_17(49,1,27,36,3694);   --  17(11):修改场景贴图:场景[药王庄]层1坐标1B-24
    instruct_3(-2,9,-2,-2,-2,-2,35,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,-2,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(2);   --  37(25):增加道德2
    instruct_56(1);   --  56(38):提高声望值1
    instruct_8(3);   --  8(8):切换大地图音乐
--end

