--function oldevent_826()
    instruct_1(2595,74,0);   --  1(1):[北丑]说: 少年哎，到这寒天雪地中，*是向我”李丑”寻求真理的*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2596,0,1);   --  1(1):[WWW]说: ＜李丑？莫非他就是与智者*齐名，”南贤北丑”中的北*丑吗 ？＞*＜怎麽看起来疯疯癫癫的，*罩得住吗？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2597,74,0);   --  1(1):[北丑]说: 别怀疑我的能力？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2598,0,1);   --  1(1):[WWW]说: ＜厉害！连我在想什麽都知*道．＞**你真的懂得很多吗？*有比”南贤”智者还多吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2599,74,0);   --  1(1):[北丑]说: 南贤那个老头子懂什麽？*他知道的不过是基本知识罢*了，连三岁小孩子都知道．*我李丑可就不一样了，我知*道的可都是武林中的大秘密*哦！*所以别浪费你的智慧果了，*拿来给我还比较实际一点．**你如果还不相信我的能力，*那我就让你见识我这全江湖*中唯一的一件法宝.*看到桌上的水晶球没，没事*就摸它一下，看看有什麽意*想不到的事发生．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,827,751,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,2,-2,-2,828,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
--end

