--function oldevent_28()

    if instruct_16(1,6,0) ==false then    --  16(10):队伍是否有[胡斐]是则跳转到:Label0
        instruct_1(65,4,0);   --  1(1):[阎基]说: 少侠请随便看看，*有什麽喜欢的就拿去吧．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(72,0,1);   --  1(1):[WWW]说: 阎基，为何你家中有胡家刀*法的缺页．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(73,4,0);   --  1(1):[阎基]说: 胡家刀法，哦！那是我年轻*时在沧州无意间所获得的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(74,1,1);   --  1(1):[胡斐]说: 你为什麽有我胡家刀法的缺*页．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(75,4,0);   --  1(1):[阎基]说: 原来胡一刀的後人长这麽大*了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(76,1,1);   --  1(1):[胡斐]说: 小时後平四叔曾告诉我，当*年害死我父亲的，一个跌打*医生也有份，*不但如此，那跌打医生後来*还撕去几页胡家刀法．*莫非．．．那个人就是你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(77,0,1);   --  1(1):[WWW]说: 没错，这家伙会医术，上次*还说要帮我看病．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(78,4,0);   --  1(1):[阎基]说: 既然你们认出来，我也就没*什麽好隐瞒的了．*没错，那跌打医生就是我．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(79,1,1);   --  1(1):[胡斐]说: 你为什麽要帮苗人凤要害死*我父亲．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(80,4,0);   --  1(1):[阎基]说: 谁叫”雪山飞狐”一书在他*那呢？当初若不是让他们俩*傻呼呼的拼斗，*又在苗人凤剑上喂点毒药，*我怎麽能坐收渔翁之利呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(81,1,1);   --  1(1):[胡斐]说: 可恶的家伙，替我父亲偿命*来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(82,4,0);   --  1(1):[阎基]说: 若不是有准备，我怎敢说出*这些．**小娃儿，试试我的新玩意，*天下至毒的”七心海棠”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_23(4,99);   --  23(17):设置人物[阎基]用毒能力[99]

    if instruct_6(2,0,24,0) ==true then    --  6(6):战斗[2]否则跳转到:Label1
        instruct_3(-2,1,0,-1,-1,-1,-1,-1,-1,-1,0,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_2(158,1);   --  2(2):得到物品[七心海棠][1]
        instruct_56(2);   --  56(38):提高声望值2
        instruct_37(2);   --  37(25):增加道德2
        do return; end
    end    --:Label1

    instruct_15(83);   --  15(F):战斗失败，死亡
--end

