--function oldevent_37()

    if instruct_18(173,0,15) ==true then    --  18(12):是否有物品[一朵蓝花]否则跳转到:Label0
        instruct_3(-2,-2,-2,-2,-1,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
    end    --:Label0

    instruct_1(139,0,1);   --  1(1):[WWW]说: 什麽味道这样香浓，我头好*昏，啊！难道这红树丛有毒* ．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(-1,5974,5992);   --  27(1B):显示动画
    instruct_14();   --  14(E):场景变黑
    instruct_19(30,49);   --  19(13):主角移动至1E-31
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_27(-1,6014,6024);   --  27(1B):显示动画
    instruct_1(140,0,1);   --  1(1):[WWW]说: 咦！这是那里？*莫非我已昏厥多时？*此处非平常之地．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,-2,-2,38,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

