--function oldevent_445()
    instruct_1(1578,61,0);   --  1(1):[欧阳克]说: 怎样，想通了吗．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(11,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(1576,0,1);   --  1(1):[WWW]说: 不行，我还是想当个大侠，*不肖与你这个人为伍．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1577,61,0);   --  1(1):[欧阳克]说: 真是可惜，本来还想跟你研*究研究”床上功夫”呢．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1573,0,1);   --  1(1):[WWW]说: 好吧，那我们就一起称霸武*林吧．反正有句名言不是说*”好人早死，坏人较长命”
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_42(6,0) ==false then    --  42(2A):队伍中是否有女性是则跳转到:Label1
        instruct_1(1575,61,0);   --  1(1):[欧阳克]说: 不行，不行，*我们同伴中没有女的我会受*不了，等你找到女的再说．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,61,0);   --  1(1):[欧阳克]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(1574,61,0);   --  1(1):[欧阳克]说: 走吧，再去找一些邪恶的人*来加入．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,472,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,472,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,472,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,-2,-2,472,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,-2,-2,472,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(61);   --  10(A):加入人物[欧阳克]
    instruct_37(-6);   --  37(25):增加道德-6
--end

