--function oldevent_271()
    instruct_1(876,33,0);   --  1(1):[黑白子]说: 少侠，好久不见，*近来可好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(877,0,1);   --  1(1):[WWW]说: ＜这麽客气，一定有诈，*  还是小心得好．＞**托你的福，一切还好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(878,33,0);   --  1(1):[黑白子]说: 不知少侠对那先前的比武之*约定还否算数？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(879,0,1);   --  1(1):[WWW]说: ＜原来是在”哮想”我那四*  样东西．＞　**当然算数，我说过只要贵庄*中有人能够打得赢我，我那*四件书画，一定双手奉上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(880,33,0);   --  1(1):[黑白子]说: 够爽快！小兄弟．敝庄实另*有一位朋友，听说少侠的武*功如此了得，说什麽也要和*你较量几手．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(881,0,1);   --  1(1):[WWW]说: 这样啊，好！没问题，就请*二庄主替我引见引见．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(882,33,0);   --  1(1):[黑白子]说: 那位朋友一向不习惯阳光下*的生活，所以将自己关在梅*庄下的地洞中．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(883,0,1);   --  1(1):[WWW]说: ＜天底下还有这种人，喜欢*  把自己关在地洞里，真是*  怪异．＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(884,33,0);   --  1(1):[黑白子]说: 这是钥匙，少侠你自个儿先*行进去，我找其他的三位兄*弟，叫大夥一起去做公证．*对了，地洞的入口在一间摆*有四张椅子及一张桌子的房*间内．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(885,0,1);   --  1(1):[WWW]说: 干嘛，你们四人闲起来就打*麻将啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(886,33,0);   --  1(1):[黑白子]说: 咦！你怎麽会知道？*这是我兄弟四人正在研究的*游戏．*目前只有一个雏形而已，甚*至连特殊牌都还没有决定好*用那四种名称？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(887,0,1);   --  1(1):[WWW]说: ＜难不成这麻将就是这四人*  无聊时发明出来的？＞**你们想用什麽名称？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(888,33,0);   --  1(1):[黑白子]说: 就用我们四人的兴趣，*”琴棋书画”四字．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(889,0,1);   --  1(1):[WWW]说: 不好，用”春夏秋冬”或是*”梅兰竹菊”比较好．*较能表现出四季的变化．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(890,33,0);   --  1(1):[黑白子]说: 是吗？听起来似乎不错．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(891,0,1);   --  1(1):[WWW]说: 我这就去找他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,281,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_17(-2,1,28,30,1832);   --  17(11):修改场景贴图:当前场景层1坐标1C-1E
    instruct_17(-2,1,29,30,0);   --  17(11):修改场景贴图:当前场景层1坐标1D-1E
    instruct_17(-2,1,30,30,1836);   --  17(11):修改场景贴图:当前场景层1坐标1E-1E
    instruct_2(161,1);   --  2(2):得到物品[红钥匙][1]
--end

