--function oldevent_50()
    instruct_1(192,0,1);   --  1(1):[WWW]说: 这山洞中有那麽多雪怪，*莫非藏有宝物？*管他的，富贵险中求．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(6,0,61,0) ==true then    --  6(6):战斗[6]否则跳转到:Label0
        instruct_3(-2,-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(-2,3,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,4,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,5,0,-2,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_56(5);   --  56(38):提高声望值5
        do return; end
    end    --:Label0

    instruct_15(83);   --  15(F):战斗失败，死亡
--end

