--function oldevent_39()
    instruct_1(144,0,1);   --  1(1):[WWW]说: 这位姑娘，请问这里是药王*庄吗？*＜莫非她就是毒手药王？＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(145,2,0);   --  1(1):[程灵素]说: 你到药王庄来所为何事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(146,0,1);   --  1(1):[WWW]说: 金面佛苗大侠中毒受伤，所*用毒药，乃奸人自前辈处盗*来，望前辈慈悲赐予解药．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(147,2,0);   --  1(1):[程灵素]说: 哼！姜师兄又随意将毒药给*予外人，江湖上的人又将这*笔帐记在师父头上了．*这次又是中了什麽毒？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(148,0,1);   --  1(1):[WWW]说: 原来毒手药王是你师父，害*我前辈长前辈短的乱叫，你*也不怕折寿吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(149,2,0);   --  1(1):[程灵素]说: 我又没叫你叫，是你自己爱*叫的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(150,0,1);   --  1(1):[WWW]说: 还请姑娘请药王前辈出来，*在下想向他求取断肠草的解*药．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(151,2,0);   --  1(1):[程灵素]说: 我师父已经过世了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(152,0,1);   --  1(1):[WWW]说: 那这该如何是好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(153,2,0);   --  1(1):[程灵素]说: 这断肠草的毒并不太难解．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(154,0,1);   --  1(1):[WWW]说: 原来姑娘已得到药王先生的*真传，还请姑娘惠赐解药．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(155,2,0);   --  1(1):[程灵素]说: 给你解药也是可以，只要你*帮我办一件事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(156,0,1);   --  1(1):[WWW]说: 什麽事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(157,2,0);   --  1(1):[程灵素]说: 你功夫好不好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(158,0,1);   --  1(1):[WWW]说: 在下志在武林盟主，功夫自*然不差．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(159,2,0);   --  1(1):[程灵素]说: 口气倒是很大．*好，那我要你帮我找回一样*东西．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(160,0,1);   --  1(1):[WWW]说: 什麽东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(161,2,0);   --  1(1):[程灵素]说: 七心海棠．***这东西自从被我姜师兄盗出*去後，现在不知流落何方．**若不赶快找回来的话，不知*又有多少笔烂帐要记在我药*王庄的头上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(162,0,1);   --  1(1):[WWW]说: 那我要到那里去找？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(163,2,0);   --  1(1):[程灵素]说: 我如果知道还要你去找吗？*不过你可以多留意一些滥施*毒药，迷药害人的家伙．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(164,0,1);   --  1(1):[WWW]说: 尚不知姑娘芳名？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(165,2,0);   --  1(1):[程灵素]说: 程灵素．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(166,0,1);   --  1(1):[WWW]说: 那，灵姑娘，告辞了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,40,41,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

