--function oldevent_523()
    instruct_1(1896,0,1);   --  1(1):[WWW]说: 哇！这儿有那麽多乞丐，*我身上的零钱可能不太够．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1897,93,0);   --  1(1):[???]说: 阁下别惊慌，我们群丐在这*里聚聚，不会向你乞讨的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1898,0,1);   --  1(1):[WWW]说: 一大群乞丐聚在这里，你们*该不会是丐帮吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1899,93,0);   --  1(1):[???]说: 正是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1900,0,1);   --  1(1):[WWW]说: 久闻丐帮乃天下第一大帮，*人数之众，为武林之最．*小弟行走江湖，说什麽也得*认识一下丐帮的英雄好汉．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1901,93,0);   --  1(1):[???]说: 阁下好说．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1902,0,1);   --  1(1):[WWW]说: 不知这位大哥是否可替我引*见一下贵帮帮主．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1903,93,0);   --  1(1):[???]说: 想见我们帮主，那也得是个*英雄好汉才行．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1904,0,1);   --  1(1):[WWW]说: 怎样才算是个英雄好汉？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1905,93,0);   --  1(1):[???]说: 你说呢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1906,0,1);   --  1(1):[WWW]说: 嗯．．．．．．*．．．．．．．*．．．．．．．*久闻丐帮打狗阵威力无比，*在下不才，想与各位切磋切*磋．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(82,50,0,1) ==false then    --  6(6):战斗[82]是则跳转到:Label0
        instruct_3(-2,0,-2,-2,580,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,1,-2,-2,580,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,5,-2,-2,580,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1908,93,0);   --  1(1):[???]说: 阁下这样的功夫，似乎不配*见我家帮主．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,2,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,6,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,9,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,12,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,15,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,16,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,-2,-2,524,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1907,93,0);   --  1(1):[???]说: 阁下功夫不错，竟破了我丐*帮之打狗阵法．*乔帮主就在里面，请进，我*家帮主一定很高兴认识你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(2);   --  56(38):提高声望值2
--end

