--function oldevent_516()
    instruct_1(1875,0,1);   --  1(1):[WWW]说: 老伯，你年纪这麽大了，*还做这种粗活，少林寺也太*不敬老尊贤了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1876,110,0);   --  1(1):[???]说: 这算什麽．你没听人说过，*少林寺中藏龙卧虎，搞不好*一个扫地僧都是身怀绝技的*高手．*我虽然年纪大了，这扫地的*活我还做得来．*只是人老了，记性就是有点*不太好．我跟你讲件事，你　　　　*可千万不能跟别人说哦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1877,0,1);   --  1(1):[WWW]说: 好的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1878,110,0);   --  1(1):[???]说: 前阵子我弄丢一本经书，年*纪大了记性就不好，看完後*就忘记摆那去了．*你可千万不能跟别人说哦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1879,0,1);   --  1(1):[WWW]说: 我知道．
    instruct_0();   --  0(0)::空语句(清屏)
--end

