--function oldevent_460()
    instruct_1(1520,0,1);   --  1(1):[WWW]说: 老前辈，你在吃什麽？*这麽香啊．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1521,69,0);   --  1(1):[洪七公]说: ”香肉”当然香了．*喂，我可不会分你，老叫化*我一个人都吃不够了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1522,0,1);   --  1(1):[WWW]说: 是不是黑狗肉啊，听说黑狗*肉最香了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1523,69,0);   --  1(1):[洪七公]说: 你还蛮懂的吃的嘛．没错，*”一黑二黄三花四白”说的*就是吃狗肉的秘诀．*不过呢这肉虽好吃，还是比*不上黄蓉那女娃儿的手艺．**那道菜叫什麽来着，对了，*是”玉笛谁家听落梅”．*想起来我就流口水．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,461,462,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(32,0,-2,-2,675,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[海边小屋]:场景事件编号 [0]
--end

