--function oldevent_182()
    instruct_1(647,82,0);   --  1(1):[???]说: 阁下若无请帖，还请离开．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(1,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(646,0,1);   --  1(1):[WWW]说: 说不得只好打了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(27,3,0,0) ==false then    --  6(6):战斗[27]是则跳转到:Label1
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_3(-2,0,-2,-2,183,-1,-1,5192,5192,5192,-2,30,48);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,20,-2,-2,183,-1,-1,5186,5186,5186,-2,27,48);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,1,-2,-2,183,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,183,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(-1);   --  37(25):增加道德-1
    instruct_56(1);   --  56(38):提高声望值1
--end

