--function oldevent_724()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2624,73,0);   --  1(1):[南贤]说: 江湖上这些草莽之人，你别*以为他们除了拥有一身过人*武功外，就什麽都不会了．*其实在他们之中，也是有饱*读诗书，才识渊博之人．**另外还有些人则是喜欢附庸*风雅，收集一些文物．**这些人好比是绝情谷的公孙*谷主，白驼山的欧阳克，*福威镖局少庄主，嵩山派的*左掌门，梅庄四位庄主，以*及燕子坞的慕容世家等．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,0,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

