--function oldevent_995()
    instruct_1(2818,61,0);   --  1(1):[欧阳克]说: 你终於来了．*快走吧，我们颠覆武林的计*划还没完成呢．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(2819,0,1);   --  1(1):[WWW]说: 嗯! 对不起，临时想到有事*情，我先走一步，这事下次*再说．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2820,0,1);   --  1(1):[WWW]说: 是啊，少了欧阳公子，这大*事就办不成了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,61,0);   --  1(1):[欧阳克]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(2821,61,0);   --  1(1):[欧阳克]说: 走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(61);   --  10(A):加入人物[欧阳克]
--end

