--function oldevent_499()
    instruct_1(1813,0,1);   --  1(1):[WWW]说: 小和尚，还没回少林呀？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1814,49,0);   --  1(1):[虚竹]说: 施主是你．*是啊，小僧还没找到回少林*的路．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(1812,0,1);   --  1(1):[WWW]说: 小和尚，那改天我们少林寺*再见．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1809,0,1);   --  1(1):[WWW]说: 既然如此，小和尚要不要和*我一起走，我知道回少林的*路．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,75,100,6,0) ==false then    --  28(1C):判断WWW品德75-100是则跳转到:Label1
        instruct_1(1811,49,0);   --  1(1):[虚竹]说: 不用了，小僧自己找路回少*林即可．**倒是施主眼神中充满戾气，*恐入魔道，望施主能即时回*头．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,49,0);   --  1(1):[虚竹]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(1810,49,0);   --  1(1):[虚竹]说: 好啊．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,15,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(49);   --  10(A):加入人物[虚竹]
    instruct_37(3);   --  37(25):增加道德3
--end

