--function oldevent_530()

    if instruct_16(51,0,5) ==true then    --  16(10):队伍是否有[慕容复]否则跳转到:Label0
        instruct_1(2893,51,0);   --  1(1):[慕容复]说: 等一下！
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_16(51,5,0) ==false then    --  16(10):队伍是否有[慕容复]是则跳转到:Label1
        instruct_1(2893,51,1);   --  1(1):[慕容复]说: 等一下！
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,20,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,21,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,22,1,1,-1,-1,-1,6306,6306,6306,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]

    if instruct_16(51,34,0) ==false then    --  16(10):队伍是否有[慕容复]是则跳转到:Label2
        instruct_3(-2,23,1,1,-1,-1,-1,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]

        if instruct_60(52,3,6310,0,14) ==true then    --  60(3C):判断场景52事件位置3是否有贴图6310否则跳转到:Label3
            instruct_3(-2,24,1,1,-1,-1,-1,6314,6314,6314,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
        end    --:Label3

    end    --:Label2


    if instruct_16(76,0,32) ==true then    --  16(10):队伍是否有[王语嫣]否则跳转到:Label4
        instruct_3(-2,23,1,1,-1,-1,-1,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]

        if instruct_16(53,0,14) ==true then    --  16(10):队伍是否有[段誉]否则跳转到:Label5
            instruct_3(-2,24,1,1,-1,-1,-1,6314,6314,6314,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
        end    --:Label5

    end    --:Label4

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1946,0,1);   --  1(1):[WWW]说: 慕容公子，你要做什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1947,51,0);   --  1(1):[慕容复]说: 我决定今天要在武林同道面*前揭发乔峰真实的身份．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1948,0,1);   --  1(1):[WWW]说: 慕容公子，*得饶人处且饶人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1949,51,0);   --  1(1):[慕容复]说: 哼！你得到书了，而我呢？*大燕复国的希望都在我身上*．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1950,0,1);   --  1(1):[WWW]说: 那，恕在下得罪了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(85,3,0,0) ==false then    --  6(6):战斗[85]是则跳转到:Label6
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label6

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1951,0,1);   --  1(1):[WWW]说: 慕容公子，我不杀你，这件*事还请你忘记，否则．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1952,51,0);   --  1(1):[慕容复]说: 哼！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_56(3);   --  56(38):提高声望值3
    instruct_37(3);   --  37(25):增加道德3
    instruct_14();   --  14(E):场景变黑

    if instruct_16(51,0,2) ==true then    --  16(10):队伍是否有[慕容复]否则跳转到:Label7
        instruct_21(51);   --  21(15):[慕容复]离队
    end    --:Label7

    instruct_3(-2,22,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(52,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景

    if instruct_60(-2,23,6298,1,0) ==false then    --  60(3C):判断场景-2事件位置23是否有贴图6298是则跳转到:Label8
        do return; end
    end    --:Label8

    instruct_1(1953,0,1);   --  1(1):[WWW]说: 王姑娘，你怎麽还在这，你*表哥已经走了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1954,109,0);   --  1(1):[???]说: 唉！我表哥为了大燕复国之*事，已经发疯了．*在他一生之中，便是梦想要*做大燕皇帝．这也难怪，因*为他慕容氏世世代代，做的*便是这个梦．*他祖宗几十代做下来的梦，*传到他身上，怎又能盼他觉*醒呢？*我表哥他本性并不坏，只不　*过为了想做大燕皇帝，行事　*才会变得如此不择手段．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1955,0,1);   --  1(1):[WWW]说: 可是你不是一直都喜欢着他*吗．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1956,109,0);   --  1(1):[???]说: 在我表哥心中，复兴大业一*直都是他心中最重要的事，*儿女私情只不过．．．．．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_60(-2,24,6314,46,0) ==false then    --  60(3C):判断场景-2事件位置24是否有贴图6314是则跳转到:Label9
        instruct_1(2894,0,1);   --  1(1):[WWW]说: 王姑娘，你别烦恼，或许过*阵子你表哥就会想通了．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2895,109,0);   --  1(1):[???]说: 希望如此．*那我先回燕子坞了．*公子，告辞！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑

        if instruct_16(76,0,2) ==true then    --  16(10):队伍是否有[王语嫣]否则跳转到:Label10
            instruct_21(76);   --  21(15):[王语嫣]离队
        end    --:Label10

        instruct_3(-2,23,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
        instruct_3(52,2,1,1,495,-1,-1,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [2]
        do return; end
    end    --:Label9

    instruct_1(1957,53,0);   --  1(1):[段誉]说: 王姑娘，你别烦恼，我去劝*劝你表哥，让他对你好一点*．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1958,109,0);   --  1(1):[???]说: 段公子，我真是糊涂透顶，*你一直待我这麽好，我．．*我却．．．．．*直到此刻我方才明白，这世　*上谁才是真的爱我，怜我的*人．．．．．．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1959,0,1);   --  1(1):[WWW]说: 恭喜段兄，真心终於打动了*美人芳心．**不知二位今後有何打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1960,109,0);   --  1(1):[???]说: 我曾听段郎说，无量山洞中*有一玉像，像极了我．*我想先和段郎去那一游．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1961,0,1);   --  1(1):[WWW]说: 那，祝你们一路顺风了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1962,53,0);   --  1(1):[段誉]说: 兄弟，你也保重．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑

    if instruct_16(53,0,2) ==true then    --  16(10):队伍是否有[段誉]否则跳转到:Label11
        instruct_21(53);   --  21(15):[段誉]离队
    end    --:Label11


    if instruct_16(76,0,2) ==true then    --  16(10):队伍是否有[王语嫣]否则跳转到:Label12
        instruct_21(76);   --  21(15):[王语嫣]离队
    end    --:Label12

    instruct_3(-2,23,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(52,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [2]
    instruct_3(52,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [3]
    instruct_3(42,6,1,1,594,-1,-1,6296,6296,6296,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [6]
    instruct_3(42,7,1,1,593,-1,-1,6308,6308,6308,-2,-2,-2);   --  3(3):修改事件定义:场景[无量山洞]:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1963,0,1);   --  1(1):[WWW]说: 别人都已有情人终成眷属，*而我呢？唉！*别想这麽多了，走吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(5);   --  37(25):增加道德5
    do return; end
--end

