--function oldevent_95()
    instruct_1(361,16,0);   --  1(1):[胡青牛]说: 多谢少侠救了内人，*胡某不知该如何报答．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(362,0,1);   --  1(1):[WWW]说: 没什麽，帮助别人本就是件*快乐的事，*胡先生就别客气了．*只是，*我看金花婆婆也不像坏人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(363,16,0);   --  1(1):[胡青牛]说: 其实，*都怪我夫妇年轻时的比试，*误了不少上门求医的人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(364,0,1);   --  1(1):[WWW]说: 比试？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(365,16,0);   --  1(1):[胡青牛]说: 我夫妇原本是同门师兄妹，*所学各有不同．*我是学医，这你知道的．*拙荆则是学毒的，使毒能力*之高，江湖上人还封她一个*外号，叫做”毒仙”．*那时我因为年轻冲动，救了*一些被拙荆下过毒的人，**使得江湖上传言我这个医仙*比毒仙厉害许多．**後来拙荆一怒之下，便到处*下毒要与我比试，看我能不*能救活他们．*但我总觉得这样下去不行，*於是就立了个誓，*”非我明教之人不救”*我想这样拙荆就无法再与我*比试，因为我俩都是明教中*人，拙荆万万不会对自己教*中的兄弟下手．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(366,0,1);   --  1(1):[WWW]说: 这麽说来，因为那位银叶先*生不是你明教中人，所以你*就没救他了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(367,16,0);   --  1(1):[胡青牛]说: 正是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(368,17,0);   --  1(1):[王难姑]说: 师兄，这次我们可能失算了．***在我被抓到灵蛇岛日子中，*我无意间发现这金花婆婆可*能是我明教中人，而且辈份*不低，是四大护法之首．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(369,16,0);   --  1(1):[胡青牛]说: 你是说，她是紫衫龙王！***可是不对呀，我听人家说，*紫衫龙王是明教第一美女，*怎麽可能长的如此．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(370,17,0);   --  1(1):[王难姑]说: 只怕她有不得已的苦衷，*故意化妆成这样．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(371,16,0);   --  1(1):[胡青牛]说: 这样看来，我竟害了自己教*中的弟兄．**唉，从今以後，*我这”非明教中人不治”的*原则就当没说过．*行医本就是要来救人，*否则学医干嘛．**对了，听说少侠正在旅游各　*地，寻找一些东西．**江湖多风险，我夫妇二人擅*长一些医术，毒术或许能帮*上少侠一些忙也说不定．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(372,17,0);   --  1(1):[王难姑]说: 是啊，如果少侠有需要的话*尽管说，我夫妇二人一定乐*意效劳．*蝴蝶谷内若有少侠需要的东*西，也请少侠自行取用．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,-2,-2,96,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,-2,-2,97,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_26(73,2,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号

    if instruct_55(3,-1,14,0) ==false then    --  55(37):事件d*编号3是否为-1是则跳转到:Label0
        instruct_3(-2,3,-2,-2,903,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    end    --:Label0


    if instruct_55(4,-1,14,0) ==false then    --  55(37):事件d*编号4是否为-1是则跳转到:Label1
        instruct_3(-2,4,-2,-2,904,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    end    --:Label1


    if instruct_55(5,-1,14,0) ==false then    --  55(37):事件d*编号5是否为-1是则跳转到:Label2
        instruct_3(-2,5,-2,-2,905,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    end    --:Label2

--end

