--function oldevent_63()

    if instruct_16(9,11,0) ==false then    --  16(10):队伍是否有[张无忌]是则跳转到:Label0
        instruct_1(221,0,1);   --  1(1):[WWW]说: 前辈，别来无恙？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(222,13,0);   --  1(1):[谢逊]说: 哼！你又来做什麽．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(211,9,1);   --  1(1):[张无忌]说: 义父，孩儿无忌不孝，*没能早日前来相接，*累义父受尽辛苦．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(212,13,0);   --  1(1):[谢逊]说: 你．．．．你说什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(213,9,1);   --  1(1):[张无忌]说: 孩儿便是无忌啊．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(214,13,0);   --  1(1):[谢逊]说: 你．．．．你说什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(215,9,1);   --  1(1):[张无忌]说: 拳学之道在凝神，*意在力先方制胜，*．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(216,13,0);   --  1(1):[谢逊]说: 这．．这不是昔日我所授与*我那无忌孩儿的口诀吗？*你当真便是我那无忌孩儿？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(217,9,1);   --  1(1):[张无忌]说: 义父！义父！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(218,13,0);   --  1(1):[谢逊]说: 老天爷开眼！老天爷开眼！*无忌孩儿，你这几年来过得*还好吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(219,9,1);   --  1(1):[张无忌]说: 孩儿过的很好．*今天多亏了这位大哥，*我们父子俩才能团聚．*义父，你跟我们一起回中土*吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(220,13,0);   --  1(1):[谢逊]说: 你过的很好，义父就很高兴*了．义父还要待在这思考对*付成崑的办法，你走吧．*记着，闯荡江湖千万要提防*小人，就算是自己的师父，*义兄都一样．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,64,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_37(3);   --  37(25):增加道德3
--end

