--function oldevent_483()
    instruct_1(2156,0,1);   --  1(1):[WWW]说: 小二哥，听说你们正在办什*麽无量山自助旅游的，是不*是啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2157,106,0);   --  1(1):[???]说: 这位客倌，您真是有眼光．*这无量山在我们大理境内，*可是风景第一的好去处．*怎样，想不想参加呀？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2158,0,1);   --  1(1):[WWW]说: 要怎麽参加呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2159,106,0);   --  1(1):[???]说: 办法很简单，但要先缴报名*费１００两．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2160,0,1);   --  1(1):[WWW]说: 这麽贵？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2161,106,0);   --  1(1):[???]说: 还嫌贵，我们可是打了折．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,-2,592,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

