--function oldevent_452()
    instruct_1(1637,0,1);   --  1(1):[WWW]说: 小子，上次对你手下留情，*你居然还敢再来，是不是活*得不耐烦了！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(72,3,0,0) ==false then    --  6(6):战斗[72]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,-2,-2,-2,451,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,16,-2,-2,474,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,-2,-2,474,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,18,-2,-2,474,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1618,0,1);   --  1(1):[WWW]说: 老伯，我看下一次的华山论*剑，你还是别参加了，继续*再苦练吧．
    instruct_0();   --  0(0)::空语句(清屏)
--end

