--function oldevent_254()
    instruct_1(834,31,0);   --  1(1):[丹青生]说: 二哥，就是这个後辈小生来*找麻烦，*你一定要帮我们报仇．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(835,33,0);   --  1(1):[黑白子]说: 不会吧？这个小朋友看起来*”古意．古意”，不像是来*找碴的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(836,0,1);   --  1(1):[WWW]说: 还是二庄主明事理．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(837,32,0);   --  1(1):[秃笔翁]说: 二哥，你不要让这小子给骗*了，他说我们梅庄中．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(838,33,0);   --  1(1):[黑白子]说: 好了，四弟，*不要再多说了．*少侠你先请回吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,9,-2,-2,255,258,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,-2,-2,256,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,-2,-2,257,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
--end

