--function oldevent_908()
    instruct_3(-2,-2,-2,-2,-1,-1,-1,2492,2492,2492,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(171,100);   --  2(2):得到物品[药材][100]
    instruct_2(22,1);   --  2(2):得到物品[黄连解毒丸][1]
    instruct_2(23,1);   --  2(2):得到物品[天心解毒丹][1]
    instruct_2(24,1);   --  2(2):得到物品[回阳五龙膏][1]
    instruct_2(25,1);   --  2(2):得到物品[牛黄血竭丹][1]
    instruct_2(26,1);   --  2(2):得到物品[六阳正气丹][1]
    instruct_2(186,2);   --  2(2):得到物品[智慧果][2]

    if instruct_16(2,0,1) ==true then    --  16(10):队伍是否有[程灵素]否则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_37(-3);   --  37(25):增加道德-3
--end

