--function oldevent_990()

    if instruct_60(80,1,6068,0,21) ==true then    --  60(3C):判断场景80事件位置1是否有贴图6068否则跳转到:Label0
        instruct_1(2968,0,1);   --  1(1):[WWW]说: 杨兄，请你先回神鵰穴中，*若有需要你帮忙时，我再去*找你．
        instruct_21(58);   --  21(15):[杨过]离队
        instruct_3(7,6,1,1,991,-1,-1,6186,6186,6186,0,-2,-2);   --  3(3):修改事件定义:场景[山洞]:场景事件编号 [6]
        do return; end
    end    --:Label0

    instruct_1(2807,0,1);   --  1(1):[WWW]说: 杨兄，请你先回古墓，*若有需要你帮忙时，我再去*找你．
    instruct_21(58);   --  21(15):[杨过]离队
    instruct_3(18,0,1,1,991,-1,-1,6188,6188,6188,0,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [0]
    instruct_17(18,1,44,31,0);   --  17(11):修改场景贴图:场景[古墓]层1坐标2C-1F
    instruct_17(18,1,44,30,0);   --  17(11):修改场景贴图:场景[古墓]层1坐标2C-1E
--end

