--function oldevent_527()
    instruct_1(1929,0,1);   --  1(1):[WWW]说: 乔帮主，我听别人说，*”天龙八部”一书是在丐帮*手中，此事当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1930,50,0);   --  1(1):[乔峰]说: 没错．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1931,0,1);   --  1(1):[WWW]说: 还请乔帮主能借我此书，因*为此书关系到我的未来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1932,50,0);   --  1(1):[乔峰]说: 少侠可知我丐帮的绝技？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1933,0,1);   --  1(1):[WWW]说: 素闻丐帮”降龙十八掌”威*猛淩厉，是天下掌法第一．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1934,50,0);   --  1(1):[乔峰]说: 是的．*因为我丐帮与这”龙”字有*点缘份，所以本帮的前辈在*当时就取得了十四天书中的*”天龙八部”，当做镇帮之*宝留传至今，并引以为傲．*我乔峰身为丐帮帮主，*你说，我怎麽将它给你呢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1935,0,1);   --  1(1):[WWW]说: 这．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1936,50,0);   --  1(1):[乔峰]说: 不过，这事也并不是无解．*因为此书原来的主人并不是*丐帮，所以我也不会强占．*当初本帮曾定下规矩，若有*人能打嬴丐帮的”降龙十八*掌”，他就比丐帮更有资格*拥有此书．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1937,0,1);   --  1(1):[WWW]说: 你是说．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1938,50,0);   --  1(1):[乔峰]说: 只要你凭一己之力，能打败*我乔峰，丐帮必当无条件奉*上”天龙八部”一书．*你准备好时就跟我说一声．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,528,-2,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

