--function oldevent_103()
    instruct_1(400,17,0);   --  1(1):[王难姑]说: 你是谁？怎麽进来的？*金花婆婆呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(401,0,1);   --  1(1):[WWW]说: 在下只是路过此岛，*不小心跟那老太婆打一架．**打赢後，那老太婆好像以为*我是来救人的，所以就．．*不知前辈为何在此？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(402,17,0);   --  1(1):[王难姑]说: 我叫王难姑，是蝶谷医仙胡*青牛的妻子．那老太婆则是*这灵蛇岛的岛主金花婆婆．*多年以前，我先生因为一些*缘故，没有医治一位银叶先*生，後来听说他病逝了．*其实，这位银叶先生就是金*花婆婆的丈夫．**几天前，这个金花婆婆为了*报仇，来到我蝴蝶谷中，打*伤我丈夫，并把我掳到这岛*上，说要让我夫妇俩也嚐嚐*生离死别的痛苦．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(403,0,1);   --  1(1):[WWW]说: 原来是这麽一回事．*好了，现在没事了，*前辈可以回蝴蝶谷了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(404,17,0);   --  1(1):[王难姑]说: 谢谢少侠相助，我夫妇俩不*会忘记少侠的恩情．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(405,0,1);   --  1(1):[WWW]说: 那里，那里，*路见不平，拔刀相助，*本是我辈中人该做的事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(406,17,0);   --  1(1):[王难姑]说: 好，那我先回蝴蝶谷了，*待少侠有空时，*一定要到我蝴蝶谷中作客．*对了，我蝴蝶谷极为隐密，*一般人不易找到，它的座标*是在（２３８，２１９）．*你一定要来哦！*我和外子一定要送你些东西*来报答你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(407,0,1);   --  1(1):[WWW]说: 前辈慢走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(44,1,1,1,123,-1,-1,5290,5290,5290,-2,-2,-2);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [1]
    instruct_3(44,0,-2,-2,95,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[蝴蝶谷]:场景事件编号 [0]
    instruct_14();   --  14(E):场景变黑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_37(2);   --  37(25):增加道德2
--end

