--function oldevent_961()
    instruct_1(2733,25,0);   --  1(1):[蓝凤凰]说: 这麽久都不来看我，可想死*人家了．*这次来是不是来带我走的．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(2734,0,1);   --  1(1):[WWW]说: 没有．*经过你这边，顺路进来看看*你．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(2735,0,1);   --  1(1):[WWW]说: 我这不是来了吗．*走吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label1
        instruct_1(175,25,0);   --  1(1):[蓝凤凰]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(2736,25,0);   --  1(1):[蓝凤凰]说: 真的，没骗我．*我原以为你也是个负心汉，*看来是误会你了．走吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(25);   --  10(A):加入人物[蓝凤凰]
--end

