--function oldevent_154()
    instruct_1(577,0,1);   --  1(1):[WWW]说: 前辈就是张三丰太师父吗，*晚辈叩见．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(578,5,0);   --  1(1):[张三丰]说: 正是老朽．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(579,0,1);   --  1(1):[WWW]说: 晚辈实在荣幸万分，能见到*张前辈．要知道我们那里的*人，对大师十分的推崇，*可说是我中国武林史上，*一位承先启後，继往开来的*大宗师．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(580,5,0);   --  1(1):[张三丰]说: 那里，那里．*不知小兄弟是打那来的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(581,0,1);   --  1(1):[WWW]说: 说起来大师可能也不懂，*因为你们现在的人可能无法*理解．*我是来自另一个世界的人，*在那里，你们这些人的事情*都只是一个传说．*我这样说，前辈大概也听不*懂吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(582,5,0);   --  1(1):[张三丰]说: 我记得在我年轻时，曾与先*师觉远遇见过一个奇人，*你的话似乎与他相似．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(583,0,1);   --  1(1):[WWW]说: 你也遇见过他呀！我也是听*人家谈起过他的事情，才想*找寻一些东西，看是不是对*我有些帮助．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(584,5,0);   --  1(1):[张三丰]说: 小兄弟提的是几本书吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(585,0,1);   --  1(1):[WWW]说: 前辈也知道”十四天书”？*不知前辈是否知道这些书的*下落？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(586,5,0);   --  1(1):[张三丰]说: 老朽淡出江湖已久，所以并*不太清楚这些书的下落．小*兄弟似乎急於获得这些书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(587,0,1);   --  1(1):[WWW]说: 这些书对我的”未来”有很*大的帮助，所以我急於找齐*这些书．*无奈江湖上的人一直以为这*些书是什麽高深武功秘笈，*所以在一番激烈的你争我夺*下，不知这些书现今流落到*何方了．**但据我的了解，这些书并不*是什麽武功秘笈．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(588,5,0);   --  1(1):[张三丰]说: 其实练武原本只是一种强健*体魄的方法，**但如今的人都拿它做为一种*争强好胜的工具，实在是一*种错误的观念．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(589,0,1);   --  1(1):[WWW]说: 但我觉得武功有时也蛮有用*处的．**像我在江湖行走的过程中，*若没有高强的武功，可能老*早就挂了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(590,5,0);   --  1(1):[张三丰]说: 唉！若是人人都不比谁的武*功高强，世上不知会少了多*少杀戮．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(591,0,1);   --  1(1):[WWW]说: 但有时练武对人来说，也是*会让人着迷的，就好像棋奕*一般．*只不过在武功的印证上，较*容易造成身体的伤害．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(592,5,0);   --  1(1):[张三丰]说: 练武之人，除了外在的身体*力求强健外，其实更重要的*是要练武者的心．*练武者要能克制自己的好斗*慾望，以及常保一副侠义心*肠，除恶仗义，济弱扶倾，*将武学用到该用的地方，*这才是练武的真谛．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(593,0,1);   --  1(1):[WWW]说: 前辈说的极是，*晚辈将永记在心．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(594,5,0);   --  1(1):[张三丰]说: 你在江湖闯荡的过程中，若*能维持侠义的心，老朽倒是*愿意跟你切磋切磋武学．*看看能不能对你有些帮助．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(595,0,1);   --  1(1):[WWW]说: 真的吗？*能得到前辈的指点，*晚辈将一生受用无穷．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(596,5,0);   --  1(1):[张三丰]说: 记着一件事，习武之人要常*保有一副侠义心肠．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,155,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

