--function oldevent_533()
    instruct_1(1981,0,1);   --  1(1):[WWW]说: 老先生，怎麽一个人坐在这*下棋，这棋一个人下的起来*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1982,52,0);   --  1(1):[苏星河]说: 小兄弟，难道你对我这*”珍珑”也有兴趣？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1983,0,1);   --  1(1):[WWW]说: ”珍珑”？*哦，是不是类似那种摆在公*园，要人来破解这盘棋的生*意．若能解开的话，就有一*些奖品．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1984,52,0);   --  1(1):[苏星河]说: 小兄弟说些什麽，老朽不太*清楚，不过这”珍珑”是有*点像你所说的意味．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1985,0,1);   --  1(1):[WWW]说: 这盘局很难解吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1986,52,0);   --  1(1):[苏星河]说: 这个珍珑棋局乃先师所设．*先师当年穷三年之心血，这*才布成，深盼当世棋道中的*知心之士，予以破解．*老朽三十年来苦加钻研，皆*未能参解得透．*精通禅理之人，自知禅宗要*旨，在於”顿悟”．穷年累*月的苦功，未必能及具有宿*根慧心之人的一见即悟．*棋道也是一般，才气横溢的*八九岁小儿，棋枰上往往能*胜一流高手．虽然老朽参研*不透，但天下才士甚众，未*必都破解不得．*先师当年留下了这个心愿，*倘若有人破解开了，完了先*师这个心愿，先师虽已不在*人世，泉下有知，也必大感*欣慰．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1987,0,1);   --  1(1):[WWW]说: 可惜晚辈棋力不佳，否则我*倒也想试一试．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1988,52,0);   --  1(1):[苏星河]说: 这棋原是极难，棋力不弱之*人，若解不开甚至有可能走*火入魔．*公子就别勉强自己了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,534,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

