--function oldevent_275()
    instruct_1(911,0,1);   --  1(1):[WWW]说: 四位那麽好的闲情逸致聚在*这儿，是不是准备打麻将，*插花收不收啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(912,33,0);   --  1(1):[黑白子]说: 你这臭小子，看你做了什麽*好事？还敢在这说风凉话．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(913,34,0);   --  1(1):[黄钟公]说: 我早该知道天底下那有这麽*好的事情，原来这一切都是*你设计出来的诡计．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(914,32,0);   --  1(1):[秃笔翁]说: 你这小子，竟然利用我们所*好，实在太可恶了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(915,0,1);   --  1(1):[WWW]说: 你们在那你一言我一句的，*唱双簧啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(916,32,0);   --  1(1):[秃笔翁]说: 小子，你真是太大胆了，*竟敢把任老怪给放了，*看我饶不饶你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(917,0,1);   --  1(1):[WWW]说: 喂！喂！你们在说什麽啊？*我还没说你们偷走我那四样*宝物，你们就恶人先告状．*真是岂有此理，*什麽态度嘛．．．．*况且我那有放走任前辈．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(918,33,0);   --  1(1):[黑白子]说: 大哥，别跟这小子罗嗦了，*此时再也顾不得什麽以老欺*小的狗屁道义了．*先将这小子捉上黑木崖，向*东方教主请罪，否则咱们可*就吃不完兜着走了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(919,34,0);   --  1(1):[黄钟公]说: 好，咱们一起上．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(920,0,1);   --  1(1):[WWW]说: 谁怕谁！乌龟怕铁鎚！*四个一起上最好，*省得我麻烦．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(921,31,0);   --  1(1):[丹青生]说: 小子你找死！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(47,3,0,0) ==false then    --  6(6):战斗[47]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(933,32,0);   --  1(1):[秃笔翁]说: 小子，*你可知你放走的是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(934,0,1);   --  1(1):[WWW]说: 他不是你们请来的打手吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(935,31,0);   --  1(1):[丹青生]说: 你是真不知还是假不知，*你放走了任老怪，就是与东*方教主和我日月神教为敌．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(936,0,1);   --  1(1):[WWW]说: 你们是日月神教的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(937,33,0);   --  1(1):[黑白子]说: 不错，我们是奉教主之命，*在此看守任老怪的，你居然*利用我们的弱点救他出去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(938,34,0);   --  1(1):[黄钟公]说: 别说了，得赶紧回黑木崖向*东方教主报告这件事．*走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,20,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,21,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,22,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,24,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,12,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(8);   --  56(38):提高声望值8
--end

