--function oldevent_517()
    instruct_17(-2,1,25,14,2916);   --  17(11):修改场景贴图:当前场景层1坐标19-E
    instruct_17(-2,1,25,15,4866);   --  17(11):修改场景贴图:当前场景层1坐标19-F
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1868,0,1);   --  1(1):[WWW]说: 咦！这蒲团下居然藏有一本*书，运气真好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_17(-2,1,25,15,0);   --  17(11):修改场景贴图:当前场景层1坐标19-F
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(44,1);   --  2(2):得到物品[洗髓经][1]
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
--end

