--function oldevent_508()
    instruct_1(2193,0,1);   --  1(1):[WWW]说: 诸位大师，我想进少林寺参*观一下，可以吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1819,96,0);   --  1(1):[???]说: 请施主先将兵刃留下，待下*山前我们再归还予你．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1820,0,1);   --  1(1):[WWW]说: 对了，这是少林寺千年下来*的传统，以表示对少林寺的*尊重．好，我就将兵刃．．*＜等等，武侠小说中的主角*向来都不吃这一套的，若我*这麽听话，那戏还有什麽好*看的．．．＞***等会，这兵刃向来不与我离*身，我不能将兵刃放下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1821,96,0);   --  1(1):[???]说: 那就请施主下山．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(62,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(1825,0,1);   --  1(1):[WWW]说: 好，好，我下回再来．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,3,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,4,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,5,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,6,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        do return; end
    end    --:Label0

    instruct_1(1822,0,1);   --  1(1):[WWW]说: 可是我还是想进去看看，*对不住了．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(79,69,0,1) ==false then    --  6(6):战斗[79]是则跳转到:Label1
        instruct_3(-2,3,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,4,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,5,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,6,-2,-2,522,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1824,96,0);   --  1(1):[???]说: 请施主下山．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1822,0,1);   --  1(1):[WWW]说: 可是我还是想进去看看，*对不住了．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,5,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(2);   --  56(38):提高声望值2
--end

