--function oldevent_411()
    instruct_1(1416,64,0);   --  1(1):[周伯通]说: 来来来，最近有没有学会新*武功，跟老顽童来玩两招．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1417,0,1);   --  1(1):[WWW]说: ＜如此好武又天真的人，*  他该不会就是周伯通＞**前辈是周伯通周前辈吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1418,64,0);   --  1(1):[周伯通]说: 是啊，我就是周伯通啊，*不过大家都叫我老顽童．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1419,0,1);   --  1(1):[WWW]说: 前辈，我带你去见一个人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1420,64,0);   --  1(1):[周伯通]说: 去见谁啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1421,0,1);   --  1(1):[WWW]说: 我说出此人的名字来，*你可不许拂袖便走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1422,64,0);   --  1(1):[周伯通]说: 世间我有两个人不见．*一位是段皇爷，一位是他的*贵妃瑛姑．*除了这二人之外，我老顽童*谁都见得．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1423,0,1);   --  1(1):[WWW]说: ＜看来只有使个激将之计＞*原来你曾输在他们手里，武*功不及，因此害怕见他们．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1424,64,0);   --  1(1):[周伯通]说: 不是，不是！老顽童行事卑*鄙下流，对不起他二人，因*此没脸和他们相见．*段皇爷甚至连皇帝也不做而*去做和尚，可见我实在对不*起他之极了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1425,0,1);   --  1(1):[WWW]说: 一灯大师之所以出家，是为*了对你不起，不是你对他不*起，难道你不知道麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1426,64,0);   --  1(1):[周伯通]说: 他有什麽对不起我的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1427,0,1);   --  1(1):[WWW]说: 只为旁人害你儿子，*他狠心见死不救．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1428,64,0);   --  1(1):[周伯通]说: 什麽我的儿子？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1429,0,1);   --  1(1):[WWW]说: 你和瑛姑生的孩子啊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1430,64,0);   --  1(1):[周伯通]说: 什麽！*我有儿子！．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1431,0,1);   --  1(1):[WWW]说: 周老前辈，瑛姑如此这般思*念你，你始终不肯和他相见*，於心何忍？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1432,64,0);   --  1(1):[周伯通]说: 她在那里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1433,0,1);   --  1(1):[WWW]说: 他现正居住在黑龙潭，在铁*掌山的南边．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1434,0,1);   --  1(1):[WWW]说: 咦，老顽童呢？*怎麽一溜烟的就不见了，*希望是去找瑛姑了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(21,2,1,1,424,-1,-1,6154,6154,6154,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [2]
    instruct_3(21,1,1,1,423,-1,-1,6158,6158,6158,-2,-2,-2);   --  3(3):修改事件定义:场景[黑龙潭]:场景事件编号 [1]
    instruct_17(21,1,22,26,0);   --  17(11):修改场景贴图:场景[黑龙潭]层1坐标16-1A
    instruct_37(3);   --  37(25):增加道德3
--end

