--function oldevent_599()
    instruct_1(2218,0,1);   --  1(1):[WWW]说: 兄弟，你是谁，怎麽会被关*在这？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2219,37,0);   --  1(1):[狄云]说: 兄台为何来救狄云这不幸之*人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2220,0,1);   --  1(1):[WWW]说: 我只是看这些秃子不爽，*打着打着就打到这边来了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2221,37,0);   --  1(1):[狄云]说: 那兄台还是赶紧离去，和我*这不幸之人在一起，你会倒*楣的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2222,0,1);   --  1(1):[WWW]说: 兄弟怎麽这麽说．虽说我是*糊里糊涂的救到你，但出门*在外，本应互相扶持的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2223,37,0);   --  1(1):[狄云]说: 可是．．可是．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2224,0,1);   --  1(1):[WWW]说: 你到底发生了什麽事，说来*听听．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2225,37,0);   --  1(1):[狄云]说: 几年前，我随师父和师妹到*荆州去为我万震山万师叔祝*寿，但後来却被师叔他们诬*赖我勾结盗匪，偷了他万家*的金银珠宝，并意图非礼小*师娘．*而县府大人也没明察秋毫，*就把我关了起来．**後来听说我师父死了，我师*妹．．．师妹她．．她．．*竟嫁给了万师兄．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2226,0,1);   --  1(1):[WWW]说: 你很爱你师妹，是吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2227,37,0);   --  1(1):[狄云]说: 我师妹怎能．．．．．．．*怎能嫁给那个姓万的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2228,0,1);   --  1(1):[WWW]说: 那你後来怎麽离开那荆州大*牢，又怎麽被关在这里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2229,37,0);   --  1(1):[狄云]说: 在狱中的几年，同牢的丁典*丁大哥告诉了我许多江湖上*的事，也教了我”神照经”*大法，说是可以提昇内力．***突然有一天，丁大哥带我逃*狱，说要去看一位朋友．*但想不到是丁大哥的红粉知*己死了，而她父亲，也就是*荆州府尹，居然在她女儿的*棺木上下毒，为的就是要害*死丁大哥，丁大哥後来就中*毒死了．**而我虽然逃走了，但是後来*又被这些番僧给捉了来，关*在这儿．*你看我是不是个不幸之人，*跟我在一起的全都没有好下*场．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2230,0,1);   --  1(1):[WWW]说: 快别这麽说，*你只是比较”衰”而已．**今後你有什麽打算吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2231,37,0);   --  1(1):[狄云]说: 我只想回老家湘西麻溪铺去*看看．**我还记得那里有个山洞，是*我和师妹以前儿时常去玩的*地方．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2232,0,1);   --  1(1):[WWW]说: 那里好玩吗？*改天我也去看看．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2233,37,0);   --  1(1):[狄云]说: 那里不好找的，平常人都不*知道．**我记得路旁有个石头，写着*几个数字”３６４２７９”*的，蛮新鲜的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,600,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号

    if instruct_9(1,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(2234,0,1);   --  1(1):[WWW]说: 这样好了，你要不要和我一*起走，路上也有个照应．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,60,100,6,0) ==false then    --  28(1C):判断WWW品德60-100是则跳转到:Label1
        instruct_1(2236,37,0);   --  1(1):[狄云]说: 不了！*我这个不幸之人还是别害人*的好．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,37,0);   --  1(1):[狄云]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(2235,37,0);   --  1(1):[狄云]说: 好吧！如果你不怕被我这个*不幸之人连累的话．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(37);   --  10(A):加入人物[狄云]
    instruct_37(3);   --  37(25):增加道德3
--end

