--function oldevent_61()

    if instruct_4(190,1,0) ==false then    --  4(4):是否使用物品[明教铁焰令]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(190,-1);   --  32(20):物品[明教铁焰令]+[-1]
    instruct_1(204,13,0);   --  1(1):[谢逊]说: 摸这形状，似乎是我明教的*铁焰令？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(205,0,1);   --  1(1):[WWW]说: 前辈就是金毛狮王谢逊吧．*我找前辈好久了，你们明教*的弟兄也正在找你．*你再不回去，明教就要四分*五裂了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(206,13,0);   --  1(1):[谢逊]说: 你说什麽！*我明教的弟兄怎麽了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(207,0,1);   --  1(1):[WWW]说: 现在是没怎麽样，六大派围*攻光明顶之危刚解决，六大*派的人近期内决不敢造次．*但是教中一日无主，彼此又*都不服对方，只怕时日一久*明教又会让人乘虚而入了．*事情的详细经过是这样的*．．．．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(208,13,0);   --  1(1):[谢逊]说: 成崑这个老贼，不但与我有*不共戴天之仇，更是我明教*之大敌，我非杀了他不可．*本以为拿了这把号令天下的*屠龙刀，找出刀中的秘密後*便能杀了他．*但我钻研了十几年，始终无*法了解此刀之神奇奥妙．**唉！一日不解开此刀秘密，*我就一日不离开冰火岛．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(209,0,1);   --  1(1):[WWW]说: 前辈别担心这麽多，*还是先随我回归中原，*大家一起想个法子．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(210,13,0);   --  1(1):[谢逊]说: 别说了，你走吧．*一日不杀掉成崑，我是不会*回明教的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,-2,65,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(9,0,0,0,-1,-1,91,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [0]
    instruct_3(9,1,1,1,-1,-1,-1,5296,5296,5296,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [1]
    instruct_3(9,2,1,1,-1,-1,-1,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [2]
    instruct_3(9,3,1,1,-1,-1,-1,6788,6788,6788,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [3]
    instruct_3(9,4,1,1,-1,-1,-1,5892,5892,5892,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [4]
--end

