--function oldevent_595()
    instruct_1(2216,91,0);   --  1(1):[???]说: 小子，竟敢擅闯我大轮寺，*找死！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2217,0,1);   --  1(1):[WWW]说: 小爷我就爱到处逛逛，你们*这些秃子管不着．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(91,3,0,0) ==false then    --  6(6):战斗[91]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(1);   --  56(38):提高声望值1
--end

