--function oldevent_718()

    if instruct_4(186,1,0) ==false then    --  4(4):是否使用物品[智慧果]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(186,-1);   --  32(20):物品[智慧果]+[-1]
    instruct_1(2618,73,0);   --  1(1):[南贤]说: ”连城诀”一书原本是在铁*骨墨萼梅念笙手上．此人有*三个弟子，大弟子名叫万震*山，二弟子叫言达平，三弟*子叫戚长发．**但没想到後来他的三个徒弟*因觊觎此书，联手起来将他*杀了．*而万震山，言达平，戚长发*三人也因互相猜忌，勾心斗*角了许久．*到後来这三人都陆续消失，*应是与争夺此书有关，而此*书最後的下落也不得而知．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,0,0,1,0);   --  26(1A):增加场景事件编号的三个触发事件编号
--end

