--function oldevent_910()
    instruct_3(-2,-2,-2,-2,-1,-1,-1,2492,2492,2492,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(171,200);   --  2(2):得到物品[药材][200]
    instruct_2(5,4);   --  2(2):得到物品[玉真散][4]
    instruct_2(6,4);   --  2(2):得到物品[三黄宝腊丹][4]
    instruct_2(186,2);   --  2(2):得到物品[智慧果][2]

    if instruct_16(45,0,1) ==true then    --  16(10):队伍是否有[薛慕华]否则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_37(-1);   --  37(25):增加道德-1
--end

