--function oldevent_77()
    instruct_1(252,0,1);   --  1(1):[WWW]说: ＜哇！这里戒备森严，*如临大敌似的，*我可得小心一点．＞*小弟远从中原来到这西域，*请问这里就是明教吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(253,80,0);   --  1(1):[???]说: 从中原来的？*想必是六大派的爪牙．*竟敢如此大摇大摆走进来，*莫非欺我明教无能人？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(254,0,1);   --  1(1):[WWW]说: 我．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(255,80,0);   --  1(1):[???]说: 先拿下再说！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(8,0,47,0) ==true then    --  6(6):战斗[8]否则跳转到:Label0
        instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_56(2);   --  56(38):提高声望值2
        do return; end
    end    --:Label0

    instruct_15(83);   --  15(F):战斗失败，死亡
--end

