--function oldevent_476()
    instruct_1(1647,0,1);   --  1(1):[WWW]说: 这位小哥，我初到此地，*不知这附近有那里好玩的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1648,53,0);   --  1(1):[段誉]说: 我听人家说，西去有个无量*山，风景清幽，在下也正准*备前往一游．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1649,0,1);   --  1(1):[WWW]说: 不知兄台如何称呼，怎麽一*人在外游荡？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1650,53,0);   --  1(1):[段誉]说: 在下姓段，单名一个誉字．*其实，我是从家里面逃出来*的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1651,0,1);   --  1(1):[WWW]说: 你干麽要从家里逃出来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1652,53,0);   --  1(1):[段誉]说: 爹爹要教我练武功，我不大*想练．後来他逼的紧了，我*只得逃走．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1653,0,1);   --  1(1):[WWW]说: 你爹爹教你什麽武功？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1654,53,0);   --  1(1):[段誉]说: 叫什麽”六脉神剑”的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1655,0,1);   --  1(1):[WWW]说: 这武功听起来好像很厉害的*样子，你为什麽不肯学，是*怕辛苦吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1656,53,0);   --  1(1):[段誉]说: 辛苦我才不怕呢．*我从小受了佛戒，这十多年*来，我学的都是儒家的仁人*之心，推己及人．佛家的戒*杀戒嗔，慈悲为怀．**忽然爹爹要我练武，学打人*杀人的法子，我自然觉得不*对头．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1657,0,1);   --  1(1):[WWW]说: 可是如果你不会武功，看见*有人被欺负，而你又想救他*时，怎麽办？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1658,53,0);   --  1(1):[段誉]说: 那我会大大的晓谕他一番，*不许他们这样胡乱杀人．要*知冤家宜解不宜结，何况凶*杀斗狠，有违国法，若叫官*府知道，大大的不妥．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1659,0,1);   --  1(1):[WWW]说: ＜这小子似乎有点秀逗＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,-2,-2,477,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,8,-2,-2,477,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(1663,0,1);   --  1(1):[WWW]说: 好了，不打扰兄台了．*他日有缘，再一同游山玩水*吧．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1660,0,1);   --  1(1):[WWW]说: 不知兄台是否愿与我同行，*前往那无量山一游？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,40,100,6,0) ==false then    --  28(1C):判断WWW品德40-100是则跳转到:Label1
        instruct_1(1662,53,0);   --  1(1):[段誉]说: 嗯．．．我还有些事要办，*恐怕无法与阁下同行．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,53,0);   --  1(1):[段誉]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(1661,53,0);   --  1(1):[段誉]说: 好啊，有个人做伴，路上也*有个照应．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,8,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(53);   --  10(A):加入人物[段誉]
--end

