--function oldevent_821()
    instruct_1(2565,73,0);   --  1(1):[南贤]说: 少年人，你终於来了，*老朽已等候多时．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2566,0,1);   --  1(1):[WWW]说: 你知道我要来，*这果然是个安排好的游戏．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2567,73,0);   --  1(1):[南贤]说: 游戏？*人生本来就是一场场的戏，*不是吗？*不过这是不是安排好的游戏*老朽就不得而知了，只是有*人似乎知道你要来罢了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2568,0,1);   --  1(1):[WWW]说: 有人知道我要来？是谁？*是谁知道我要来！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2569,73,0);   --  1(1):[南贤]说: 三十年前，武林中冒出来一*个言谈举止都很怪异的年轻*人．对了，就像你一样．*他口口声声说他来自另一个*世界，叫什麽”未来”的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2570,0,1);   --  1(1):[WWW]说: 他在那里，快告诉我，*我要见他．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2571,73,0);   --  1(1):[南贤]说: 他已经不在了，*恐怕阁下找他不着．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2572,0,1);   --  1(1):[WWW]说: 什麽？他已经死了？*完了，完了，我离不开这个*鬼地方了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2573,73,0);   --  1(1):[南贤]说: 阁下切莫慌乱，他并非真的*死了，而是凭空消失了．*据他的讲法，是回去了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2574,0,1);   --  1(1):[WWW]说: 回去了，他怎麽回去的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2575,73,0);   --  1(1):[南贤]说: 话说起来就长了！***当初这位年轻人，起先武功*也只是平平，但後来不知有*什麽机缘，练成绝世武功，*连连打败武林各大高手，技*压群雄，成为武林中一个不　*败的神话．*除了一身盖世武功外，此人*也有另一个雅好，就是喜欢*舞笔弄章．*据说在这些年间，他遍游各*地，写下所闻所见，最後完*成十四部作品．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2576,0,1);   --  1(1):[WWW]说: 十四部作品？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2577,73,0);   --  1(1):[南贤]说: 这十四部作品在他要离开前*曾放在个极隐秘的地方，*供每一届的武林盟主保管．*但在他离去後不久，一些野*心家就联合起来，将这些书*籍盗了出去．*因为大家都怀疑这十四部书*其实就是记载他绝世武功的*秘笈．*在经过一阵你争我夺，天昏*地暗的杀戮後，十四部书现*今也不知流落到何处了．*大家只记得他曾经说过的二*句话，据说跟这十四本书有*极大的牵连．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2578,0,1);   --  1(1):[WWW]说: 那二句话？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2579,73,0);   --  1(1):[南贤]说: ”飞雪连天射白鹿，*  笑书神侠倚碧鸳”
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2580,0,1);   --  1(1):[WWW]说: 说了这麽多，我到底要怎麽*回去呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2581,73,0);   --  1(1):[南贤]说: 说实在的，老朽也不知道，*但是老朽知道的是，他离开*时的地点是在原先保管十四*部书的圣堂，到那里去可能*会有点眉目．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2582,0,1);   --  1(1):[WWW]说: ”圣堂”又在何处？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2583,73,0);   --  1(1):[南贤]说: 那只有武林盟主才知道了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2584,0,1);   --  1(1):[WWW]说: 武林盟主？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2585,73,0);   --  1(1):[南贤]说: 是的．每年在华山顶上都会*举行一场武林大会，大家都*称之为”华山论剑”*会中大家以武艺决定高下，*争夺那武林盟主的宝座．**但并不是每一个人都可以参*这场盛宴，唯有声望到达一*定程度的人，才会被邀请．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2586,0,1);   --  1(1):[WWW]说: 那你又如何知道我会来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2587,73,0);   --  1(1):[南贤]说: 是那个人告诉我的．***在要离去的前一晚，他来到*我这里，告诉我他隔天要前*往圣堂，离开这个世界．*而将来有一天，或许会有个*跟他一样的人来到这里，要*我必须尽全力的帮助此人．*这就是为什麽我知道他离去*时的地点，以及知道你会来*的原因了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2588,0,1);   --  1(1):[WWW]说: 你要如何帮我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2589,73,0);   --  1(1):[南贤]说: 我所有的就是智慧了．*所以我只能告诉你一些我知*道的事．*不过你每次必须用一颗*”智慧果”来交换，证明你*修练的成绩．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2590,0,1);   --  1(1):[WWW]说: 天下没有白吃的午餐！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2591,73,0);   --  1(1):[南贤]说: 对了，金先生留了一样东西*给你，就在那边的柜子里，*说对你旅程有很大的帮助．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2592,0,1);   --  1(1):[WWW]说: 你说他姓金？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2593,73,0);   --  1(1):[南贤]说: 什麽金，我有说吗？*该说的我都说了，*祝你旅途愉快．*下次来记得带智慧果．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_54();   --  54(36):开放其它场景
    instruct_3(-2,-2,-2,-2,822,701,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,-2,-2,824,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,825,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
--end

