--function oldevent_251()
    instruct_1(812,31,0);   --  1(1):[丹青生]说: 三哥，就是这家伙．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(813,32,0);   --  1(1):[秃笔翁]说: 看少侠年纪轻轻，想不到武*功竟能够凌驾我四弟之上，*真是英雄出少年．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(814,0,1);   --  1(1):[WWW]说: 不敢当，想必阁下是三庄主*秃笔翁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(815,32,0);   --  1(1):[秃笔翁]说: 正是老夫．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(816,31,0);   --  1(1):[丹青生]说: 三哥，你一定要帮我出这口*气，将那幅”谿山行旅图”*给抢过来．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(817,32,0);   --  1(1):[秃笔翁]说: 四弟，你自己丢的面子还不*够啊！*这位少侠，老夫不送了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,6,-2,-2,252,253,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,-2,-2,252,253,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,-2,-2,280,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
--end

