--function oldevent_420()
    instruct_1(1325,0,1);   --  1(1):[WWW]说: 前辈，我已将段皇爷杀了，*请前辈告知”射鵰英雄传”*一书的下落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1326,66,0);   --  1(1):[瑛姑]说: 你已经把他杀了．．．．．*哈！哈！你已经把他杀了，*哈！哈！我的仇终於报了．*”射鵰英雄传”一书是在桃*花岛郭靖的手上，要知那桃*花岛是黄老邪按五行八卦布*置而成的，一般人是很难找*到入口的，我就告诉你吧．*　　　*它的座标位置是在*（３４１，１３８）．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,422,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_39(75);   --  39(27):打开场景桃花岛
--end

