--function oldevent_402()
    instruct_1(1538,63,0);   --  1(1):[程英]说: 这位公子，不知来小女子程*英家中所为何事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1539,0,1);   --  1(1):[WWW]说: 在下浪迹天涯寻找一些书，*途经姑娘家门外，想说进来*碰碰运气．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1540,63,0);   --  1(1):[程英]说: 不知公子找些什麽东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1541,0,1);   --  1(1):[WWW]说: 不瞒姑娘，在下找寻的是江*湖中传说的”十四天书”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1542,63,0);   --  1(1):[程英]说: ”十四天书”？我也曾听人*提起过，听说是很久以前的*一位前辈所遗留下来的．*不过我倒是不知这些书的下*落．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1543,0,1);   --  1(1):[WWW]说: 是啊，知道这些书下落的人*也不多．**姑娘家中就只一个人吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1544,63,0);   --  1(1):[程英]说: 自从和家师黄岛主分开後，*我就一个人在此定居．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1545,0,1);   --  1(1):[WWW]说: 原来姑娘是东邪黄药师的高*徒，那武功一定不错了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1546,63,0);   --  1(1):[程英]说: 那里，我资质太差，没能学*到师父武功的精髓，只学会*一些奇门五行之术．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1547,0,1);   --  1(1):[WWW]说: 原来姑娘还懂奇门五行之术*，这对闯荡江湖很有用呢．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1548,63,0);   --  1(1):[程英]说: 是有点用处，有些平常人看*不出的布局，我略懂一些．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,403,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号

    if instruct_9(6,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        instruct_1(1551,0,1);   --  1(1):[WWW]说: 打扰姑娘多时，在下告退．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1549,0,1);   --  1(1):[WWW]说: 那程姑娘可否与在下一游，*帮忙在下寻找那十四天书？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,65,100,6,0) ==false then    --  28(1C):判断WWW品德65-100是则跳转到:Label1
        instruct_1(1552,63,0);   --  1(1):[程英]说: 我看公子脸上泛有戾气，公*子还是多做些善事才是．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,63,0);   --  1(1):[程英]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(1550,63,0);   --  1(1):[程英]说: 嗯！好吧．*反正我一人在此也是无聊，*就随公子一游吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(63);   --  10(A):加入人物[程英]
    instruct_37(2);   --  37(25):增加道德2
--end

