--function oldevent_536()
    instruct_1(2021,0,1);   --  1(1):[WWW]说: 贤弟，这是怎麽一回事？*那躺在地上的老人又是谁？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2022,49,0);   --  1(1):[虚竹]说: 我自己也迷糊了．*我走进这房子後，屋内有个*老人，他说我福缘深厚，破*解了这盘棋局．接着硬化去*了我原有的武功，并将他七*十余年的功力注入我体内．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2023,0,1);   --  1(1):[WWW]说: 有这种事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2024,49,0);   --  1(1):[虚竹]说: 他还叫我去杀了星宿老怪丁*春秋．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2025,0,1);   --  1(1):[WWW]说: 苏前辈，这是怎麽回事？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2026,52,0);   --  1(1):[苏星河]说: 事情是这样子的．*本派乃逍遥派，师父收了我*和丁春秋两个弟子．*我师父有个规矩，因他所学　*甚杂，谁要做掌门，各种本　*事都要比试，不但比武，还　*得比琴棋书画．*但丁春秋於各种杂学一窍不*通，眼见掌门人无望，竟忽*施暗算将师父打落深谷，又*将我打得重伤．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2027,0,1);   --  1(1):[WWW]说: 这人真是可恶．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2028,52,0);   --  1(1):[苏星河]说: 後来师父趁机诈死，*又设下了这个棋局，*想藉此找出悟性高的人．*立他为掌门，并传他功力，*将来好除去丁春秋这恶贼．**今天，我们终於出现了能破*解此珍珑的人，师父在传完*他功力後也仙逝了．*掌门师弟，我逍遥派的门户*就靠你清理了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2029,49,0);   --  1(1):[虚竹]说: 我是误打误撞的，并没有什*麽悟性．更何况我是少林弟*子，怎能改投别派．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2030,0,1);   --  1(1):[WWW]说: 贤弟悟性没有，”误”性却*很高，我看你别当和尚了，*做个掌门不是很好．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2031,49,0);   --  1(1):[虚竹]说: 可是．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2032,0,1);   --  1(1):[WWW]说: 别可是了，你看，这位老前*辈因为要传你毕生功力而逝*去，你还忍心拒绝人家吗．*况且，那丁春秋也是个无恶*不作，罪无可赦的恶徒呀．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2033,49,0);   --  1(1):[虚竹]说: ．．．．．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2034,0,1);   --  1(1):[WWW]说: 好，我看就这样了．*苏前辈，我们会去找那星宿*老怪，杀了他替你师父报仇
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2035,52,0);   --  1(1):[苏星河]说: 老朽谢谢这位少侠的帮忙．***掌门师弟，此去路上一切要*小心，丁春秋那老贼行事卑*鄙．．．．*对了，我有一个徒弟医术高*明，人称”阎王敌”的薛神*医，你可以去找他帮忙．*见到他时只要出示掌门信物*的”七宝指环”即可．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,1,1,581,-1,-1,6522,6522,6522,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,0,1,1,537,-1,-1,6340,6340,6340,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(35,3,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[星宿海]:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_41(49,128,1);   --  41(29):虚竹得到物品七宝指环1
    instruct_41(49,56,1);   --  41(29):虚竹得到物品天山六阳掌1
    instruct_41(49,40,1);   --  41(29):虚竹得到物品小无相功1
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2036,0,1);   --  1(1):[WWW]说: 贤弟，我们走了吧．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label0
        instruct_1(175,49,0);   --  1(1):[虚竹]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_46(49,300);   --  46(2E):虚竹增加内力300
    instruct_48(49,200);   --  48(30):虚竹增加生命200
    instruct_47(49,30);   --  47(2F):虚竹增加攻击力30
    instruct_45(49,20);   --  45(2D):虚竹增加轻功20
    instruct_33(49,15,0);   --  33(21):虚竹学会武功天山六阳掌
    instruct_49(49,2);   --  49(31):虚竹内力属性2
    instruct_10(49);   --  10(A):加入人物[虚竹]
    instruct_3(28,0,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [0]
    instruct_3(28,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [1]
    instruct_3(28,2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [2]
    instruct_8(3);   --  8(8):切换大地图音乐
--end

