--function oldevent_600()
    instruct_1(2237,37,0);   --  1(1):[狄云]说: 谢谢兄台救了我．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(1,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_1(2234,0,1);   --  1(1):[WWW]说: 这样好了，你要不要和我一*起走，路上也有个照应．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,60,100,6,0) ==false then    --  28(1C):判断WWW品德60-100是则跳转到:Label1
        instruct_1(2236,37,1);   --  1(1):[狄云]说: 不了！*我这个不幸之人还是别害人*的好．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1


    if instruct_20(0,6) ==true then    --  20(14):队伍是否满？否则跳转到:Label2
        instruct_1(175,37,0);   --  1(1):[狄云]说: 你的队伍已满，*我无法加入．
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_1(2235,37,0);   --  1(1):[狄云]说: 好吧！如果你不怕被我这个*不幸之人连累的话．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,10,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_10(37);   --  10(A):加入人物[狄云]
    instruct_37(3);   --  37(25):增加道德3
--end

