--function oldevent_204()
    instruct_1(697,0,1);   --  1(1):[WWW]说: 今天嵩山顶上似乎很热闹？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(698,84,0);   --  1(1):[???]说: 今日是我五岳剑派并派的大*日子．*闲杂人等，还请离去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(699,0,1);   --  1(1):[WWW]说: 这样大的盛会，*怎能少得了大爷我．*快让让．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(700,84,0);   --  1(1):[???]说: 阁下再不离去，*休怪我们不客气了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(701,0,1);   --  1(1):[WWW]说: 我正有此意．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(29,3,0,0) ==false then    --  6(6):战斗[29]是则跳转到:Label0
        instruct_15(83);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0

    instruct_3(-2,1,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,205,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,-2,-2,205,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_56(2);   --  56(38):提高声望值2
--end

