--function oldevent_635()
    instruct_1(2358,54,0);   --  1(1):[袁承志]说: 袁某隐居海外，今日有客来*访，真是难得．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2359,0,1);   --  1(1):[WWW]说: 袁兄一人独居海外，是想要*专心练功吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2360,54,0);   --  1(1):[袁承志]说: 江湖恩怨，是是非非，袁某*不想再有所牵连．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2361,0,1);   --  1(1):[WWW]说: 小弟是初入江湖，虽觉得江*湖中风风雨雨，人心难测，*但又必须走完这一遭．*常言说的好，*”人在江湖，身不由己”．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2362,54,0);   --  1(1):[袁承志]说: 你还看不开这一切吗，*武功，名利，你争的是那一*样．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2363,0,1);   --  1(1):[WWW]说: 小弟的确有不得已的苦衷，*才会在武林中打拼．**你说的对，我是想追求更高*深的武功，而且想打败江湖*群雄，夺得那武林盟主的地*位．但这一切，都只是为了*让我离开这里，回到属於我*的地方罢了．*唉！袁兄可能听不懂我在念*什麽，小弟失礼了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2364,54,0);   --  1(1):[袁承志]说: 听起来你好像有一些苦衷是*吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2365,0,1);   --  1(1):[WWW]说: 原以为我是个幸运者，有缘*玩到这个最真实的游戏，但*是却没想到是这麽的困难．*我现在真想回家．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2366,54,0);   --  1(1):[袁承志]说: 我虽不太了解你的问题，但*年轻人怎可遇到困难就垂头*丧气，想当年我也是初生之*犊不畏虎，在历经许多的困*难後，不也是熬过来了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2367,0,1);   --  1(1):[WWW]说: 这麽说，袁兄也是过来人．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2368,54,0);   --  1(1):[袁承志]说: 是的，别灰心．*记住，有志者事竟成．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2369,0,1);   --  1(1):[WWW]说: 听袁兄这一席话，我心情好*多了．**我要再赶紧打起精神，寻找*那”十四天书”去．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2370,54,0);   --  1(1):[袁承志]说: 原来你所说的困难是这个，*的确，这不是件简单的事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2371,0,1);   --  1(1):[WWW]说: 听袁兄语气，似乎知道一点*线索？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2372,54,0);   --  1(1):[袁承志]说: 不错，其中一本”碧血剑”*的确与我有些渊源．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2373,0,1);   --  1(1):[WWW]说: 那还请袁兄帮帮忙．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2374,54,0);   --  1(1):[袁承志]说: 不行，现在年轻人都想不劳*而获吗！*你必须靠你自己的努力，这*样得来的果实才会甜美．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2375,0,1);   --  1(1):[WWW]说: 是．袁兄教诲的是．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2376,54,0);   --  1(1):[袁承志]说: 若想获得这本书，*你必须经过三道考验．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2377,0,1);   --  1(1):[WWW]说: 三道考验？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2378,54,0);   --  1(1):[袁承志]说: 是的．***第一道是”智”的考验．*在华山附近有个非常隐蔽的*山洞，你必须找到它．*第二道是”勇”的考验．*这山洞其实是当年金蛇郎君*隐居的地方，其中有把金蛇*剑插在石头上，你必须有足*够的武力才能将它拔出．**第三道是”仁”的考验．*在你拔出金蛇剑後，再回到*我这里，我要看看你在江湖*中的表现来评断，若能保持*在正道之上，我就将”碧血*剑”一书送给你．*你去吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,636,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_8(3);   --  8(8):切换大地图音乐
--end

