--function oldevent_181()

    if instruct_4(193,1,0) ==false then    --  4(4):是否使用物品[金盆洗手请帖]？是则跳转到:Label0
        do return; end
    end    --:Label0

    instruct_32(193,-1);   --  32(20):物品[金盆洗手请帖]+[-1]
    instruct_1(648,82,0);   --  1(1):[???]说: 这位少侠请进．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,0,-2,-2,183,-1,-1,5192,5192,5192,-2,30,48);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,20,-2,-2,183,-1,-1,5186,5186,5186,-2,27,48);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,1,-2,-2,183,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,-2,-2,183,-1,-1,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end

